{"data": [{"body": "when will you be getting the next batch of PS5 consoles in. Cheers", "score": 0, "created_utc": 1612839504, "company": "amazon"}, {"body": "I have somehow subscribed to and I can't contact to cancel or see how this happened. Can someone contact me?", "score": 0, "created_utc": 1612839355, "company": "amazon"}, {"body": "you need to open the door to accepting cryptocurrency on your website! As one of the largest online retailers you should be paving the way for the future of our economy #dogecoin #bitcoin #DogecoinToTheMoon #DogecoinToTheMoon", "score": 0, "created_utc": 1612839285, "company": "amazon"}, {"body": "Concern person please look into the matter !!!", "score": 0, "created_utc": 1612839116, "company": "amazon"}, {"body": "Food insecurity due in no small part to the plutocratic fascism supported by Amazon and other large elitist companies that are profiting from it. Prove me wrong.", "score": 0, "created_utc": 1612838395, "company": "amazon"}, {"body": "My account is in .com, is very VERY disgusting having to log in, be redirected to .es and then have to move back to .com. I never purchased anything outside , honestly I can't care less for other marketplaces (.co.uk, .es or whatever)", "score": 0, "created_utc": 1612837687, "company": "amazon"}, {"body": "Stop stealing drivers tips..", "score": 0, "created_utc": 1612837135, "company": "amazon"}, {"body": "Stop fighting the rights of workers to united,have a union.", "score": 0, "created_utc": 1612837083, "company": "amazon"}, {"body": "I have got fake dilivery i have order high pressure car washer and i got something mobile keeping product", "score": 1, "created_utc": 1612836417, "company": "amazon"}, {"body": "Why as a company do you not have a department to weed out this ugly stuff? Is this hate what Amazon is? Is that your brand? \"We traffic in hate.\" ?", "score": 0, "created_utc": 1612836334, "company": "amazon"}, {"body": "Return pickup not being arranged for inspite of several requests . Not refunding my money.Ruthless customer care behaviour", "score": 2, "created_utc": 1612836201, "company": "amazon"}, {"body": "your excuses for why all my stuff is late are crap.", "score": 1, "created_utc": 1612836064, "company": "amazon"}, {"body": "A happy customer's feedback beaming_face_with_smiling_eyes", "score": 0, "created_utc": 1612835934, "company": "amazon"}, {"body": "People are scaming with your name today only I got a call wherein the girl was asking me to enter some keyword Please listen to the call recording sent you through message and do something as there are innocent people who can fall in this trap.", "score": 1, "created_utc": 1612835799, "company": "amazon"}, {"body": "any danger in adding a volume control setting so my child can't turn pepper pig up to full volume every 15 seconds on the amazon fire kids tablet. Thanks on behalf of all the world! #TURNITDOWN #Sortitout", "score": 0, "created_utc": 1612835774, "company": "amazon"}, {"body": "why would my parcel go all the way to Aberdeen when I'm in Dundee? You have to drive thru Dundee to get to Aberdeen.....?", "score": 0, "created_utc": 1612835644, "company": "amazon"}, {"body": "please resolve the issue asap", "score": 0, "created_utc": 1612835121, "company": "amazon"}, {"body": "you have put my account on hold I have sent you the bank statement which you say is no good although it shows everything you asked for. I have since told them to close the account and I keep getting told to send a statement in. I DONT WANT IT ANYMORE I WSNT MY MONEY", "score": 1, "created_utc": 1612835032, "company": "amazon"}, {"body": "will there be people out today delivering packages", "score": 1, "created_utc": 1612834786, "company": "amazon"}, {"body": "Please stop your platform from being used to abuse and witchhunt innocent people for expressing their view by many believe as being the truth, but few criminals using your platform to attack ppl.", "score": 1, "created_utc": 1612833380, "company": "amazon"}, {"body": "I think Amazon can be the best place using bitcoin. But still behind Tesla.", "score": 0, "created_utc": 1612833107, "company": "amazon"}, {"body": "please be nice to me and have my 10+ orders get to me on time for my sons first bday party!!! crossed_fingers_medium-light_skin_tone crossed_fingers_medium-light_skin_tone crossed_fingers_medium-light_skin_tone please no more running late packages loudly_crying_face", "score": 0, "created_utc": 1612832969, "company": "amazon"}, {"body": "I got call from +918902433297 from behalf of amzon promotion offered me I phone and want to pay 5000 in that account Kindly look into matter of that some one running scam I guess", "score": 2, "created_utc": 1612831758, "company": "amazon"}, {"body": "#Pushpendra Singh Today's winner 09/02/200/21", "score": 0, "created_utc": 1612831217, "company": "amazon"}, {"body": "hey WHY THE FUCK DOES THE VOLUME ON ALEXA GET LOUDER FOR NO REASON???????? even after asking her to be on volume 1, especially IF I'm wispering?!?!?!??!?!?!?!!?! whats the point for real like FUCK YOU", "score": 1, "created_utc": 1612831045, "company": "amazon"}, {"body": "Stop virtue signaling, a**holes.", "score": 0, "created_utc": 1612830731, "company": "amazon"}, {"body": "in talks to use #TreoZor electric 3-wheelers for logistics operations Follow to get regular #updates from #SupplyChain #logistics industry #DigitalSupplyChain #Warehousing #covid #Transportation #DriveElectric #3PL #ML #AI #DemandForecasting", "score": 8, "created_utc": 1612830550, "company": "amazon"}, {"body": "Intervene required Please look into the matter", "score": 0, "created_utc": 1612830431, "company": "amazon"}, {"body": "fire stick isn't working but everything else using WiFi is", "score": 0, "created_utc": 1612830216, "company": "amazon"}, {"body": "Hey, I received a call from 083460 79144. It said that I had won some contest and hence I was among some top 10 winners. I had to place an order of upto Rs. 10,000 till 3.30 pm to win something. Is this true? If yes why phone calls instead of mail confirmation?", "score": 1, "created_utc": 1612829239, "company": "amazon"}, {"body": "imy order still not received, i don't know what the hell is going on, i called 3times to customer executive, i don't know when i'll receive my order, please reply me,", "score": 2, "created_utc": 1612829205, "company": "amazon"}, {"body": "please for the citizens loyal prime members allow them to use food stamps card to buy MEAT,POTATOES &amp; so on I'm trying to help people in this covid19 times I'm willing to pay for prime as a gift but no meat mostly junk on snap ebt food stamp", "score": 1, "created_utc": 1612829061, "company": "amazon"}, {"body": "site to try and persuade and block employees from unionizing in a warehouse in Bessemer, Alabama is so cringe. They will have a union decision by the end of March when voting ends. This will be interesting to watch.", "score": 0, "created_utc": 1612828645, "company": "amazon"}, {"body": "mushrooming power has met an unlikely foe Bessemer, Alabama | Hamilton Nolan", "score": 0, "created_utc": 1612828307, "company": "amazon"}, {"body": "how can I have a 106 day streak yet the challenge says I only read 26 days in January??", "score": 0, "created_utc": 1612827806, "company": "amazon"}, {"body": "Hello Amazon Team , I have cancel order but long time i didn't get refund customer care service told me your money initiate your account but not get money my account .. so plz help me and resolve this issue ..", "score": 0, "created_utc": 1612827515, "company": "amazon"}, {"body": "Philanthropy isn't justice", "score": 1, "created_utc": 1612827351, "company": "amazon"}, {"body": "figure this thing out!! I need that app!!", "score": 0, "created_utc": 1612827269, "company": "amazon"}, {"body": "you promised customers that you would stop the #AmazonPriceGouging that got worse during the #COVID pandemic. So, why are merchants charging $24+ to $40+ for the $14.99 #Mandalorian Wherever I go, he goes. 1000 pieces puzzle?", "score": 0, "created_utc": 1612827230, "company": "amazon"}, {"body": "Curious...do these companies really think people aren't leaving their homes on a normal basis?", "score": 0, "created_utc": 1612826729, "company": "amazon"}, {"body": "just watched a commercial during Warriors game where amazon is touting they have given away over 12 million meals... Ayicia &amp; Steph Curry have given away over 15 million meals since pandemic started. You would think a multi-billion $ corp could do better", "score": 0, "created_utc": 1612826388, "company": "amazon"}, {"body": "are you asking for id from Nigerians?", "score": 0, "created_utc": 1612825914, "company": "amazon"}, {"body": "i don't like where the arrow is pointing", "score": 0, "created_utc": 1612825741, "company": "amazon"}, {"body": "Same day again!!!! -30% middle class small businesses demolished +Enormous billion $ earnings for metropolis sized companies Which entities will be forced to face their shadow. Merry go rounds are for children. $amc #gme #amc $gme #wallstreetbets #wallstreetsbets", "score": 3, "created_utc": 1612825724, "company": "amazon"}, {"body": "i have been trying to return my damaged product but in vain. Its almost been 1 month. My Amazon order id is 402 7843783 5060301", "score": 0, "created_utc": 1612825614, "company": "amazon"}, {"body": "my question is very easy android devices are more safe or apple devices? Then why I can't use amazon pay on iPhone 6 series? Peoples can use Amazon pay on Android why I can't? See attached snap below", "score": 1, "created_utc": 1612824787, "company": "amazon"}, {"body": "this might go unnoticed by you guys but please develop an app or a feature on the current all that allows creators to delete VODs and Clips from their phones", "score": 0, "created_utc": 1612824721, "company": "amazon"}, {"body": "I need my Mobile to be returned why do you Give fake products ?? very bad experience Why do you cheat Hardened money !!!! Very Bad experience !!", "score": 1, "created_utc": 1612824679, "company": "amazon"}, {"body": "can you also deliver I. Person education for the future generations? and are hopelessly incompetent and I rather want you to take my tax and outsource teachers to make 5 days in person Ed for all kids happen. #openschools", "score": 0, "created_utc": 1612824005, "company": "amazon"}, {"body": "amazon use sellers mony and deactivat also pages of sellers amazing", "score": 1, "created_utc": 1612823848, "company": "amazon"}, {"body": "in covid 19 people helping eatch others becose many families now no have earning way but amazon just save his own bank balence deactivat all", "score": 0, "created_utc": 1612823771, "company": "amazon"}, {"body": "sends me the wrong Screen protector for my 12 Mini (Fail U... via", "score": 1, "created_utc": 1612823695, "company": "amazon"}, {"body": "I pay for prime and I get nothing literally nothing in the prime shipping time that is stated when I order the items. Birthday gifts late, Christmas gifts late, funeral items late. you guys suck. And then you charge me extra money to return an item that was late..", "score": 0, "created_utc": 1612823548, "company": "amazon"}, {"body": "I don't know if you people know how bad, how very very bad your Prime video is?!!!! For this company being one of the richest companies all the world. You're streaming services suck completely completely and totally suck. We can't go forward or reverse without problems!!!", "score": 1, "created_utc": 1612823542, "company": "amazon"}, {"body": "I PREORDERED THIS THE DAY IT WAS ANNOUNCED SO HOW DID I NOT RECEIVE IT face_with_symbols_on_mouth face_with_symbols_on_mouth face_with_symbols_on_mouth RIDICULOUS SERIOUSLY NO POINT IN PREORDERING ON AMAZON EVER", "score": 0, "created_utc": 1612823230, "company": "amazon"}, {"body": "if you acquired you could convert, add pickup lockers, possible book sales locations, remote offices. For food convert it with select Whole Foods options (food court) no one could tell the price difference lmao. Save theatres and movie going!", "score": 1, "created_utc": 1612823225, "company": "amazon"}, {"body": "what is the point of preordering something if you guys are gonna CANCEL MY ORDER WHEN IT GETS RELEASED face_with_symbols_on_mouth THIS IS TYE SECOND TIME YOU GUYS DID THIS. I WILL NEVER PREORDER ON AMAZON EVER AGAIN THIS IS RIDICULOUS", "score": 1, "created_utc": 1612822919, "company": "amazon"}, {"body": "$1,000 Amazon Gift Card Giveaway! Hello Dear, Feed you &amp; your family. Save more in the Amazon Shops! Get a $1,000 Amazon Gift Card giveaway. Just start with your Mail. Mail here to get gift card", "score": 0, "created_utc": 1612822412, "company": "amazon"}, {"body": "I would really like to change my prime to student, but links to information regarding a membership change to student does nothing. It really shouldn't be this hard.", "score": 1, "created_utc": 1612822184, "company": "amazon"}, {"body": "got me fucked up. My package was suppose to come on Friday... it's Monday &amp; all it says is slightly_smiling_face", "score": 1, "created_utc": 1612822088, "company": "amazon"}, {"body": "Where's my dinner?", "score": 0, "created_utc": 1612821544, "company": "amazon"}, {"body": "Please look into how Allied is treating the very same people who are protecting your buildings 24/7. Leadership is so blatantly disrespectful towards employees ESPECIALLY people of color.", "score": 7, "created_utc": 1612821256, "company": "amazon"}, {"body": "I am professional social media marketer. I can increase sales or grow business for any company by promoting through social media marketing. If anyone want to increase sales his/her product specially Amazon Shopify Etsy or personal anything whatever you want. Contact me please", "score": 0, "created_utc": 1612821125, "company": "amazon"}, {"body": "will you please accept #dogecoin as a form of payment? #DogecoinRise #DOGE #Dogecoinarmy", "score": 4, "created_utc": 1612820907, "company": "amazon"}, {"body": "please hire me.", "score": 0, "created_utc": 1612820664, "company": "amazon"}, {"body": "1. Never got my groceries tonight or update on it. 2. Called customer service, 1st rep said she'd look into it. Call gets dropped. 3. Call again, 2nd rep transfers me to another rep &amp; she said just to reorder my food. #WorstCustomerService", "score": 2, "created_utc": 1612820456, "company": "amazon"}, {"body": "How about you lobby for a meaningful lockdown AND pay your workers a living wage A N D let them unionize you fuckers.", "score": 1, "created_utc": 1612820418, "company": "amazon"}, {"body": "My wife could use your help.", "score": 1, "created_utc": 1612820199, "company": "amazon"}, {"body": "????? african headband?", "score": 0, "created_utc": 1612820011, "company": "amazon"}, {"body": "treat ur employees like human beings", "score": 0, "created_utc": 1612819896, "company": "amazon"}, {"body": "Does she deliver the food to herself give her wages working for Amazon?", "score": 1, "created_utc": 1612819858, "company": "amazon"}, {"body": "idk why y'all have seasonal/temporary workers when y'all deadass need all the help u can get WHY IS IT THAT NOW any time I order anything it's either late asf or gets lost WTF IS THAT!!??", "score": 1, "created_utc": 1612819611, "company": "amazon"}, {"body": "skit I made about covid lol check it out great content", "score": 0, "created_utc": 1612819598, "company": "amazon"}, {"body": "really needs to do this would be very smart", "score": 0, "created_utc": 1612819552, "company": "amazon"}, {"body": "this you??", "score": 0, "created_utc": 1612819113, "company": "amazon"}, {"body": "quiz time", "score": 0, "created_utc": 1612819023, "company": "amazon"}, {"body": "I received a product without price tag and have been trying to return it for a month now. Call centre reps promise a pick up and no one comes. Please help.", "score": 1, "created_utc": 1612818856, "company": "amazon"}, {"body": "Amazon please help me ..I again got problem with my top listing... I have opened the case on amazon on 4 but till now they are not found any solution of it and just replying with copy paste messages and happening nothing. Please Help.. 3 days gone without any sale.", "score": 0, "created_utc": 1612818819, "company": "amazon"}, {"body": "amazon treat your workers like people challenge", "score": 1, "created_utc": 1612818802, "company": "amazon"}, {"body": "(1/2)dear amazon got a call from +91 95706 26912,says amazon did a lucky draw and u won tata safari, and winner name will be announced on news channel #aajtak on 12Feb21.Asked for WhatsApp number n PAN,AADHAR etc.Please take action such frauds!", "score": 1, "created_utc": 1612818778, "company": "amazon"}, {"body": "quiz time", "score": 0, "created_utc": 1612818750, "company": "amazon"}, {"body": "how many people need to complain before you stop letting workers ship books out in bubble envelopes?", "score": 2, "created_utc": 1612818666, "company": "amazon"}, {"body": "The Union is gunna put you on your knees", "score": 0, "created_utc": 1612818390, "company": "amazon"}, {"body": "How about you stop letting Unscrupulous Chinese sellers dump shit product on your platform and undermine American sellers. I'm tired of seeing recently launched brands like WAMPUM or YUMKNOW selling knockoffs and IP infringing trash.", "score": 0, "created_utc": 1612817977, "company": "amazon"}, {"body": "I got you guys confused with this gal...", "score": 0, "created_utc": 1612817891, "company": "amazon"}, {"body": "has been getting worse with delivering. Nothing is ever delivered Prime. How is it when I looked at like 2pm today, it was Out for delivery and only 8 stops before mine. Then it moved it to before 10pm. Now, it's delivered between today and tomorrow. face_with_symbols_on_mouth", "score": 1, "created_utc": 1612817674, "company": "amazon"}, {"body": "Might want to put 4 wheel drive on your trucks", "score": 0, "created_utc": 1612817382, "company": "amazon"}, {"body": "Take care of ur employees 2", "score": 1, "created_utc": 1612817116, "company": "amazon"}, {"body": "I need a job can I work for you", "score": 1, "created_utc": 1612816970, "company": "amazon"}, {"body": "Did she also design the system that requires delivery drivers wear diapers because they don't have time to go to the bathroom?", "score": 1, "created_utc": 1612816715, "company": "amazon"}, {"body": "This woman is thicc", "score": 0, "created_utc": 1612816693, "company": "amazon"}, {"body": "I hope so. You can sure afford it", "score": 0, "created_utc": 1612816664, "company": "amazon"}, {"body": "really tried me by leaving my package downstairs in the open hallway right by our mailboxes and saying that they left in the mailroom", "score": 1, "created_utc": 1612816377, "company": "amazon"}, {"body": "While underpaying drivers as independent contractors with no benefits middle_finger_light_skin_tone", "score": 0, "created_utc": 1612816269, "company": "amazon"}, {"body": "I'm getting really upset and stressed out with your customer support for almost 2 weeks over a defective smartphone that I can't return.", "score": 1, "created_utc": 1612816249, "company": "amazon"}, {"body": "While crushing small business.", "score": 0, "created_utc": 1612815911, "company": "amazon"}, {"body": "I do my best to purchase from anyone other than amazon", "score": 0, "created_utc": 1612815371, "company": "amazon"}, {"body": "has DICK TRACY on Blu-ray for the low price of $6.99 (plus an additional 53 cents off with coupon)! Snag a copy now #amazondeal #bluray #dicktracy", "score": 0, "created_utc": 1612815308, "company": "amazon"}, {"body": "Let your people UNIONIZE", "score": 1, "created_utc": 1612814968, "company": "amazon"}, {"body": "This was a wonderful news! Now stop with the union busting.", "score": 1, "created_utc": 1612814887, "company": "amazon"}, {"body": "I'm done with amazon", "score": 0, "created_utc": 1612814688, "company": "amazon"}, {"body": "is rolling out its contactless palm reader to an additional three Amazon Go stores.", "score": 0, "created_utc": 1612814400, "company": "amazon"}, {"body": "Why don't you pay your workers better All you do is extract money from their work", "score": 0, "created_utc": 1612814295, "company": "amazon"}, {"body": "You also censor free speech, and that's why I cancelled you.", "score": 1, "created_utc": 1612814236, "company": "amazon"}, {"body": "Amazon workers Unionize. It's the only way you'll have power comparable to these mofo's spending what should be your pay on advertisements designed to distract from your plight.", "score": 1, "created_utc": 1612814211, "company": "amazon"}, {"body": "I buy almost everything on Amazon. Lately it's been really hard to trust it's reviews. Almost everything buy has a coupon for free products or cash back on exchange for a 5 star review. Seriously changing my purchasing habits now.", "score": 0, "created_utc": 1612814116, "company": "amazon"}, {"body": "UNION YES", "score": 2, "created_utc": 1612814040, "company": "amazon"}, {"body": "Amozon your company fraud my product order on. 403-5024556-9816322 , picked up and take to returns and we were promised 3 to 5 working Days money will be Refunded during the day. Excess time has not been Refunded. I'm long time waiting please help me.", "score": 0, "created_utc": 1612813933, "company": "amazon"}, {"body": "Amozon your company fraud my product order on. 403-5024556-9816322 , picked up and take to returns and we were promised 3 to 5 working Days money will be Refunded during the day. Excess time has not been Refunded. I'm long time waiting please help me.", "score": 0, "created_utc": 1612813863, "company": "amazon"}, {"body": "How about helping your workers in need by supporting unionization?", "score": 2, "created_utc": 1612813811, "company": "amazon"}, {"body": "you behind your workers", "score": 0, "created_utc": 1612813727, "company": "amazon"}, {"body": "will you be adding a search filter to make it easy to exclude products made in Xinjiang? Or preferably anywhere in China?", "score": 0, "created_utc": 1612813726, "company": "amazon"}, {"body": "are you free february 14? cuz i am.", "score": 0, "created_utc": 1612813625, "company": "amazon"}, {"body": "I bought MRF tyre from vendor MRF VIKAS AUTOMOBILE via amazon order no 171-8859975-4045113. I got jk tyre instead of mrf tyre. I filed for replacement. In replacement i got a tube instead of tyre..i am suprised how a tube can be a replace a tyre", "score": 10, "created_utc": 1612813348, "company": "amazon"}, {"body": "after getting abused by ur delivery agent, now the item is showing as delivered.. first u ask for extra changers to delivery item, 2 abuse,3, show item as delivered.. wat a great service folded_hands_light_skin_tone", "score": 1, "created_utc": 1612813141, "company": "amazon"}, {"body": "accept dogecoin as payment!", "score": 1, "created_utc": 1612812869, "company": "amazon"}, {"body": "Amazon also dismantled Parler. Buh bye.", "score": 0, "created_utc": 1612812849, "company": "amazon"}, {"body": "Buncha bullshit. F the government", "score": 0, "created_utc": 1612812836, "company": "amazon"}, {"body": "why have you removed commenting ability on posts????? We love those!! and need those!! I always asked and answered questions! please bring it back!!!!!", "score": 1, "created_utc": 1612812713, "company": "amazon"}, {"body": "this is not the mailroom! You did not hand anything to receptionist because we don't have one woman_facepalming_medium-dark_skin_tone", "score": 1, "created_utc": 1612812672, "company": "amazon"}, {"body": "We are done with you, Amazon. Bye.", "score": 0, "created_utc": 1612812649, "company": "amazon"}, {"body": "Stop union-busting, you POS.", "score": 1, "created_utc": 1612812632, "company": "amazon"}, {"body": "That's it? How's bezos bank account I hate a greedy pig!! I hope those donations were to Americans in need and medical equipment to our first responders!!!", "score": 1, "created_utc": 1612812593, "company": "amazon"}, {"body": "Amazon do yall take #dogecoin?", "score": 0, "created_utc": 1612812416, "company": "amazon"}, {"body": "how about paying taxes", "score": 1, "created_utc": 1612812346, "company": "amazon"}, {"body": "Yay for Amazon. Heroes of the world.", "score": 0, "created_utc": 1612812260, "company": "amazon"}, {"body": "is my best friend. red_heart Love you", "score": 0, "created_utc": 1612812253, "company": "amazon"}, {"body": "Meet some of our former employees who obviously disregarded our stringent safety measures.", "score": 4, "created_utc": 1612812190, "company": "amazon"}, {"body": "Hey and why don't you just Eff Off with the feelgood BS lies, and let your workers unionize. What's the matter, you not rich enough yet?", "score": 2, "created_utc": 1612812174, "company": "amazon"}, {"body": "We stole tips from employees and now Whole Foods employees only have ten minute breaks instead of 15 because we are a truly evil, greedy, disgusting company!", "score": 2, "created_utc": 1612812166, "company": "amazon"}, {"body": "Amazon steals tips", "score": 2, "created_utc": 1612812100, "company": "amazon"}, {"body": "Really...hope you go down in FLAMES...POS! nauseated_face nauseated_face nauseated_face", "score": 1, "created_utc": 1612812051, "company": "amazon"}, {"body": "But, how are you treating your employees?", "score": 1, "created_utc": 1612812041, "company": "amazon"}, {"body": "and who created the slowburn habanero salmon salad and how many awards and how much in bonus dollars have they earned? #slowburn", "score": 0, "created_utc": 1612811934, "company": "amazon"}, {"body": "what do you understand about working hours.. your untrained delivery boy came home to early morning in this season..6am to8am how disgusting services again i was trying to sleep then call Center lady called me .pls stop your this kind of b...y unorganised stuff", "score": 1, "created_utc": 1612811822, "company": "amazon"}, {"body": "Vote by mail....unless you want to unionize", "score": 0, "created_utc": 1612811810, "company": "amazon"}, {"body": "I have played on Amazon", "score": 0, "created_utc": 1612811714, "company": "amazon"}, {"body": "people matter, even the ones who work for a living", "score": 0, "created_utc": 1612811694, "company": "amazon"}, {"body": "sent me a box with nothing in it last night. skull weary_face No cap. I ain't order this y'all. rolling_on_the_floor_laughing", "score": 2, "created_utc": 1612811616, "company": "amazon"}, {"body": "Please stop #selling digital products from ur market place.Been not more than 2months that we ordered a Mac USB Adaptor and it has stopped working.What a poor #Quality of the product listed in your matketplace. Need to replace the #product or #refund", "score": 3, "created_utc": 1612811576, "company": "amazon"}, {"body": "whores", "score": 0, "created_utc": 1612811397, "company": "amazon"}, {"body": "Amazon india customer service sucks . As a prime customer issue outstanding for over 3 weeks . Moving to Flipkart or reliance digital .", "score": 1, "created_utc": 1612811213, "company": "amazon"}, {"body": "Don't you just love it, those that create the situation want to be heralded as the ones to help offset their actions. In this case, Amazon enriching themselves off of their political friends destroying small business thru lockdowns under the guise of pandemic mitigation.", "score": 1, "created_utc": 1612810863, "company": "amazon"}, {"body": "#sonu #amazonchocolatedayqyiz #valentinescarnival I hop i win this contest today.", "score": 0, "created_utc": 1612810811, "company": "amazon"}, {"body": "Food insecurities are engineered by 1st world countries so people like Az fresh and united fruit company can make more profits All the food by the way comes from latin america anyway Mark it up, sell it higher, land fill so much food that simply no one eats. First world proble", "score": 0, "created_utc": 1612810369, "company": "amazon"}, {"body": "OMG I NEED a Snow Blower! My yard machine snow blower broke during the 2 foot drop of snow here in the poconos of PA.", "score": 0, "created_utc": 1612810087, "company": "amazon"}, {"body": "chocolate day|valentines day", "score": 0, "created_utc": 1612809477, "company": "amazon"}, {"body": "#Daily QuizTime", "score": 0, "created_utc": 1612809454, "company": "amazon"}, {"body": "You rock!", "score": 0, "created_utc": 1612809424, "company": "amazon"}, {"body": "Helping those in need? While satisfying your greed, I suppose. In the time when the World is in crisis, Amazon manages to make record profits.", "score": 0, "created_utc": 1612809223, "company": "amazon"}, {"body": "So Jeff can be richer the parasite", "score": 0, "created_utc": 1612808987, "company": "amazon"}, {"body": "Amazon destroyed small business and we're supposed to like it and appreciate them face_with_symbols_on_mouth", "score": 4, "created_utc": 1612808860, "company": "amazon"}, {"body": "it's 2021 why doesn't your iphone app have dark mode", "score": 1, "created_utc": 1612808847, "company": "amazon"}, {"body": "My u no like American workers?", "score": 0, "created_utc": 1612808775, "company": "amazon"}, {"body": "I have 2 orders running late. Is there no accountability for ???", "score": 1, "created_utc": 1612808439, "company": "amazon"}, {"body": "Free Amazon gift cards -", "score": 0, "created_utc": 1612808354, "company": "amazon"}, {"body": "CAN I PLEASE HAVE SOME HELP WITH MY SELLERS ACCOUNT. I AM GETTING NO TYPE OF SUPPORT SND ITS FRUSTRATING!!!!! DO SOMETHING!!!", "score": 0, "created_utc": 1612808236, "company": "amazon"}, {"body": "#AmazonQuiz #AmazonValentineWeekGames still waiting face_with_tears_of_joy smiling_face_with_heart-eyes face_savoring_food sign_of_the_horns", "score": 2, "created_utc": 1612808234, "company": "amazon"}, {"body": "yo I need a male version of those sweats", "score": 0, "created_utc": 1612808166, "company": "amazon"}, {"body": "UNIONIZE AMAZON NOW", "score": 1, "created_utc": 1612807844, "company": "amazon"}, {"body": "you need to stop selling these products. This is cultural appropriation at its finest.", "score": 0, "created_utc": 1612807805, "company": "amazon"}, {"body": "Dear Amazon I don't want account of your fraud company. Your company and your team couldn't hide your fault by stating that account is closed. I want my matter to be investigated and refund for my product. I never thought this cheap level of activities done by your", "score": 1, "created_utc": 1612807597, "company": "amazon"}, {"body": "Bruh why they do this hdhchffh it's getting attention which is smart to advertise but also y'all's products are so creepy like no thanks", "score": 0, "created_utc": 1612807584, "company": "amazon"}, {"body": "Let your workers unionize.", "score": 0, "created_utc": 1612807549, "company": "amazon"}, {"body": "And getting rich doing it so, uh thanks?", "score": 0, "created_utc": 1612807528, "company": "amazon"}, {"body": "1. Hey Amazon What is wrong with your FLEX team? I have had this issue with my flex account for a while and decided to try again to resolve. I never did anything but sign in with my Amazon account info as Flex App says, and I have been told over &amp; over that a violated", "score": 1, "created_utc": 1612807514, "company": "amazon"}, {"body": "No thanks. Dumped Amazon. Amazon is a socialist company. So. Never again shop from Amazon", "score": 0, "created_utc": 1612807476, "company": "amazon"}, {"body": "not good, can't login #fail", "score": 1, "created_utc": 1612807279, "company": "amazon"}, {"body": "playing with my feelings bruh where's my stuff smh man_facepalming_medium-dark_skin_tone face_with_tears_of_joy", "score": 0, "created_utc": 1612807138, "company": "amazon"}, {"body": "No more Amazon for me. Stay out of politics and I'll come back. See ya for now.", "score": 0, "created_utc": 1612806769, "company": "amazon"}, {"body": "I am glad they will organize against you. Your workers are first responders and they need to unite against their working conditions and for their paycheck.", "score": 0, "created_utc": 1612806746, "company": "amazon"}, {"body": "...Thank you", "score": 0, "created_utc": 1612806737, "company": "amazon"}, {"body": "Deliver money", "score": 0, "created_utc": 1612806642, "company": "amazon"}, {"body": "had a product that missed the opportunity to sell me. Amazon has it all, without me needing to pay extra on shipping OR leaving the house to deal with lazy employees", "score": 0, "created_utc": 1612806510, "company": "amazon"}, {"body": "I have an 87 yo mom who i haven't seen in over a year She lives in mission tx (McAllen area) who is unable to get a vaccination and yet untested illegals are released and put in local hotels by the Feds! What insanity is this?!#leftdestroysUSA #Im1of75million", "score": 0, "created_utc": 1612806427, "company": "amazon"}, {"body": "I've had 3 items \"delayed in transit\" over the past month. They were all being handled by your own in-house shipping and delivery division. What's going on?", "score": 1, "created_utc": 1612806403, "company": "amazon"}, {"body": "People cant leave their homes is part of their plan", "score": 0, "created_utc": 1612806361, "company": "amazon"}, {"body": "Amazon...Proud to be the leader for team EVIL.", "score": 2, "created_utc": 1612806324, "company": "amazon"}, {"body": "Kevin is a loser", "score": 0, "created_utc": 1612806321, "company": "amazon"}, {"body": "Shame they can't pay their own staff enough to eat well.", "score": 2, "created_utc": 1612806305, "company": "amazon"}, {"body": "Because we made sure we were the only game in town.", "score": 1, "created_utc": 1612806285, "company": "amazon"}, {"body": "We think big and we crush anyone smaller than us.", "score": 2, "created_utc": 1612806249, "company": "amazon"}, {"body": "is there an explanation of why an echo show won't connect but dots and a regular echo are working fine. All plugs offline also. WiFi is working fine. Help please?", "score": 1, "created_utc": 1612806148, "company": "amazon"}, {"body": "Awesome!", "score": 0, "created_utc": 1612806016, "company": "amazon"}, {"body": "I ordered an iPad along with something else said it was delivered to the my front porch Saturday night I have dogs that bark at everything it was not delivered there waited to see if would come Sunday nope!", "score": 2, "created_utc": 1612805988, "company": "amazon"}, {"body": "Why is this food item opened? I can't return it, all I can do is give a review. This is disgusting.", "score": 1, "created_utc": 1612805773, "company": "amazon"}, {"body": "That's okay ... but we don't want you as a Public Servant!", "score": 0, "created_utc": 1612805626, "company": "amazon"}, {"body": "buy AMC and the contact me on ways to improve the quality of your product from a consumers perspective.", "score": 0, "created_utc": 1612805314, "company": "amazon"}, {"body": "And terrorizing your employees so they won't unionize smiling_face_with_hearts", "score": 3, "created_utc": 1612805069, "company": "amazon"}, {"body": "Wonderful that you helped under Biden administration and you didn't even offer help to TRUMP!", "score": 0, "created_utc": 1612804922, "company": "amazon"}, {"body": "is 2/2 throwing packages at my house the first complaint fell on deaf ears I see", "score": 1, "created_utc": 1612804876, "company": "amazon"}, {"body": "Be sure to thank the UPS, FedEx and USPS drivers for delivering all these extra orders during Covid19. They can't catch a break.", "score": 5, "created_utc": 1612804806, "company": "amazon"}, {"body": "don't give up loudly_crying_face . This is the most innovative company on the planet.", "score": 0, "created_utc": 1612804769, "company": "amazon"}, {"body": "My order came on time as usual when I only ordered one potato I thought maybe they'll send me two just as a clue Thank you", "score": 0, "created_utc": 1612804632, "company": "amazon"}, {"body": "WHY DO YOU HATE ME? loudly_crying_face I just want to buy things on there.", "score": 1, "created_utc": 1612804559, "company": "amazon"}, {"body": "Why can't be the Alexa Dot? Devices with Alexa built in come in a wide variety of shapes and sizes, and the best part is, they're all awesome... just like and", "score": 2, "created_utc": 1612804543, "company": "amazon"}, {"body": "While you steal wages from your drivers at the same time. You arent heroes.", "score": 2, "created_utc": 1612804474, "company": "amazon"}, {"body": "My Alexa just stopped working. I expected better", "score": 2, "created_utc": 1612804440, "company": "amazon"}, {"body": "will you be accepting #dogecoin soon?", "score": 5, "created_utc": 1612804323, "company": "amazon"}, {"body": "truck parked outside my house has been there for 15 minutes. He's on the phone. It's kind of annoying.", "score": 1, "created_utc": 1612804289, "company": "amazon"}, {"body": "Hahahahhaha! It's ok Kevin! There will be BETTER opportunities face_with_tears_of_joy face_with_tears_of_joy face_with_tears_of_joy face_with_tears_of_joy face_with_tears_of_joy face_with_tears_of_joy", "score": 0, "created_utc": 1612804212, "company": "amazon"}, {"body": "Launchpad #Kitchen #ad #deals", "score": 0, "created_utc": 1612804021, "company": "amazon"}, {"body": "is learning that it can't hire enough trucking companies to haul all its freight. So it decided to help would-be trucking entrepreneurs start their own firms. Read more about their accelerator program here delivery_truck backhand_index_pointing_down", "score": 0, "created_utc": 1612803600, "company": "amazon"}, {"body": "is that arrow pointing to your va jay jay", "score": 1, "created_utc": 1612803449, "company": "amazon"}, {"body": "hey thanks for reminding me to block unfunny and short", "score": 1, "created_utc": 1612803400, "company": "amazon"}, {"body": "he can be the new echo dot face_with_tears_of_joy face_with_tears_of_joy face_with_tears_of_joy", "score": 12, "created_utc": 1612803384, "company": "amazon"}, {"body": "I am weak!! you gonna take this face_with_tears_of_joy face_with_tears_of_joy", "score": 0, "created_utc": 1612803378, "company": "amazon"}, {"body": "Damn Amazon is straight dissing you as politely as possible face_with_tears_of_joy .", "score": 2, "created_utc": 1612803367, "company": "amazon"}, {"body": "Unionize!", "score": 0, "created_utc": 1612803360, "company": "amazon"}, {"body": "Y'all should start service to Raleigh-Durham", "score": 0, "created_utc": 1612803340, "company": "amazon"}, {"body": "I nominate", "score": 0, "created_utc": 1612803324, "company": "amazon"}, {"body": "Bernie Sanders Donald Trump, Jeff Bezos and Warren Buffett pay a lower tax rate than someone making $7.25 an hour. Let that sink in.", "score": 1, "created_utc": 1612803323, "company": "amazon"}, {"body": "your at it again pouting_face my husband's 4k fire stick remote quite work so you were supposed to send replacement and you just sent a fire stick no remote &amp; now can't replace the remote . I was told to place an order then callback to get credit .", "score": 2, "created_utc": 1612802982, "company": "amazon"}, {"body": "Why are these food and package handlers only wearing one mask?", "score": 1, "created_utc": 1612802961, "company": "amazon"}, {"body": "Literally!! weary_face", "score": 0, "created_utc": 1612802885, "company": "amazon"}, {"body": "Stop stealing from your employees", "score": 13, "created_utc": 1612802876, "company": "amazon"}, {"body": "any promo codes I can use on my purchase? via", "score": 0, "created_utc": 1612802684, "company": "amazon"}, {"body": "Amazon, Shipping Hitler's Book All Over The World To People In Government Offices. Spreading Satan's Ideology. Thanks Amazon For Assisting In Prophecy. I Don't Know If You Get Or Prize Or not. Most Likely Not.", "score": 0, "created_utc": 1612802562, "company": "amazon"}, {"body": "You are polluters", "score": 0, "created_utc": 1612802552, "company": "amazon"}, {"body": "I have just had some of the worst customer service on two seperate phone calls. I spent 18 years working in call centers and I had provided that poor of service I would have been fired. You need to train your reps better.", "score": 2, "created_utc": 1612802413, "company": "amazon"}, {"body": "I didn't get my package and no where on your site can I get ahold of a live person to discusswhat gives???", "score": 1, "created_utc": 1612802163, "company": "amazon"}, {"body": "are we not getting a pay increase?", "score": 0, "created_utc": 1612801902, "company": "amazon"}, {"body": "I have a complaint about your review system. Why do I require to spend $50 and have a credit card logged in for at least a year in order to review an item I bought. I believe that all I have to do is buy the item and it should allow me to leave a review.", "score": 2, "created_utc": 1612801626, "company": "amazon"}, {"body": "any promo codes I can use on my purchase? via", "score": 0, "created_utc": 1612801459, "company": "amazon"}, {"body": "O.K., it's a fantasy. I thought that bruh was sharing him woman like that. All is well", "score": 0, "created_utc": 1612801369, "company": "amazon"}, {"body": "I hope she's joining the union", "score": 5, "created_utc": 1612801157, "company": "amazon"}, {"body": "Please provide belts for your employees. Thanks in advance!", "score": 1, "created_utc": 1612801106, "company": "amazon"}, {"body": "voice really be the an Alexa voice, please? That would be sooo amazing! Thx!!!", "score": 0, "created_utc": 1612800973, "company": "amazon"}, {"body": "the cameras I got from you guys were set to alarm with movement. I had them facing the front and back door and didn't go off when my ex broke into my house and stole the cameras.", "score": 0, "created_utc": 1612800718, "company": "amazon"}, {"body": "I don't see the CEO application on your careers site, pls help. Very interested in this position", "score": 0, "created_utc": 1612800706, "company": "amazon"}, {"body": "please stop shipping with to South Florida. They don't care here and packages just never show up. This is the fourth package that has been marked delivered but no package. We're all at home, nobody is fooled. #USPS #Amazon", "score": 1, "created_utc": 1612800562, "company": "amazon"}, {"body": "workforce development?", "score": 0, "created_utc": 1612800512, "company": "amazon"}, {"body": "The Beast", "score": 0, "created_utc": 1612800071, "company": "amazon"}, {"body": "customer service is literally zero help.", "score": 1, "created_utc": 1612800057, "company": "amazon"}, {"body": "is it too much to ask for the driver to ring my door bell if you leave a bottle of water in my mail box in -30C weather? In fact - ring my door bell every time you leave a parcel at my door!", "score": 1, "created_utc": 1612799979, "company": "amazon"}, {"body": "extremely disappointed. Purchased a book and this is how my package was delivered? What a joke. No book inside. Ridiculous.", "score": 1, "created_utc": 1612799833, "company": "amazon"}, {"body": "rolling_on_the_floor_laughing rolling_on_the_floor_laughing Women have been (and are) objectified for centuries. All the sudden you all care because a damn fine man is being used??? Please. #AlexasNewBody", "score": 0, "created_utc": 1612799764, "company": "amazon"}, {"body": "I'm glad I have honest neighbors, three streets over, who bring me my packages when your delivery services leaves them at the wrong house. #comeonnow", "score": 1, "created_utc": 1612799636, "company": "amazon"}, {"body": "Dumb ass commercial", "score": 0, "created_utc": 1612799631, "company": "amazon"}, {"body": "Donate more!", "score": 0, "created_utc": 1612799358, "company": "amazon"}, {"body": "Anyone noticed the CRIMINAL Price Gouging when shopping on amazon? Zero Gov Accountability! Cyber Warfare, ALGORITHMS Using information against United_States Consumers. Beware, Vendors shipping products, half of business Ratings R BAD. Greedy TRENDING 2 Destroy United_States Families. fire United_States fire", "score": 0, "created_utc": 1612799064, "company": "amazon"}, {"body": "Your also shutting down conservative social media that doesn't think like you.", "score": 0, "created_utc": 1612798901, "company": "amazon"}, {"body": "can i use #Dogecoin and i have a special place in my heart for Amazon. Problem is i only use #dogecoin and i am afraid i won't be able your great services anymore. Any chance we can try to get dogecoin as payment. It will be great becase #doge is the future for earth.", "score": 4, "created_utc": 1612798899, "company": "amazon"}, {"body": "is the most awful service.", "score": 1, "created_utc": 1612798697, "company": "amazon"}, {"body": "BEZO IS IT FREE THE FOOD YOU BECAME 5 TIMES RICHER WHAT ARE YOU GIVING BACK", "score": 0, "created_utc": 1612798625, "company": "amazon"}, {"body": "can I get some support to resolve issue with deactivated account. I've submitted an appeal, no response, open support case closed no reply. No callback available. There is NO SUPPORT for sellers.", "score": 2, "created_utc": 1612798425, "company": "amazon"}, {"body": "And censorship. Avoid these monstrous monopolies that believe they can dictate your lifestyle.", "score": 0, "created_utc": 1612798411, "company": "amazon"}, {"body": "Can ya'll help this family out please. Is there anyway you can?!", "score": 1, "created_utc": 1612798162, "company": "amazon"}, {"body": "YOUR FIRESTICK FUCKING SUCKS IT ALWAYS HAS AND YOU REFUSE TO DO ANYTHING ABOUT IT FUCK YOUUUU", "score": 1, "created_utc": 1612798145, "company": "amazon"}, {"body": "Let your employees form unions next", "score": 8, "created_utc": 1612797894, "company": "amazon"}, {"body": "Buy Doge Coin crypto through voyager or Binance Or through Only 7 cents. To the moon!", "score": 0, "created_utc": 1612797796, "company": "amazon"}, {"body": "Buy Doge Coin crypto through voyager or Binance Or through Only 7 cents. To the moon!", "score": 0, "created_utc": 1612797788, "company": "amazon"}, {"body": "Buy Doge Coin crypto through voyager or Binance Or through Only 7 cents. To the moon!", "score": 0, "created_utc": 1612797781, "company": "amazon"}, {"body": "Buy Doge Coin crypto through voyager or Binance Or through Only 7 cents. To the moon!", "score": 0, "created_utc": 1612797774, "company": "amazon"}, {"body": "Buy Doge Coin crypto through voyager or Binance Or through Only 7 cents. To the moon!", "score": 0, "created_utc": 1612797765, "company": "amazon"}, {"body": "Buy Doge Coin crypto through voyager or Binance Or through Only 7 cents. To the moon!", "score": 0, "created_utc": 1612797757, "company": "amazon"}, {"body": "Buy Doge Coin crypto through voyager or Binance Or through Only 7 cents. To the moon!", "score": 0, "created_utc": 1612797746, "company": "amazon"}, {"body": "Buy Doge Coin crypto through voyager or Binance Or through Only 7 cents. To the moon!", "score": 0, "created_utc": 1612797733, "company": "amazon"}, {"body": "Buy Doge Coin crypto through voyager or Binance Or through Only 7 cents. To the moon!", "score": 0, "created_utc": 1612797712, "company": "amazon"}, {"body": "ok so after years of using amazon i am being refused refund even after returning the item which has been in transit for 14 days. I am being forced to Leave my home during the pandemic to use cash as i cant shop online thanks amazon", "score": 1, "created_utc": 1612797464, "company": "amazon"}, {"body": "A stupid gesture for a fake plandemic", "score": 0, "created_utc": 1612797387, "company": "amazon"}, {"body": "is fucked up. I send a link to me boyfriend to order something at a price I'm willing to pay. I look at his account and Amazon charged him more", "score": 1, "created_utc": 1612796841, "company": "amazon"}, {"body": "please deliver everything or tell me it's 3rd party delivery so I can decide if I want a hassle. can't be bothered to leave packages at my house and make me go to the fuckimg mall to pick it up.", "score": 2, "created_utc": 1612796824, "company": "amazon"}, {"body": "has this navy blue Apple Watch on sale for $459.98. backhand_index_pointing_right", "score": 0, "created_utc": 1612796582, "company": "amazon"}, {"body": "some of these books on my list are b2g1 free! Can you believe it!! I'm trying to get enough Dr. Seuss books for my students. #clearthelist", "score": 0, "created_utc": 1612796544, "company": "amazon"}, {"body": "Yay Jeff Bezos! Has marriage opened your heart? Hope you continue on this path red_heart", "score": 1, "created_utc": 1612796487, "company": "amazon"}, {"body": "IF YOU DONT HURRY UP AND GIVE ME MY NIRVANA VINLY IM GOING TO FIGHT YOU", "score": 0, "created_utc": 1612796381, "company": "amazon"}, {"body": "getting rid of the Drag and drop feature feels kind of hateful. Also the fact that it was gone forever ago and I'm just now noticing it...too also as well additionally feels hateful.", "score": 0, "created_utc": 1612796278, "company": "amazon"}, {"body": "Everyone is able to leave their homes. Some have bought into the propaganda too much and have made themselves panic-stricken. They should join reality.", "score": 0, "created_utc": 1612796180, "company": "amazon"}, {"body": "I have some questions about my previous employment, who can I contact?", "score": 1, "created_utc": 1612796111, "company": "amazon"}, {"body": "Its almost like they are a non profit org. Cute", "score": 1, "created_utc": 1612796004, "company": "amazon"}, {"body": "can I pay for my shorts shorts with #Bitcoin If not I'll buy the ones no problem", "score": 0, "created_utc": 1612795919, "company": "amazon"}, {"body": "Nevermind the Churchs and other outreach groups in existent. Helping you bring about the technocratic totalitarian state. One meal at a time.", "score": 2, "created_utc": 1612795848, "company": "amazon"}, {"body": "How about allowing your workers to unionize now?", "score": 2, "created_utc": 1612795844, "company": "amazon"}, {"body": "I like when the guy almost drops the fake grocery bag", "score": 0, "created_utc": 1612795840, "company": "amazon"}, {"body": "Thank you for your service I'm sure there's a lot of people out there that appreciate it and you may not know over a dozen of them but there's a lot of them out there", "score": 2, "created_utc": 1612795787, "company": "amazon"}, {"body": "Pay your fucking workers, assholes", "score": 9, "created_utc": 1612795677, "company": "amazon"}, {"body": "is always hiring. It'll be good for them to put their backs into their jobs.", "score": 0, "created_utc": 1612795527, "company": "amazon"}, {"body": "Don't just think big ... do big. #UnionStrong #ItsAboutTime In Alabama, Workers At Amazon Warehouse Are Poised For Union Vote NPR", "score": 0, "created_utc": 1612795331, "company": "amazon"}, {"body": "Everyone should watch out for a monthly charge from shipping club for $13.08. Someone who I do not know entered my cc on their account. All Amazon does is remove it. This is fraud and the person that steals numbers and uses on Amazon should be prosecuted.", "score": 1, "created_utc": 1612795043, "company": "amazon"}, {"body": "how do I get my $$ back for the money spent on prime delivery service that you didn't provide? Or at least compensated in some way, the total is in the hundreds", "score": 1, "created_utc": 1612794832, "company": "amazon"}, {"body": "how do I get my $$ back for the money spent on prime delivery service that you didn't provide? Or at least compensated in some way, the total is in the hundreds", "score": 0, "created_utc": 1612794747, "company": "amazon"}, {"body": "delivery drivers are literally the worst! Do they even get training?!", "score": 1, "created_utc": 1612794706, "company": "amazon"}, {"body": "Do you help the families of your warehouse workers that are in need? Asking for a friend", "score": 0, "created_utc": 1612794633, "company": "amazon"}, {"body": "Consider taking and other feminine hygiene products off the site. Products such as washes, douches, etc can cause a lot of damage and harm the vagina/vulvar area. Not to mention that these companies market off of the insecurities of young girls and women", "score": 0, "created_utc": 1612794621, "company": "amazon"}, {"body": "will y'all start shipping Oz on prime if they legalize nationwide???", "score": 0, "created_utc": 1612794467, "company": "amazon"}, {"body": "Half the products I receive now offer incentives for 5-star reviews. How is this allowed? And why is there not an easy way for me to report this?", "score": 1, "created_utc": 1612794454, "company": "amazon"}, {"body": "real nice do you teach your employees to flip people off or do you just hire people who do this on there own? #keepitclassy I waved the guy across the road and when I passed he flipped me off. #nice", "score": 1, "created_utc": 1612794061, "company": "amazon"}, {"body": "Great, now let your workers unionize. Give your workers safe working conditions and the healthcare they deserve. Jeff Bezos made more during the pandemic than ever before, so don't try to make us believe amazon is a charity. They have billions and they are sprinkling breadcrumbs", "score": 7, "created_utc": 1612794034, "company": "amazon"}, {"body": "loudly_crying_face loudly_crying_face y'all got jokes lol too bad I won't buy it for her grinning_face_with_sweat", "score": 1, "created_utc": 1612793967, "company": "amazon"}, {"body": "GIVE ME MY REFUND", "score": 1, "created_utc": 1612793863, "company": "amazon"}, {"body": "we dont care", "score": 2, "created_utc": 1612793816, "company": "amazon"}, {"body": "How about let your own workers join a union?", "score": 3, "created_utc": 1612793709, "company": "amazon"}, {"body": "what do you think about dreamnotfound", "score": 0, "created_utc": 1612793671, "company": "amazon"}, {"body": "Amazon is a soulless entity that causes more food insecurity than they do remove it through their \"PR Photoshoot\" ads would lead you to believe. Liars.", "score": 2, "created_utc": 1612793603, "company": "amazon"}, {"body": "ismail loves you hello", "score": 0, "created_utc": 1612793424, "company": "amazon"}, {"body": "But... It's it for free?", "score": 1, "created_utc": 1612793273, "company": "amazon"}, {"body": "This is so good face_with_tears_of_joy face_with_tears_of_joy", "score": 0, "created_utc": 1612793124, "company": "amazon"}, {"body": "I got your package yesterday and each of my kids went home with books to read today. I can't thank you enough. They were so excited!", "score": 0, "created_utc": 1612793009, "company": "amazon"}, {"body": "So now, let your workers unionize so they can get decent conditions.", "score": 1, "created_utc": 1612792555, "company": "amazon"}, {"body": "I suck Amazon...greed begets greed", "score": 0, "created_utc": 1612792439, "company": "amazon"}, {"body": "accept Dogecoin you cowards!", "score": 0, "created_utc": 1612792219, "company": "amazon"}, {"body": "Blocking all twitter and Amazon ads until they resume freedom of speech Whales are not real. They're robots funded by the government to watch us", "score": 0, "created_utc": 1612792191, "company": "amazon"}, {"body": "You should try paying your workers an adequate wage. thumbs_up", "score": 14, "created_utc": 1612792157, "company": "amazon"}, {"body": "Time to restrict third party sellers from selling GPU's and CPU's on your platform, just like you did with those hoarding covid supplies. If they don't have a platform to sell their scalped goods, most of them will quit.", "score": 1, "created_utc": 1612792075, "company": "amazon"}, {"body": "and made billions upon billions. Do they need to keep working their workers like wage indentured slaves? backhand_index_pointing_down", "score": 0, "created_utc": 1612791975, "company": "amazon"}, {"body": "We could benefit from your HELP where do I sign up? index_pointing_up", "score": 0, "created_utc": 1612791823, "company": "amazon"}, {"body": "Best Sellers #deals #onlineshopping #ad", "score": 0, "created_utc": 1612791420, "company": "amazon"}, {"body": "I have bought 1000s of items from Amazon , I've never had a wrong item, missing item , truly amazing corporation, and the Amazon App, it's shopping for dummies, it's so easy to use, even I can do it!!!", "score": 1, "created_utc": 1612791349, "company": "amazon"}, {"body": "you suck! We know what you have done! TOLD ON ALL OF YOU! CORRUPT!", "score": 0, "created_utc": 1612791280, "company": "amazon"}, {"body": "Employ me hugging_face", "score": 1, "created_utc": 1612791066, "company": "amazon"}, {"body": "Deliver $35 an hour , no one wants your charity", "score": 0, "created_utc": 1612791023, "company": "amazon"}, {"body": "really??!!! Ur delivery guy can't walk few more steps in front of my unit and just left it in front of the garbage door???? Like wtf is that !!", "score": 1, "created_utc": 1612790985, "company": "amazon"}, {"body": "I placed an order on January 31st and it is meant to arrive on February 12th but has not yet shipped. I really need it by the 12th. I'm struggling to get any sort of meaningful update on the status of my order.", "score": 1, "created_utc": 1612790780, "company": "amazon"}, {"body": "Black Employee Network has established a scholarship program to assist high school seniors who plan to continue their education in college and pursue a computer science or supply chain-related field of study and career. Learn more", "score": 0, "created_utc": 1612790645, "company": "amazon"}, {"body": "LOL I've ever received or saw anything relating to your helping of people in need. How can I get help??", "score": 1, "created_utc": 1612790126, "company": "amazon"}, {"body": "why is this always an issue? There are specific delivery instructions on my orders too There's a side gate, come thru there and leave the groceries in the back on the table", "score": 1, "created_utc": 1612790029, "company": "amazon"}, {"body": "your driver dropped off my order on a bench outside near nowhere my address and left it for crackheads to sell it Amazon have delivery instructions this is unacceptable bad customer service bad business filing a complaint claims", "score": 2, "created_utc": 1612790010, "company": "amazon"}, {"body": "I'm trying to buy a 70\" TV but it's saying that it can't send it to my address", "score": 1, "created_utc": 1612789885, "company": "amazon"}, {"body": "you have several features I find particularly annoying. Reading the notes of a Kindle book first does not mean I finished the book. Also, if I accidentally open my husband's book, that does not mean I added it to my Currently Reading shelf.", "score": 2, "created_utc": 1612789748, "company": "amazon"}, {"body": "purchase of trucks using cleaner, more efficient compressed #natgas is a win for everyone.", "score": 0, "created_utc": 1612789546, "company": "amazon"}, {"body": "why do you promote this to me as an Amazon Choice item if you won't ship it to where I live? You know my address, don't show me products you won't send to me!", "score": 1, "created_utc": 1612789215, "company": "amazon"}, {"body": "Do that here I. The US for the American people. Now. It's greatly needed.", "score": 1, "created_utc": 1612789169, "company": "amazon"}, {"body": "I'm filing a lawsuit against your company, lazy ass drivers rude ass supervisors this isn't my location my shipment is left outside #fckyouamazon", "score": 2, "created_utc": 1612789014, "company": "amazon"}, {"body": "England's answer to the excellent production of #virginriver", "score": 0, "created_utc": 1612788963, "company": "amazon"}, {"body": "Your current archival management is pointless. A 500 order archive limit is useless. I understand why deletion is not an option, but implement an actual order management system for customers with larger histories. Low hanging fruit archive labels, increased limits.", "score": 1, "created_utc": 1612788880, "company": "amazon"}, {"body": "Gift Cards #ad #deals #onlineshopping", "score": 0, "created_utc": 1612788720, "company": "amazon"}, {"body": "Just wrong on SO many levels! weary_face sneezing_face thinking_face", "score": 0, "created_utc": 1612788128, "company": "amazon"}, {"body": "Wants Me To Get A Police Report For A Missing Sheet Set face_with_tears_of_joy", "score": 0, "created_utc": 1612788044, "company": "amazon"}, {"body": "when #doge ?", "score": 0, "created_utc": 1612787916, "company": "amazon"}, {"body": "That's cool thumbs_up", "score": 0, "created_utc": 1612787871, "company": "amazon"}, {"body": "Union for workers' rights", "score": 1, "created_utc": 1612787866, "company": "amazon"}, {"body": "out there trying to reach maximum evil levels.", "score": 0, "created_utc": 1612787863, "company": "amazon"}, {"body": "I won't be buying from you because of your ethics as detailed by #makeamazonpay", "score": 0, "created_utc": 1612787569, "company": "amazon"}, {"body": "Do the same as but Alexa is Bella Hadid. I dare you.", "score": 0, "created_utc": 1612787353, "company": "amazon"}, {"body": "Asking Alexa the price of #Bitcoin in the morning", "score": 0, "created_utc": 1612787106, "company": "amazon"}, {"body": "Alexa Guard Plus security #subscription comes to the US #Amazon #Alexa", "score": 0, "created_utc": 1612786805, "company": "amazon"}, {"body": "You are my hero I really admire you musical_notes two_hearts", "score": 0, "created_utc": 1612786569, "company": "amazon"}, {"body": "... my entire house is powered by you and I am consistently receiving new packages. I have a problem and I've decided to confront it head on!!!!! STOP HAVING EVERYTHING! I need to save man... I need to tired_face tired_face tired_face", "score": 0, "created_utc": 1612786471, "company": "amazon"}, {"body": "my S/O got an invite for the Alexa preview in Switzerland, any chance I could also get one and help you guys out at the same time? Would love to use the app in Switzerland with my Alexa devices cc", "score": 2, "created_utc": 1612786246, "company": "amazon"}, {"body": "Get free $10 when you click on this", "score": 0, "created_utc": 1612786096, "company": "amazon"}, {"body": "Promote your store and get sales guarantee", "score": 0, "created_utc": 1612786030, "company": "amazon"}, {"body": "Get $150 gift card claim here #giftcard #giftcardamazon #freegiftcard #giftcardonamzon #giftcardforamazon #FreeCodeFridayContest #PulteHelpsPeople #VoteForHer", "score": 0, "created_utc": 1612786001, "company": "amazon"}, {"body": "Promote your store and get sales guarantee", "score": 0, "created_utc": 1612785998, "company": "amazon"}, {"body": "Pretty crappy having prime then 4 days late on delivery to be told we can send money back to card . Like thumbs_up and there's nothing we can do for inconvenience thanks agent Joaquin", "score": 1, "created_utc": 1612785899, "company": "amazon"}, {"body": "selling Baphomet who #Freemasons it's claimed worship. What wont Amazon sell???", "score": 1, "created_utc": 1612785726, "company": "amazon"}, {"body": "I have been trying to get an error resolved since Thursday that hasn't allowed me to select my own address at checkout. I have talked to customer services 3 times, and every time they don't see to know what they're doing. Please help.", "score": 1, "created_utc": 1612785709, "company": "amazon"}, {"body": "literally just sent my boyfriend an empty package. Nothing in the bubble mailer, not even a packing slip", "score": 1, "created_utc": 1612785319, "company": "amazon"}, {"body": "Just received a 'Your Prime Membership' email promoting the music of Morgan Wallen, a performer who used a racial slur last week. Please don't promote this music, even if it is popular on your service.", "score": 1, "created_utc": 1612785193, "company": "amazon"}, {"body": "What the hell is this?! Your delivery personnel had the audacity to leave an EMPTY BOX at my doorstep? I know y'all are not that pressed for $200.", "score": 1, "created_utc": 1612785103, "company": "amazon"}, {"body": "stole $62 million from their delivery drivers and being punished by having to ~gasp~ pay back $62 million. Boy that'll sure teach them that there's no downside to doing #wagetheft", "score": 0, "created_utc": 1612785012, "company": "amazon"}, {"body": "the \"King of Quarantine\", had their revenue increase 38% overall in 2020. That's not all that happened this week, they had more announcements up their sleeve. #amazon", "score": 0, "created_utc": 1612784405, "company": "amazon"}, {"body": "why the fuck can't I sign up for Amazon prime!??? I need getting an error for over a week !!!!", "score": 1, "created_utc": 1612784266, "company": "amazon"}, {"body": "thanks for ensuring that your delivery drivers wear masks. Apparently and can't manage the same.", "score": 0, "created_utc": 1612783943, "company": "amazon"}, {"body": "Hi Amazon thanks for hiring me. I started 3 weeks ago and I love it red_heart . You guys are the best and make me feel included too smiling_face", "score": 1, "created_utc": 1612783285, "company": "amazon"}, {"body": "Discount on the new iphone 12 pro max 256 GB space grey!!!!!! Be fast", "score": 0, "created_utc": 1612783192, "company": "amazon"}, {"body": "Discount on the new iphone 12 pro max 256 GB space grey!!!!!! Be fast", "score": 0, "created_utc": 1612783180, "company": "amazon"}, {"body": "Discount on the new iphone 12 pro max 256 GB space grey!!!!!! Be fast", "score": 0, "created_utc": 1612783110, "company": "amazon"}, {"body": "Discount on the new iphone 12 pro max 256 GB space grey!!!!!! Be fast", "score": 0, "created_utc": 1612783101, "company": "amazon"}, {"body": "for MVB (Most Valuable Body) #AlexasNewBody #SBLV", "score": 0, "created_utc": 1612783015, "company": "amazon"}, {"body": "Discouny on the new iphone 12 pro max 256GB space grey!!!!", "score": 0, "created_utc": 1612783001, "company": "amazon"}, {"body": "I wish you cared more about your drivers. And you hired better supervisors for them. My son still waiting on his bonus he was told he was getting. Bout to piss off his mom. Lol nice video tho lol", "score": 0, "created_utc": 1612782781, "company": "amazon"}, {"body": "Jeff, as we were just saying we've bend 0 alone but we've bend so easily together ....LO", "score": 0, "created_utc": 1612782683, "company": "amazon"}, {"body": "when are you gonna start accepting #dogecoin ?", "score": 0, "created_utc": 1612782598, "company": "amazon"}, {"body": "and Michael B. Jordan's production banner, Outlier Society, have magnified their partnership, signing the actor and his company into a first-look film deal and an overall television deal (via newsletter)", "score": 0, "created_utc": 1612782516, "company": "amazon"}, {"body": "Complete disaster ordering anything from UK for delivery in Europe. Delivery times exceeded. Items from China get here quicker. #BrexitShambles", "score": 1, "created_utc": 1612782312, "company": "amazon"}, {"body": "didn't deliver my items yesterday. I grew skeptical when the update link disappeared in the app. I'm hoping they show up today or tomorrow.", "score": 1, "created_utc": 1612782020, "company": "amazon"}, {"body": "do you accept #dogecoin ?", "score": 1, "created_utc": 1612781904, "company": "amazon"}, {"body": "has been playing about getting me my refund. They better stop acting like I won't call Jeff right now", "score": 1, "created_utc": 1612781839, "company": "amazon"}, {"body": "Dont order nothing by YOURLITEAMZ they take your money then dont deliver amazon and yourteamamz should be sued for false adverising. Yourteamamz sent me a email there werehouses were closed due to covid but had shipping date of feb 3 they never contacted or called me", "score": 1, "created_utc": 1612781764, "company": "amazon"}, {"body": "PLEASE PLEASE PLEASE GO BACK TO USING USPS FOR DELIVERY. YOUR DELIVERY SERVICE IS TERRIBLE. OUT FOR DELIVERY, NOT BEING DELIVERED TODAY. OUT FOR DELIVERY AGAIN. WITH USPS ETC YOU KNEW WHEN IT WAS GOING TO BE DELIVERED.", "score": 1, "created_utc": 1612781578, "company": "amazon"}, {"body": "totally disgusted, 2 last items I had delivered were not wrapped, the whole world can see what Iam buying, not happy", "score": 1, "created_utc": 1612781271, "company": "amazon"}, {"body": "you are shameful.", "score": 1, "created_utc": 1612781168, "company": "amazon"}, {"body": "\"has a long &amp; well-documented history of abusing virtually every category of human it employs, from office workers to warehouse workers to customer service agents.\" (most recently, stole tips from its delivery drivers)", "score": 0, "created_utc": 1612780605, "company": "amazon"}, {"body": "Why wont you offer standard delivery?! When I try to buy I get 2 options, signup to prime or 4.99 next day. Why cant I have standard delivery?? The option IS NOT there! Pls dont try and say it's my error! Fix this!", "score": 1, "created_utc": 1612780502, "company": "amazon"}, {"body": "why even bother with the delivery instructions if your driver's aren't going to follow them? Not only are the instructions clear, but with the snow it is very easy to tell which door gets used, &amp; your driver still walked through untouched snow to get to the wrong door.", "score": 1, "created_utc": 1612780116, "company": "amazon"}, {"body": "needs to add a 'share cart' function", "score": 1, "created_utc": 1612779976, "company": "amazon"}, {"body": "E-V-G-A GeForce RTX 3090 FTW3 Ultra Gaming Graphics Card, 24GB GDDR6X, VR Ready, PCIe 4.0, iCX3 Technology, ARGB LED, Metal Backplate, 1 x HDMI 2.1, 3 x DisplayPort 1.4a w/ Cyberpunk 2077 Computers &amp; Accessories", "score": 0, "created_utc": 1612779887, "company": "amazon"}, {"body": "can I return a phone case I purchased, even though I don't have the box for the package itself (not shipping box)?", "score": 0, "created_utc": 1612779643, "company": "amazon"}, {"body": "Alexa-he's about to bring out too many Cougars-jk flushed_face winking_face_with_tongue victory_hand_medium_skin_tone red_heart", "score": 0, "created_utc": 1612779579, "company": "amazon"}, {"body": "Consumer Alert. We received a call from alleged Amazon that we have an unauthorized purchase of $400. The number to call was 216-539-9403. We recognized a scam. We called and the agent answered as Amazon Support. He tried to get me to log on to a remote site.", "score": 3, "created_utc": 1612779454, "company": "amazon"}, {"body": "Latin Music Album Best Sellers Charts; #63 #LaundryService #76 #SaleElSol red_heart", "score": 0, "created_utc": 1612779434, "company": "amazon"}, {"body": "Read my new product review on Starbucks Organic Winter Blend, 40 ounce", "score": 0, "created_utc": 1612779345, "company": "amazon"}, {"body": "looking forward to meeting the board room in person", "score": 0, "created_utc": 1612779162, "company": "amazon"}, {"body": "So why was my mother wrongfully fired because she almost died in a car accident, but your crappy employees said she quit and now she can't get unemployment OR disability? Fucking do something.", "score": 1, "created_utc": 1612779144, "company": "amazon"}, {"body": "is requesting feedback on deliveries and sending mapped updates on where the drivers are... timelines and all", "score": 0, "created_utc": 1612778955, "company": "amazon"}, {"body": "#BTC is inevitable", "score": 0, "created_utc": 1612778849, "company": "amazon"}, {"body": "all set to commercialise one Biometric Payments Payy by hand waving face_with_open_mouth face_with_open_mouth #tech #technology", "score": 0, "created_utc": 1612778627, "company": "amazon"}, {"body": "WTH.. I tried to buy a 10 dollar gift card from Amazon and send it to someone in the UK and you close my affiliate account!! Than I created another one and you close that instantly because of the first account!!", "score": 0, "created_utc": 1612778347, "company": "amazon"}, {"body": "- Biden plans to increase corporate taxes to 28%. Trying to kill corporations, now small business is dead.", "score": 0, "created_utc": 1612778332, "company": "amazon"}, {"body": "brings the pharmacy to you! Save time with upfront pricing, easy check-out, and status updates along the way. Now you can have your medication delivered, just like everything else. Find out more at", "score": 0, "created_utc": 1612778212, "company": "amazon"}, {"body": "scam 101 face_with_tears_of_joy face_with_tears_of_joy urm no thanks Kanianen face_with_tears_of_joy face_with_tears_of_joy #scam #amazonscam #emailscammer #pissoffmate #scammer #beware", "score": 1, "created_utc": 1612778199, "company": "amazon"}, {"body": "i Oder a package and it's not arrived. Can you please tell how I obtain refund?", "score": 1, "created_utc": 1612778153, "company": "amazon"}, {"body": "How many BRAND's do I have to mute to not see blaks on my timeline.", "score": 0, "created_utc": 1612777849, "company": "amazon"}, {"body": "idea of a parcel handed to the resident. It was left on my doorway (which goes directly on to the street) for a good 3 hours whilst I was still at school... with books in. Could've rained/snowed and ruined them... poor.", "score": 1, "created_utc": 1612777744, "company": "amazon"}, {"body": "coders suck!! Next means = back in time. Previous means = go forward in time. P.S. Do not ever use the app chat feature. Bc most are ESL, and if they cannot liasia aurorally the they get stuck on the written chat - which they default to Save-My-Ass' &amp; u will B screwd", "score": 0, "created_utc": 1612777687, "company": "amazon"}, {"body": "#Rajesh Kumar Signh I won rs 10000 why are you not giving my prize", "score": 0, "created_utc": 1612777366, "company": "amazon"}, {"body": "HR reps are under qualified. They DONT RESPOND!! I'm not the only one. I've talked to at least a dozen people and they all laugh that HR doesn't respond. You're a multi BILLION$company. I'm a 6-figure company and I'm held to a higher standard and do more for my employees", "score": 0, "created_utc": 1612777127, "company": "amazon"}, {"body": "stop send my things with USPS", "score": 0, "created_utc": 1612777086, "company": "amazon"}, {"body": "You are incompetent. Stating 2parcels delivered at 15 48 (they have not). I take 2 hours away from VITAL CV19 work (on chat) to ascertain where these 2 parcels are. Apparently it happens regularly? You scan to say delivered (they are not) and we wait 48-72 hours extra.", "score": 1, "created_utc": 1612777078, "company": "amazon"}, {"body": "you promised one amount, offered another amount and told me to take up pay issues day 1. After waiting almost TWO HOURS outside the facility for my badge to enter, was told I don't know, talk to HR. HR IS A JOKE!", "score": 0, "created_utc": 1612776948, "company": "amazon"}, {"body": "I emailed HR back in DECEMBER and your office employees are INCOMPETENT!!! Give us a resource other than a computer to talk to and lazy HR reps. #dobetter", "score": 0, "created_utc": 1612776731, "company": "amazon"}, {"body": "At least he remained dressed for most of the commercial. I mean he DID remove his shirt for a second. I think this would be different if the female was in a bikini for the entire commercial. #doublestandard", "score": 0, "created_utc": 1612776627, "company": "amazon"}, {"body": "I have been a voice advocating for the jobs we need by this company. I love this company and job opportunities. You have people traveling 2 hours for my same position. TAKE CARE OF YOUR PEOPLE! I don't care about my job, I have a cushion, others don't!", "score": 0, "created_utc": 1612776593, "company": "amazon"}, {"body": "Happy weekend Still Buying and Paying Fast. wine_glass wine_glass backhand_index_pointing_right Bulks &amp; units PayPal Funds backhand_index_pointing_right Bulks Payoneer Funds needed backhand_index_pointing_right Bulks &amp; units BTC rate dependant on the qty.. Fast payment is sure!! WhatsApp +2349034012513", "score": 0, "created_utc": 1612776494, "company": "amazon"}, {"body": "state of emergency at 7pm on SUNDAY NIGHT you closed for day workers coming in at 6am MONDAY by 11pm but made your 3rd shift dock workers work until the shift ended (I left at 5 15 and want nearly the last) and not just dock, I saw people picking and managers were there!", "score": 0, "created_utc": 1612776391, "company": "amazon"}, {"body": "listen and push!! beaming_face_with_smiling_eyes", "score": 0, "created_utc": 1612776300, "company": "amazon"}, {"body": "Tell that to DCH1, you assholes.", "score": 0, "created_utc": 1612776153, "company": "amazon"}, {"body": "HR is a joke, still haven't paid ANY of us our differential pay in 2 months, you put our safety at risk during a once in a decade BLIZZARD, and still HR is a joke after emails. I LOVE my job, I love the people I work with. This is a disgrace. I won't back down.", "score": 0, "created_utc": 1612776145, "company": "amazon"}, {"body": "should make a form of payment!! pleading_face", "score": 1, "created_utc": 1612776111, "company": "amazon"}, {"body": "is so full of shit. To be clear customer service when a customer is looking at an account with 2 pending charges sent through for 1 transaction don't lie and say you charged me once. You sent 2 authorizations, you overcharged me period whether one will fall off or not", "score": 1, "created_utc": 1612776101, "company": "amazon"}, {"body": "Hey amazon! Don't hinder labour unions! Otherwise I shop elsewhere.", "score": 0, "created_utc": 1612776037, "company": "amazon"}, {"body": "- absolute disastrous customer service. Trying to download an Amazon Prime VAT invoice - 5 people, incorrect links, no answers &amp; over an hour online!! #expectbetterservice", "score": 1, "created_utc": 1612775700, "company": "amazon"}, {"body": "I believe this is more on brand.", "score": 0, "created_utc": 1612775603, "company": "amazon"}, {"body": "#Tesla just jumped on the wagon. Are you coming or being left behind?", "score": 0, "created_utc": 1612775356, "company": "amazon"}, {"body": "dear amazon.. send the damn package lol from the first I see it's at the shipping line and there it waits lol for what idk", "score": 0, "created_utc": 1612775195, "company": "amazon"}, {"body": "Thank you for replacing the open in mailing jar of Mackay's strawberry preserve with champagne. It is SO good probably order again", "score": 0, "created_utc": 1612775148, "company": "amazon"}, {"body": "nailed it again. A clever way of appealing to a distinct demo", "score": 0, "created_utc": 1612774827, "company": "amazon"}, {"body": "is HIRING Veterans and Military members! Learn more about opportunities and apply at or text MILITARY to 77088 #UCFCareerServices #AmazonMilitary #Amazon #Hiring", "score": 0, "created_utc": 1612774802, "company": "amazon"}, {"body": "Pwhat is this Amazon? I know you are too good for customers but please fix this types of bugs bug", "score": 2, "created_utc": 1612774701, "company": "amazon"}, {"body": "is is completely accurate, yet was disgustingly loved..", "score": 0, "created_utc": 1612774365, "company": "amazon"}, {"body": "having a max of 4 years for student membership is absolute BS. What about graduate students? Why wouldn't you reward students with additional Prime for people who pursue higher education? #whack", "score": 1, "created_utc": 1612774280, "company": "amazon"}, {"body": "when #BTC ?", "score": 0, "created_utc": 1612773701, "company": "amazon"}, {"body": "Not sure why there isn't a Seller Support account here, but that seems to get to the core incompetency and failure of corporate culture. I need help with an issue that has, so far, been ignored or kicked back 3 times by Seller (e-mail) Support", "score": 1, "created_utc": 1612773554, "company": "amazon"}, {"body": "I feel you girl loudly_crying_face woozy_face", "score": 0, "created_utc": 1612773396, "company": "amazon"}, {"body": "Pathetic service from Amazon. Ordered twice the product from first time they cancelled the order without any intimation, secondly for the repeat order they are asking to cancel the order as they have lost the product in transit", "score": 2, "created_utc": 1612773222, "company": "amazon"}, {"body": "your new app icon is very very ugly", "score": 0, "created_utc": 1612773008, "company": "amazon"}, {"body": "Amazon \"Prime Membership privileges\" are conditioned on their being able to text message customers on their cell phones, over their objections and refusing to accept other identification. This is a violation of privacy rights.", "score": 1, "created_utc": 1612772825, "company": "amazon"}, {"body": "The best commercial of the night face_with_tears_of_joy", "score": 0, "created_utc": 1612772653, "company": "amazon"}, {"body": "this face mask is incredible! Limited-time deal 4WDKING Rechargeable Electrical Air Purifying,...", "score": 0, "created_utc": 1612772268, "company": "amazon"}, {"body": "where's my package? package loudly_crying_face", "score": 1, "created_utc": 1612772254, "company": "amazon"}, {"body": "Hello sir, Need an Amazon Affiliate Autopilot Marketing Website Without an API Key? (With top-rated products) Click", "score": 0, "created_utc": 1612771733, "company": "amazon"}, {"body": "So hilarious", "score": 0, "created_utc": 1612771572, "company": "amazon"}, {"body": "KG is not a baseball player. Come on...", "score": 0, "created_utc": 1612771498, "company": "amazon"}, {"body": "Should buy out take viewing cinema to a new sci fi dimension experience #thetimeisnow Let's Go", "score": 1, "created_utc": 1612771244, "company": "amazon"}, {"body": "we need a Angela Basset Alexa or som", "score": 0, "created_utc": 1612771146, "company": "amazon"}, {"body": "you guys considering me?", "score": 1, "created_utc": 1612770963, "company": "amazon"}, {"body": "Pastor Greg Locke is an insurrectionist that you allow to sell books through your platform?", "score": 0, "created_utc": 1612770910, "company": "amazon"}, {"body": "I ordered for earbuds from and I received an empty box. When contacted ur support they say they delivered but I have not received it. Please help if this happens u need to look into it. please help me in this by giving the product or my money.", "score": 3, "created_utc": 1612770837, "company": "amazon"}, {"body": "man y'all tripping. I've paid for Amazon prime three fucking times this month. Today is just the 8th dam day of the month. Y'all gotta do better man. I had to depart from that scam.", "score": 1, "created_utc": 1612770834, "company": "amazon"}, {"body": "when is family man season 2 releasing pls reveal we are eagerly waiting for it #Familyman2 #familymanseason2", "score": 1, "created_utc": 1612770549, "company": "amazon"}, {"body": "&amp; how are you going to tease me with a Super Bowl commercial like that.. because I can't have actually be my Alexa voice? I was ready to upgrade my Alexa grinning_face_with_sweat", "score": 0, "created_utc": 1612770514, "company": "amazon"}, {"body": "Start A Career Today - Amazon From Home", "score": 0, "created_utc": 1612770470, "company": "amazon"}, {"body": "Start A Career Today - Amazon From Home Jobs", "score": 0, "created_utc": 1612770443, "company": "amazon"}, {"body": "Start A Career Today - Amazon From Home", "score": 0, "created_utc": 1612770407, "company": "amazon"}, {"body": "how shit is your customer service!!!", "score": 1, "created_utc": 1612770404, "company": "amazon"}, {"body": "Start A Career Today - Amazon From Home Jobs if you interest please go to this", "score": 0, "created_utc": 1612770349, "company": "amazon"}, {"body": "is hiring military veterans, activity duty, and spouses for several of their departments! memo For more information or to apply, visit any of the links provided on the post! #uiwcareersvcs #military #veterans #amazon #work #hiring #job #jobseeking #militaryspouse", "score": 0, "created_utc": 1612769970, "company": "amazon"}, {"body": "Kinda funny since they attempted delivery at 1 02pm and it's only 10 35am. So cool you can see into the future!", "score": 1, "created_utc": 1612769932, "company": "amazon"}, {"body": "is going to be really unhappy after they spend a ton of money opening a delivery center in Pittsburgh only to find half their fleet trapped in sinkholes on like day three", "score": 0, "created_utc": 1612769866, "company": "amazon"}, {"body": "hey I have a packet delivered today which is not for me .. what do I do with it ?", "score": 0, "created_utc": 1612769649, "company": "amazon"}, {"body": "I'll have 10 of those", "score": 0, "created_utc": 1612769555, "company": "amazon"}, {"body": "What happened to 2 day shipping?? Now it's 5 days?? Why bother paying for Prime shipping?", "score": 1, "created_utc": 1612768876, "company": "amazon"}, {"body": "Michael B. Jordan kills this commercial and the young lady is phenomenal as well!", "score": 0, "created_utc": 1612768538, "company": "amazon"}, {"body": "please give me my watch I have won it", "score": 1, "created_utc": 1612768323, "company": "amazon"}, {"body": "Disputing $3k of purchases I made with Amazon in January cuz my account was closed for erroneous reasons. I see why CEO stepped down as your entire organization is corrupt af. From Logistics, to Prime Drivers, to UPS Stores and Drivers! All have fw my orders &amp; shipments.", "score": 6, "created_utc": 1612768199, "company": "amazon"}, {"body": "When will the model be available? I am interesting in purchasing.", "score": 0, "created_utc": 1612768172, "company": "amazon"}, {"body": "I asked my daughter to look up race car cookie cutters, and she found penises. Please do better at vetting what you advertise for seemingly innocent searches. I understand you wanting to carry novelty items but they shouldn't be mixed in with kids items.", "score": 0, "created_utc": 1612768117, "company": "amazon"}, {"body": "is the worlds largest slot machine. And it's rigged so that the house ALWAYS wins.", "score": 0, "created_utc": 1612767736, "company": "amazon"}, {"body": "coming to Queensbridge in LIC Queens. Will they be unionized? See Houses #Amazon", "score": 0, "created_utc": 1612767692, "company": "amazon"}, {"body": "WHY TF AM I PAYING $13 A MONTH FOR ADS?", "score": 2, "created_utc": 1612766716, "company": "amazon"}, {"body": "Where is the option to speak to a real human about an issue with my account?...I can't find anywhere to connect to a person to resolve an issue", "score": 1, "created_utc": 1612766617, "company": "amazon"}, {"body": "did you really need this big plastic packet for such a small bottle or you don't care", "score": 1, "created_utc": 1612766496, "company": "amazon"}, {"body": "rolling_on_the_floor_laughing has let himself go there rolling_on_the_floor_laughing", "score": 0, "created_utc": 1612766361, "company": "amazon"}, {"body": "So, it's a new day and this commercial is still cracking me up. grinning_face Still love it !!! smiling_face_with_heart-eyes", "score": 0, "created_utc": 1612766333, "company": "amazon"}, {"body": "to off-take 130 MW from #HollandseKustNoord #wind farm", "score": 0, "created_utc": 1612766271, "company": "amazon"}, {"body": "ohhhh how you have my heart and money, I ordered these last night and im bearly heading home from work.... your telling me it's gonna be there before I get home????? 10/10 reccomend", "score": 0, "created_utc": 1612766211, "company": "amazon"}, {"body": "Automated machine replies from amazon when we have requested claim in the case of customer sent us diff item. We didnt open the package before delivery boy due to covid conditions. How come you say this.We need our product back plz", "score": 1, "created_utc": 1612766102, "company": "amazon"}, {"body": "nice delivery", "score": 1, "created_utc": 1612765798, "company": "amazon"}, {"body": "i ordered my snowblower on the first , why is it scheduled for the tenth AFTER the snow storm", "score": 1, "created_utc": 1612765565, "company": "amazon"}, {"body": "has almost no stores. owns almost no cars. creates no content. has no inventory. has no real estate. is not a TV channel. has no physical coins. Thanks to democratization of technology, the game has been changed.", "score": 4, "created_utc": 1612765517, "company": "amazon"}, {"body": "I bought a gift pack of pringles from amazon India..when I got it, first of all ,it was not in the gift box packaging as shown in the image. N then worst of all every chip in all 6 boxes were broken! N now they've refused any refund or replacement!!", "score": 2, "created_utc": 1612765394, "company": "amazon"}, {"body": "how do i resolve this, deliveries keep being left outside my door without a knock or anything, It could easily be stolen", "score": 1, "created_utc": 1612765085, "company": "amazon"}, {"body": "how I pay for next day shipping and then you gon tell me my shit don't get here til Thursday man_facepalming_medium-dark_skin_tone", "score": 1, "created_utc": 1612765048, "company": "amazon"}, {"body": "balls in your court", "score": 0, "created_utc": 1612764828, "company": "amazon"}, {"body": "headphone Amazon Reviewers/Tester/freebie headphone ALL PRODUCTS ARE US,UK,IT,JP,ES", "score": 0, "created_utc": 1612764783, "company": "amazon"}, {"body": "worst customer service ever!! They put my account on hold for a week now for no reason and there is no way to reach them. So annoying!", "score": 2, "created_utc": 1612764657, "company": "amazon"}, {"body": "you guys are waste absolutely worst customer service team no help nothing just standard script and sorry i understand your problem this is what you team is taught to say. Worst ecom and worst customer service shit amazon", "score": 3, "created_utc": 1612764627, "company": "amazon"}, {"body": "Thank you Amazon for reminding us that women have NO CLUE what they want. It's okay to objectify and overly sexualize men but women can't be objectified unless they objectify themselves then it's impowering...", "score": 0, "created_utc": 1612764600, "company": "amazon"}, {"body": "when are u going to start taking #bitcoin Tell them", "score": 0, "created_utc": 1612764591, "company": "amazon"}, {"body": "objection to its workers unionizing tells you all you need to know about them...it's a shitty, shitty company.", "score": 0, "created_utc": 1612764490, "company": "amazon"}, {"body": "Do not buy from seller YourLiteamz from amazon they continue to take orders and payment when their werehouses was shitdown ordered a chair back on january 20 still havent received shit they took my payment though i will be filing a lawsuit becarefull on the sellers", "score": 0, "created_utc": 1612764473, "company": "amazon"}, {"body": "I'll take one grinning_face", "score": 0, "created_utc": 1612764298, "company": "amazon"}, {"body": "how am I going to do rush shipping overnight for a new nose hoop that I need right now, get it have it break, have to return the product and then wait another full 24 hours up until 10 pm to get my item why was I not offered same day shipping and delivery? I'm so annoyed.", "score": 0, "created_utc": 1612764107, "company": "amazon"}, {"body": "I ordered for wecool Bluetooth speakers. Today I rec'd order but in box of wecool ADOFF speaker found. This speaker also looks used one. Provide me product for which I I already requested for return of the product. Replace with correct one asap.", "score": 3, "created_utc": 1612763982, "company": "amazon"}, {"body": "WOW WHAT A WAY TO TREAT YOUR CUSTOMERS! *SLOWCLAPS* ITS SO SHAMEFUL TO SEE SUCH A BIG COMPANY BEING PETTY ! #shamelesamazon #disgustingamazon #amazonsteals", "score": 0, "created_utc": 1612763671, "company": "amazon"}, {"body": "are you next? #BTC #ETH #ada", "score": 0, "created_utc": 1612763662, "company": "amazon"}, {"body": "the amount is not there in my account! I can provide a bank statement as a proof that it's not there can you provide a proof of transfer apart from a self generated RRN number which has no holding with the bank! #amazonsucks #amazonisshameless #amazonsteals", "score": 0, "created_utc": 1612763557, "company": "amazon"}, {"body": "where my money at bitch Fuck you", "score": 1, "created_utc": 1612763333, "company": "amazon"}, {"body": "why must the customer be harrassed and made to jump through hoops to rightfully get their money back!#shameful #disgusted", "score": 1, "created_utc": 1612763185, "company": "amazon"}, {"body": "A huge thank you to Rob at Qube solutions UK for putting together a fantastic video for the second epsiode of the paramedic Chris series (a helping hand) Available from Amazon.", "score": 0, "created_utc": 1612763173, "company": "amazon"}, {"body": "and the bank asks me to get in touch with you! I am honestly disgusted by this approach and your customer care has been nothing but abysmal! Care to address!?", "score": 1, "created_utc": 1612762996, "company": "amazon"}, {"body": "Really bizarre commercial. Why i don't buy from Amazon..", "score": 0, "created_utc": 1612762808, "company": "amazon"}, {"body": "is this arrangement of the song on any music streaming service?", "score": 1, "created_utc": 1612762518, "company": "amazon"}, {"body": "\"megacycle shift innovation\" \"collapses shorter shifts into one 10-hour shift that begins around 1 am and ends around lunchtime.\" \"increase efficiency &amp; speed up delivery speed for its customers at the cost of its workers' health and safety.\"", "score": 1, "created_utc": 1612762354, "company": "amazon"}, {"body": "if recipients are in, perhaps you can consider letting them open the box and your delivery man take back the box for recycling. With Amazon being my primary shopping platform, we are continually going to the recycling depot. (Post covid)", "score": 0, "created_utc": 1612762346, "company": "amazon"}, {"body": "Delivery guy is asking me to pay for Riksha chargers! Shall I pay him? I already paid for item", "score": 3, "created_utc": 1612762253, "company": "amazon"}, {"body": "is next fools LFG", "score": 0, "created_utc": 1612762221, "company": "amazon"}, {"body": "My girlfriend sent me a gift with amazon India and the order was never delivered. It's been a month your staff is not processing the refunds. Could you help us with that?", "score": 0, "created_utc": 1612761652, "company": "amazon"}, {"body": "Where do I pre-order the Michael B. Jordan Alexa? #SuperBowl", "score": 0, "created_utc": 1612761563, "company": "amazon"}, {"body": "Your keyboard search is not great. We need to be able to filter on a) layout b) numpad/no-numpad c) wired/wireless d) amazon choice e) key mechanism. Just returning some keyboard after failure. Best to just vouch for a few (Amzon choice) and I will buy them.", "score": 2, "created_utc": 1612761316, "company": "amazon"}, {"body": "I sure wish you can tell me why yall drivers keep driving in my grass and running over my yard decor", "score": 0, "created_utc": 1612761296, "company": "amazon"}, {"body": "sir my shipment is not yet delivered but it's showing delivered. It's really bad experience.", "score": 1, "created_utc": 1612761084, "company": "amazon"}, {"body": "WHY Bitcoin Will Succeed And Make You Rich", "score": 0, "created_utc": 1612760842, "company": "amazon"}, {"body": "What kind of cheating is this ??? Ordered a dinner table set on 16 Jan 2021 and your app says it got already delivered on 30 Oct 2020 And I don't even have idea where is my dinning table set Order tracking also says delivered", "score": 2, "created_utc": 1612760815, "company": "amazon"}, {"body": "I was expecting an alexa robot girl, what the fuck", "score": 0, "created_utc": 1612760329, "company": "amazon"}, {"body": "how can you assume that i know this language!? I am finding it very hard to revert to English!", "score": 1, "created_utc": 1612760320, "company": "amazon"}, {"body": "The unstoppable rise of the internet giant - #DanielePalumbo", "score": 0, "created_utc": 1612760102, "company": "amazon"}, {"body": "I've been passed around to 6 different costumer service agents about a years worth of late or missing deliveries. I'm about to post these ridiculous chat logs from your reps; your costumer service is embarrassing.", "score": 1, "created_utc": 1612759824, "company": "amazon"}, {"body": "what does 1 day shipping mean to you? I needed these Saturday. They should have been here by Thursday. Said they were to be here Sunday.... not here. Thanks for nothing. I don't even need them now since I had to go to and buy some straps.", "score": 1, "created_utc": 1612759701, "company": "amazon"}, {"body": "Just received my books and they were a total surprise because I haven't been on in several days. Thank you so very much! This will help them greatly!", "score": 1, "created_utc": 1612759507, "company": "amazon"}, {"body": "Told very early", "score": 0, "created_utc": 1612759314, "company": "amazon"}, {"body": "Amazon close my account without any resson my money block amazon pay balance Amazon not provide any help or information pls help me", "score": 2, "created_utc": 1612759100, "company": "amazon"}, {"body": "this is my Amazon account -8931049066 nd email attech in this I added some money in this account I order aashirvaad aata two md nd tea one pack prepaid order some wait Amazon cancle my order money money block amazon", "score": 1, "created_utc": 1612759053, "company": "amazon"}, {"body": "I've been charged amazon prime without permission please contact me", "score": 1, "created_utc": 1612758788, "company": "amazon"}, {"body": "you make me call help, then tell me just make a new acct, after how many years!? all my pvd lost, all my order history. WHY cause I changed my cell number and haven't ordered recent enough!!?? #amazon #failure #customerexperience", "score": 1, "created_utc": 1612757916, "company": "amazon"}, {"body": "i've sent 2 messages through my account about this no response. Was dispatched and set for delivery on 22nd Jan but had nothing. Ordered in November. Please can someone let me know the situation.", "score": 1, "created_utc": 1612757409, "company": "amazon"}, {"body": "Maybe it is time for Amazon in the Netherlands to deliver the orders not by #DHL but by themselves! #disappointed", "score": 0, "created_utc": 1612757395, "company": "amazon"}, {"body": "yeah, looks so good, that I want one of him", "score": 0, "created_utc": 1612757337, "company": "amazon"}, {"body": "can you please fix Alexa to know that when I ask about the Bucs, I ain't asking about a basketball team?", "score": 1, "created_utc": 1612756955, "company": "amazon"}, {"body": "your customer service is beyond lacking... i've ordered the same item twice and just today was offered a credit as if it's a favor. the items are not here and not acceptable.", "score": 1, "created_utc": 1612756932, "company": "amazon"}, {"body": "This is really stupid and somebody's going to figure out how racist this really is that some point", "score": 0, "created_utc": 1612756888, "company": "amazon"}, {"body": "Drop Shipping Policy  What you need to know", "score": 0, "created_utc": 1612756111, "company": "amazon"}, {"body": "I told to Self destruct the other day but She did not listen to me! Lol! I feel that we should master the art of REAL intelligence in the REAL world with REAL actual humans before delving into the UNREAL world of a.i. Same 4 $iri and", "score": 0, "created_utc": 1612756073, "company": "amazon"}, {"body": "one of the largest corporations in the world that didn't pay any income taxes in the United_States in the last few years, calls on Congress to raise the federal minimum wage to $15 per hour.", "score": 2, "created_utc": 1612755970, "company": "amazon"}, {"body": "$$$$$$- ARE ALL THESE ARSEHOLES INTERESTED IN! Your health is meaningless!", "score": 0, "created_utc": 1612755822, "company": "amazon"}, {"body": "calls on the U.S. Congress to raise the federal minimum wage to $15 per hour", "score": 2, "created_utc": 1612755770, "company": "amazon"}, {"body": "Does Prime delivery really have a policy that the delivery drivers cannot pull into a driveway? I witnessed a near accident as a result of a Van blocking one lane on a high speed thoroughfare. It's called \"obstructing the flow of traffic\" and is punishable", "score": 1, "created_utc": 1612755724, "company": "amazon"}, {"body": "Alexa, touch your nose!", "score": 0, "created_utc": 1612755219, "company": "amazon"}, {"body": "Please Check out my Gig on Fiverr I will write professional amazon eBay listing optimization SEO product description keyword research and also product listing on Shopify Etsy Walmart Magento etc #Amazonlistings #ebay #shopify #SEO #optimization #Amazon", "score": 0, "created_utc": 1612754679, "company": "amazon"}, {"body": "Please Check out my Gig on Fiverr I will write professional amazon eBay listing optimization SEO product description keyword research and also product listing on Shopify Etsy Walmart Magento etc #Amazonlistings #ebay #shopify #SEO #optimization #Amazon", "score": 0, "created_utc": 1612754657, "company": "amazon"}, {"body": "you guys have ruined my brothers anniv for me... Your supervisor hung up on me... Jagdish was the name... And your customer service not helping him.. i am literally begging you guys to pick up my order from somewhere because you have changed its delivery date", "score": 2, "created_utc": 1612754473, "company": "amazon"}, {"body": "Amazon making money off fraudulent sellers take orders then dont deliver then they blame covid nobody wants to work over a bullshit covid just live off stimulus money", "score": 0, "created_utc": 1612753982, "company": "amazon"}, {"body": "order id # 408-9685118-2829949..this order cancelled but i have not recieved refund", "score": 1, "created_utc": 1612753838, "company": "amazon"}, {"body": "bring back Parler", "score": 0, "created_utc": 1612753331, "company": "amazon"}, {"body": "Received a hoax - computer dialed call saying we have been charged 395 for an Amazon order - Make sure you just hang-up if that call comes to you.", "score": 2, "created_utc": 1612753271, "company": "amazon"}, {"body": "One of your drivers let themselves into our property, again, despite instructions on my account telling them not to. This item was ordered 2 weeks ago You know what's really awkward? I've had to go for a Covid 19 test this morning Your driver is now possibly infectious", "score": 1, "created_utc": 1612753229, "company": "amazon"}, {"body": "you surprised? I'm not. Figure out how to make it up to me pls", "score": 2, "created_utc": 1612752739, "company": "amazon"}, {"body": "is committed to achieving #netzerocarbon across its operations by 2040 and by #electrifying their fleet they are one step closer! high_voltage delivery_truck #fleet #climatepledge #electricvans #electricvehicles #sustainabletransportation", "score": 3, "created_utc": 1612752523, "company": "amazon"}, {"body": "I ordered so many products approximately 40 or more than that which costed to me almost 35k in last 2 months. Out of those product I got 3 product damaged on which I gave proof multiple times on email and then also I got response after multiple chat and calls to amazon.", "score": 1, "created_utc": 1612752498, "company": "amazon"}, {"body": "Sir, I did the product purchase. If he turns out to be missing, please help me for that.", "score": 1, "created_utc": 1612752413, "company": "amazon"}, {"body": "This was kind of gross to be honest. You all took it way too far. Also, you'd think she'd lust over a man with chin.", "score": 0, "created_utc": 1612751660, "company": "amazon"}, {"body": "Criminals are calling from 01207473008 wanting to discuss Amazon Prime Account annual renewal. Indian fraudsters, Indian accent, based in India. When told that they are fraudsters because Amazon doesn't ring around, they abused my mother. Do something about these crooks", "score": 2, "created_utc": 1612751509, "company": "amazon"}, {"body": "buddy. pal. i know 10pm on the next day is still next day delivery but...like is it Really? (legit though Amazon is doing an amazing job keeping atleast a little bit of normality ticking over in these weird times)", "score": 0, "created_utc": 1612751312, "company": "amazon"}, {"body": "you've been a bad girl", "score": 0, "created_utc": 1612750487, "company": "amazon"}, {"body": "has reached agreement with Eneco for the supply of 130MW of electricity from the 759MW Hollandse Kust Noord #offshorewind farm off the Netherlands", "score": 2, "created_utc": 1612749722, "company": "amazon"}, {"body": "- Committed to achieving Net-Zero Carbon by 2040 across all operations. #Inspiration #ClimatePledge #Amazon #business", "score": 0, "created_utc": 1612749601, "company": "amazon"}, {"body": "Whether it takes 1 or 2 days, 3 days, 4 days, Sir, check the whole thing once more.Sir, I can understand. It is not possible to repeatedly process the same identical. But Sir, my  10000 implicated Sir, please check the whole process again.", "score": 0, "created_utc": 1612749316, "company": "amazon"}, {"body": "Sir, after doing a thorough investigation, you are saying that the product has been given by me, but Sir, we have not received the product, so what can we do. Sir, my money is stuck, please do not check this whole process again.", "score": 0, "created_utc": 1612749281, "company": "amazon"}, {"body": "moves a step closer to 100% #renewableenergy goal with agreement with #ESG #energytransition #offshorewind #netherlands #thenetherlands #sustainabilitygoals", "score": 0, "created_utc": 1612748987, "company": "amazon"}, {"body": "funny story I first started trying to connect with Jeff when I started receiving deliveries for another customer December of 2017. Unfortunately my disability was active so I had to drive the deliveries to the customer on several occasions. Routing was what we started", "score": 0, "created_utc": 1612748616, "company": "amazon"}, {"body": "my information is getting leaked. Fraud calls are coming and he was saying he has all the information about my shopping list. How he got to know??tell me . Data is not secure at all. I want an answer.", "score": 1, "created_utc": 1612748592, "company": "amazon"}, {"body": "Will you guys make a photo app now that will overcharge people with their ?!", "score": 0, "created_utc": 1612748412, "company": "amazon"}, {"body": "You have again failed to keeP your promise. Pickup not completed as per scheduleFeb 8, between 9AM-2PM. It's a fifth time you have failed to pick it up and making your costumers to suffer. Its over 9ne month now, How long I have to wait now.", "score": 4, "created_utc": 1612748384, "company": "amazon"}, {"body": "customer service is great I've never had any issues ever resolved so easily and effortlessly relieved_face it's so refreshing", "score": 0, "created_utc": 1612747949, "company": "amazon"}, {"body": "Recently amazon is into selling used products. They are selling products which are not in company seal and they term it as not returnable. So kindly do not buy any such products as they are dumping used goods.", "score": 0, "created_utc": 1612747703, "company": "amazon"}, {"body": "you are not solving my problem since 1 month and took the product back and not refund my money.. no proper resolution given and making me go round and round #Amazon #capitalfloat #AmazonPrime", "score": 1, "created_utc": 1612746933, "company": "amazon"}, {"body": "Jeff, we could have used the internet speed to run that high-speed train we were talking about from coast to coast \"The Weeknd's close camera work delivered the meme of Super Bowl LV\"", "score": 0, "created_utc": 1612746675, "company": "amazon"}, {"body": "Order# 404-1708545-9315530 One mnth complete still order hasn't been picked up for refund no response from email support and customer service just making fool saying order will be pick up soon but it hasn't been picked up yet. Hope to get soln here", "score": 2, "created_utc": 1612746653, "company": "amazon"}, {"body": "why will my prime account not add europsport? It says unable to complete at this time!", "score": 1, "created_utc": 1612746616, "company": "amazon"}, {"body": "i had ordered 3 toy cars but i received only 1.. i had requested for the return and it is completed also but TILL NOW I HAVE NOT RECEIVED MY MONEY..", "score": 1, "created_utc": 1612746591, "company": "amazon"}, {"body": "is watching you e-commercereus plant camera's in bezorgwagens", "score": 0, "created_utc": 1612746149, "company": "amazon"}, {"body": "This halarioushahaa", "score": 0, "created_utc": 1612745871, "company": "amazon"}, {"body": "how to fix this? Stuck here since yesterday.", "score": 1, "created_utc": 1612745426, "company": "amazon"}, {"body": "I'm really disappointed in your service. It's the first time I ordered a product, which was on the 21st January, and scheduled for delivery tomorrow. But I spoke to a agent and she told me the package was not picked up yet. Not a very good first impression. angry_face", "score": 1, "created_utc": 1612745104, "company": "amazon"}, {"body": "Hi. Regarding our ORDER # 111-7828533-3145064, placed on 28th Jan-21, the product need to be returned, courier charging INR 6500 or USD 87.17. Need refund of this amount as long term customer.", "score": 1, "created_utc": 1612744924, "company": "amazon"}, {"body": "Posted...", "score": 0, "created_utc": 1612744528, "company": "amazon"}, {"body": "Posted...", "score": 0, "created_utc": 1612744528, "company": "amazon"}, {"body": "Posted...", "score": 0, "created_utc": 1612744527, "company": "amazon"}, {"body": "Posted...", "score": 0, "created_utc": 1612744526, "company": "amazon"}, {"body": "Spammed ad everywhere get out of my timeline.", "score": 0, "created_utc": 1612744505, "company": "amazon"}, {"body": "So this ad is basically saying that it's okay for a woman to cheat on her husband? I understand that it's just an ad and MBJ is playing Alexa, but seeing her doing everything she wants with her husband watching, not giving a crap? Whether MJB is there or not? Terrible message", "score": 1, "created_utc": 1612744462, "company": "amazon"}, {"body": "There's no objectifying going on here. Just a self-conscious insecure man reaching hard to try to make an issue out of something meant to be funny... a woman fantasizing.", "score": 3, "created_utc": 1612744213, "company": "amazon"}, {"body": "#ps5 charging station in stock", "score": 0, "created_utc": 1612743742, "company": "amazon"}, {"body": "adding #AI-equipped cameras to delivery vans to monitor safety, effectively turning their massive delivery fleet into an army of mobile Ring surveillance cameras. #Amazon", "score": 0, "created_utc": 1612743351, "company": "amazon"}, {"body": "Mine works just fine. Always saying thank you to her since I don't want my house to burn in an robot apocalypse", "score": 0, "created_utc": 1612743308, "company": "amazon"}, {"body": "looks like another semi skipped the chain up requirement at Snoqualmie pass crashing into a travel trailer. It only caused the pass to close for several hours on thousands stuck waiting. Good job", "score": 0, "created_utc": 1612743271, "company": "amazon"}, {"body": "I received a call few minutes back ,the man said he is from Amazon and told me I have won a car of Rs.1260000. Do u want cash or car, confirm. I abruptly ended the call. He was definitely a fraudster. Take necessary action. #amazonin #Amazon .", "score": 2, "created_utc": 1612742952, "company": "amazon"}, {"body": "delivered my package to someone else's porch do I steal my own package off of their porch? they probably have a camera like what do I do", "score": 2, "created_utc": 1612742830, "company": "amazon"}, {"body": "Given exchange on 2nd Feb. But today I received picked up successfully. How do you have right to entertain with customer money??", "score": 2, "created_utc": 1612742596, "company": "amazon"}, {"body": "This commercial is cringe", "score": 0, "created_utc": 1612742422, "company": "amazon"}, {"body": "why wont you answer my dm ?? I have payd , account is definitly blocked ? have now problems but i cant order items ???", "score": 0, "created_utc": 1612742324, "company": "amazon"}, {"body": "why is it ok to profit from such blatant anti white racism? Do you also sell white jokes about black folks? face_with_raised_eyebrow", "score": 0, "created_utc": 1612742213, "company": "amazon"}, {"body": "face_with_tears_of_joy face_with_tears_of_joy face_with_tears_of_joy rolling_on_the_floor_laughing rolling_on_the_floor_laughing rolling_on_the_floor_laughing rolling_on_the_floor_laughing rolling_on_the_floor_laughing face_with_tears_of_joy face_with_tears_of_joy face_with_tears_of_joy wipes eyes ...well played, Mike. Well played... face_with_tears_of_joy face_with_tears_of_joy face_with_tears_of_joy face_with_tears_of_joy face_with_tears_of_joy beaming_face_with_smiling_eyes beaming_face_with_smiling_eyes beaming_face_with_smiling_eyes beaming_face_with_smiling_eyes beaming_face_with_smiling_eyes", "score": 0, "created_utc": 1612742192, "company": "amazon"}, {"body": "Or some people have an overactive imagination, a creepy one.", "score": 0, "created_utc": 1612742157, "company": "amazon"}, {"body": "#prabhat singh", "score": 1, "created_utc": 1612742095, "company": "amazon"}, {"body": "Cringe commercial. WAP has lowered the cultural bar. This is evidence.", "score": 0, "created_utc": 1612741810, "company": "amazon"}, {"body": "My Alexa would be dream or ranboo or technoblade! grinning_face", "score": 0, "created_utc": 1612741783, "company": "amazon"}, {"body": "#prabhat Singh", "score": 1, "created_utc": 1612741755, "company": "amazon"}, {"body": "Now flip the genders around and let me know if women still find it hilarious lol", "score": 0, "created_utc": 1612741717, "company": "amazon"}, {"body": "Not my choice but they should have been did this", "score": 0, "created_utc": 1612741706, "company": "amazon"}, {"body": "was perfect for this!", "score": 0, "created_utc": 1612741469, "company": "amazon"}, {"body": "This is hypocrisy to the fullest!!! If the gender was reverse they would be a damn outrage and Amazon would be called misogynistic!!! If men don't stand up for fair equality we we as men are screwed, not acceptable!!! pouting_face thumbs_down", "score": 2, "created_utc": 1612741428, "company": "amazon"}, {"body": "It may look good but it sounds like crap. I don't know what you guys did do it, but you need to make it sound like the previous version.", "score": 0, "created_utc": 1612741359, "company": "amazon"}, {"body": "I know for a FACT y'all treat workers like slaves.....so with that invest in #DOGE", "score": 2, "created_utc": 1612741278, "company": "amazon"}, {"body": "That was stupid, sexist, abusing diversity and over played.. I like Mike though", "score": 1, "created_utc": 1612741165, "company": "amazon"}, {"body": "She will remember this", "score": 0, "created_utc": 1612740948, "company": "amazon"}, {"body": "i ordered lightning to hdmi cable and it received. But its not working. Then I request to return this product but i don't have any call from #Amazon or delivery assistant. To pickup thise parcel. Order no. - 408-4073820-4426729", "score": 1, "created_utc": 1612740941, "company": "amazon"}, {"body": "This Black Mirror episode sucks", "score": 0, "created_utc": 1612740936, "company": "amazon"}, {"body": "Weird", "score": 0, "created_utc": 1612740910, "company": "amazon"}, {"body": "If you can't beat the robots...do em", "score": 0, "created_utc": 1612740875, "company": "amazon"}, {"body": "I got this for Christmas and just set it up today and was already having fun with it D", "score": 1, "created_utc": 1612740866, "company": "amazon"}, {"body": "Yitzy &gt;&gt; Home Fixture &gt;&gt;Home Improvement &gt;&gt; Bathroom Faucet Matte Black Rain Shower &gt;&gt; Read more &lt;&lt; #rainshower #shower #bathroomdesign #bathroom #interiordesign #showers #nature #rainshowerhead #rainstorm #raindrops #showertime #rainshowers", "score": 1, "created_utc": 1612740807, "company": "amazon"}, {"body": "Waiting for #alexa to become sentient and this to take a #horrorMovie turn.", "score": 0, "created_utc": 1612740771, "company": "amazon"}, {"body": "This is my favorite ad. I could watch this forever smiling_face_with_hearts face_with_tears_of_joy face_with_tears_of_joy .", "score": 0, "created_utc": 1612740753, "company": "amazon"}, {"body": "so Alexa is trans or what", "score": 0, "created_utc": 1612740748, "company": "amazon"}, {"body": "Nice, teaching women that their husband isnt enough.", "score": 0, "created_utc": 1612740736, "company": "amazon"}, {"body": "Surprised Amazon is this thirsty with all the piss bottles all over their facilities.", "score": 4, "created_utc": 1612740654, "company": "amazon"}, {"body": "Fixed", "score": 0, "created_utc": 1612740646, "company": "amazon"}, {"body": "imagine if they did this with genders reversed. there would be so many accusations of sexism and unrealistic body standards. amazon would issue an apology and they'd make a placating donation to some feminist cause as penance.", "score": 1, "created_utc": 1612740555, "company": "amazon"}, {"body": "Definitely my favorite this year", "score": 0, "created_utc": 1612740549, "company": "amazon"}, {"body": "hey bff amazon", "score": 0, "created_utc": 1612740515, "company": "amazon"}, {"body": "Ugh creepy", "score": 0, "created_utc": 1612740487, "company": "amazon"}, {"body": "So is Michael alexas voice now?", "score": 0, "created_utc": 1612740420, "company": "amazon"}, {"body": "hell yes", "score": 0, "created_utc": 1612740367, "company": "amazon"}, {"body": "Please save The Order from netflix!! #savetheorder #buytheorder #theorder", "score": 0, "created_utc": 1612740135, "company": "amazon"}, {"body": "#AlexasNewBody is so good I need to make confessionals to Father Michael B. Jordan, the hot Priest no one can have until his secret is revealed in the next #SisterAct 3,4 with GOD PLEASE FORGIVE ME. folded_hands #Alexa contact the producers &amp; directors &amp; make it happen.", "score": 0, "created_utc": 1612740127, "company": "amazon"}, {"body": "'s Helix is the latest twist on spiral-shaped architecture. Located across the Potomac River, Amazon's future corporate campus will hold 2.8 million square feet of office space. #architecture #amazon #innovation #construction #urbanplanning #urbandesign #smartcities", "score": 2, "created_utc": 1612740080, "company": "amazon"}, {"body": "Now, more evil looking design! Just make it a black cube of Saturn.", "score": 0, "created_utc": 1612739863, "company": "amazon"}, {"body": "Gross.", "score": 0, "created_utc": 1612739778, "company": "amazon"}, {"body": "Union busters shouldn't be platformed. W E W A N T I T A L L", "score": 0, "created_utc": 1612739677, "company": "amazon"}, {"body": "This was hilarious! I love it. Teehee face_with_hand_over_mouth", "score": 0, "created_utc": 1612739608, "company": "amazon"}, {"body": "oh i get it, she's making everything too wet because she only thinks with one thing.", "score": 0, "created_utc": 1612739396, "company": "amazon"}, {"body": "This commercial is hilarious but the freaking responses if they replaced the same scenes with a man dreaming of Aha King or Gabrielle Union... thinking_face thinking_face thinking_face", "score": 0, "created_utc": 1612739282, "company": "amazon"}, {"body": "Hope so", "score": 0, "created_utc": 1612739254, "company": "amazon"}, {"body": "An excellent notch in \"advertising about great bodies without objectification\". Just his expressions and once his abs. How it should be done. And how much is enough. Can be used just as well for ads with women models..", "score": 0, "created_utc": 1612739223, "company": "amazon"}, {"body": "PS - my wife is already asking if we can have Alexa talk like Henry Cavill flushed_face flushed_face flushed_face flushed_face flushed_face", "score": 0, "created_utc": 1612739139, "company": "amazon"}, {"body": "Best commercial if the night", "score": 0, "created_utc": 1612739088, "company": "amazon"}, {"body": "Best commercial ever!!", "score": 0, "created_utc": 1612739079, "company": "amazon"}, {"body": "This was honestly the BEST superbowl commercial rolling_on_the_floor_laughing rolling_on_the_floor_laughing rolling_on_the_floor_laughing rolling_on_the_floor_laughing rolling_on_the_floor_laughing rolling_on_the_floor_laughing rolling_on_the_floor_laughing rolling_on_the_floor_laughing rolling_on_the_floor_laughing", "score": 0, "created_utc": 1612739032, "company": "amazon"}, {"body": "Best commercial ever!", "score": 0, "created_utc": 1612738934, "company": "amazon"}, {"body": "Great work! ON1 HOLLYWOOD is proud to be a new store on the Amazon platform!", "score": 1, "created_utc": 1612738908, "company": "amazon"}, {"body": "I am sending you 1! Pi is a new digital currency developed by Stanford PhDs, with over 10 million members worldwide. To claim your Pi, follow this link and use my username (RandallBurks) as your invitation code.", "score": 0, "created_utc": 1612738839, "company": "amazon"}, {"body": "Sir, I request you to check this topic again.", "score": 1, "created_utc": 1612738823, "company": "amazon"}, {"body": "OMG, too funny. Who wrote this.", "score": 0, "created_utc": 1612738821, "company": "amazon"}, {"body": "phone number is 8986201742", "score": 0, "created_utc": 1612738753, "company": "amazon"}, {"body": "The double entendres in this commercial put it over the top. Kudos to the writers and actors. Really funny! #turnoffthesprinklers", "score": 0, "created_utc": 1612738718, "company": "amazon"}, {"body": "But after 5 days, I did not receive anything and was told that you have received the call, Sir, you are requested to discuss this subject again so that my trust remains on Amazon Thank you", "score": 0, "created_utc": 1612738693, "company": "amazon"}, {"body": "Sir I Satanarayana Mehta. I received a phone Redmi Note Prime from Amazon on 31 January 2021, but we received an empty box and then I talked to the customer service center and it took 5 days.", "score": 0, "created_utc": 1612738675, "company": "amazon"}, {"body": "Home run on this one. Objectifying men. Encouraging cheating. Making the husband look stupid. Breaking up families. Divorce. All good ideologies to aspire to now.", "score": 0, "created_utc": 1612738663, "company": "amazon"}, {"body": "refusing to post my review about a product sent to me last week that was 8 YEARS out of date. Can't see why woman_facepalming", "score": 3, "created_utc": 1612738649, "company": "amazon"}, {"body": "If this ad were reversed, and a man was seeing a woman in his bathtub... it would be sexist. How is this ad ok?", "score": 3, "created_utc": 1612738612, "company": "amazon"}, {"body": "His eyes scare me", "score": 0, "created_utc": 1612738536, "company": "amazon"}, {"body": "would love this new Alexa for her room", "score": 2, "created_utc": 1612738530, "company": "amazon"}, {"body": "You are doing a great job...", "score": 1, "created_utc": 1612738517, "company": "amazon"}, {"body": "I want one that looks exactly like him, with the velvet voice.", "score": 0, "created_utc": 1612738485, "company": "amazon"}, {"body": "Hey Amazon/Hasbro every other retailer has restocked their exclusives multiple times yet this one hasn't been done at all. Get more in please.", "score": 1, "created_utc": 1612738409, "company": "amazon"}, {"body": "Got all excited thinking this would be a launch of a Michael B Jordan voiceover for Alexa.", "score": 0, "created_utc": 1612738390, "company": "amazon"}, {"body": "Where can I buy that Michael B. Jordan Alexa!!?? I want that Alexa!!!", "score": 0, "created_utc": 1612738278, "company": "amazon"}, {"body": "hi please tell me how to start amazon delivery franchise", "score": 0, "created_utc": 1612738275, "company": "amazon"}, {"body": "Creepy commercial.", "score": 0, "created_utc": 1612738251, "company": "amazon"}, {"body": "Alexa no, don't do that. (got me dying)", "score": 0, "created_utc": 1612738211, "company": "amazon"}, {"body": "let your workers form unions.", "score": 0, "created_utc": 1612738197, "company": "amazon"}, {"body": "Loved it!!", "score": 0, "created_utc": 1612738189, "company": "amazon"}, {"body": "So, the commercial is Guy gets cucked by Amazon. ...Okay.", "score": 0, "created_utc": 1612738174, "company": "amazon"}, {"body": "Hi amazon team how am start amazon delivery franchise", "score": 0, "created_utc": 1612738172, "company": "amazon"}, {"body": "This commercial (finally) speaks to women. Hilarious. And hot, really hot.", "score": 2, "created_utc": 1612738049, "company": "amazon"}, {"body": "This!! Is my favorite commercial", "score": 1, "created_utc": 1612738037, "company": "amazon"}, {"body": "Worst. Commercial. Ever.", "score": 0, "created_utc": 1612737944, "company": "amazon"}, {"body": "alexa is a treasonous spy device you will go to jail", "score": 0, "created_utc": 1612737931, "company": "amazon"}, {"body": "Alexa, please play Culture Class Podcast (in MBJs voice)", "score": 0, "created_utc": 1612737918, "company": "amazon"}, {"body": "That was dumb AF", "score": 0, "created_utc": 1612737893, "company": "amazon"}, {"body": "Did you just sexualize a speaker? woman_facepalming_medium-light_skin_tone", "score": 0, "created_utc": 1612737846, "company": "amazon"}, {"body": "y'all got some explaining to do !!! backhand_index_pointing_right_medium-dark_skin_tone #BlissMovie backhand_index_pointing_left_medium-dark_skin_tone thinking_face thinking_face thinking_face", "score": 0, "created_utc": 1612737837, "company": "amazon"}, {"body": "Black women ain't checking for Michael B. Jordan like that. We know your preferences MIKE! Be true to yourself Bro. We ain't mad at you. rolling_on_the_floor_laughing", "score": 0, "created_utc": 1612737823, "company": "amazon"}, {"body": "I love this ad rolling_on_the_floor_laughing rolling_on_the_floor_laughing rolling_on_the_floor_laughing rolling_on_the_floor_laughing rolling_on_the_floor_laughing", "score": 0, "created_utc": 1612737722, "company": "amazon"}, {"body": "I don't have money for that crap! I can't afford WiFi!", "score": 0, "created_utc": 1612737682, "company": "amazon"}, {"body": "So Amazon, when is this version of Alexa arriving? I'm willing to beta test.", "score": 0, "created_utc": 1612737667, "company": "amazon"}, {"body": "It is amazing...best Superbowl commercial. #michaelbjordan", "score": 8, "created_utc": 1612737503, "company": "amazon"}, {"body": "Amazon when they post a superbowl ad after underpaying their workers", "score": 2, "created_utc": 1612737457, "company": "amazon"}, {"body": "If you own one of these, i question your intelligence, you will be the reason one day that we have cameras in our own bathrooms for our own safety'", "score": 0, "created_utc": 1612737440, "company": "amazon"}, {"body": "Hi Amazon..could u plz justify Rs 8.5K price point face_with_tears_of_joy", "score": 1, "created_utc": 1612737366, "company": "amazon"}, {"body": "Amazon is one of the worst companies in the world.. watch the documentary called The Rise &amp; Reign of Jeff Bezos on YouTube to really understand why. It's free.", "score": 0, "created_utc": 1612737333, "company": "amazon"}, {"body": "flushed_face That's absolutely disgusting!", "score": 0, "created_utc": 1612737294, "company": "amazon"}, {"body": "The most worthless advertisement tonight. A company trashing loyal love, marriage, and family for idols of gold and silver. I love God. And I love that he swears he will judge the adulterers and worshipers of idols, including Amazon.", "score": 0, "created_utc": 1612737245, "company": "amazon"}, {"body": "Wow. Super sexist. So much for equality. I'd love to see the roles reversed and the reaction. Sexist fucking pigs", "score": 0, "created_utc": 1612737243, "company": "amazon"}, {"body": "I ordered redmi note 9 pro mobile phone in the morning Today, but I don't know why amzone canceled my order . Payment alredy done by upi ,I want to refund my money back ...", "score": 3, "created_utc": 1612737219, "company": "amazon"}, {"body": "Why does this worry me so?", "score": 0, "created_utc": 1612737208, "company": "amazon"}, {"body": "Something about this commercial just hits wrong. And it's not MBJordan because that's my dude. It's probably that bathtub part with the fact that she's married and totally consumed by virtual MBJordan.", "score": 1, "created_utc": 1612737183, "company": "amazon"}, {"body": "This is great", "score": 0, "created_utc": 1612737161, "company": "amazon"}, {"body": "That was my favorite ad", "score": 0, "created_utc": 1612737113, "company": "amazon"}, {"body": "Again....Amazon of Jeff Bezos and the globalist socialist neutral_face", "score": 0, "created_utc": 1612737051, "company": "amazon"}, {"body": "I have a few questions lol but I'm gonna keep them to myself", "score": 1, "created_utc": 1612737050, "company": "amazon"}, {"body": "I dont even want my Google Home anymore", "score": 0, "created_utc": 1612737011, "company": "amazon"}, {"body": "Best ad of the game!!!", "score": 0, "created_utc": 1612736998, "company": "amazon"}, {"body": "You know it", "score": 0, "created_utc": 1612736991, "company": "amazon"}, {"body": "Our Lives Matter Vaccinate. Physically distance. Mask Up. Wash Hands. Dr. Kizzmekia Shanta Corbett Safety and Effectiveness of Coronavirus Vaccines Listen. Learn. Share.", "score": 0, "created_utc": 1612736961, "company": "amazon"}, {"body": "Shut up, brand!", "score": 0, "created_utc": 1612736913, "company": "amazon"}, {"body": "that's would be a great movie with micheal", "score": 0, "created_utc": 1612736866, "company": "amazon"}, {"body": "This was the best one!!!!!", "score": 0, "created_utc": 1612736854, "company": "amazon"}, {"body": "If only you could get Alexa or Siri to be the voice of whatever actor or singer you wanted.", "score": 7, "created_utc": 1612736842, "company": "amazon"}, {"body": "Brilliant! So funny! clapping_hands clapping_hands clapping_hands thumbs_up rolling_on_the_floor_laughing face_with_tears_of_joy", "score": 0, "created_utc": 1612736835, "company": "amazon"}, {"body": "This commercial is hilarious for so many reasons! face_with_tears_of_joy face_with_tears_of_joy face_with_tears_of_joy", "score": 0, "created_utc": 1612736830, "company": "amazon"}, {"body": "fuck you", "score": 0, "created_utc": 1612736827, "company": "amazon"}, {"body": "Can I please get to be the voice for my Alexa? #please", "score": 0, "created_utc": 1612736817, "company": "amazon"}, {"body": "My order is # 40884212593262715 first time i got damaged product i sent image to amazon customer service then they create my replacement. Again i got product that containt no charging cable then i again contact to customer care.", "score": 4, "created_utc": 1612736764, "company": "amazon"}, {"body": "If you really need to be more closely monitored by big tech - Have we got news for you!", "score": 0, "created_utc": 1612736762, "company": "amazon"}, {"body": "This ad was disgusting", "score": 0, "created_utc": 1612736737, "company": "amazon"}, {"body": "Yeah, ummm where can I get one of those Michael B. Jordan Alexas? red_heart", "score": 1, "created_utc": 1612736736, "company": "amazon"}, {"body": "I keep mine unplugged.", "score": 0, "created_utc": 1612736680, "company": "amazon"}, {"body": "Treat your employees better please you fucking scrubs!!!!", "score": 0, "created_utc": 1612736623, "company": "amazon"}, {"body": "OMG Amazon, children with code abilities, given free reign to be childish idiots. Nope, as a senior programmer, well beyond your ignorance, I challenge you, all of you, to develop an \"ap\" users really need without a \"hook\"...dare you!", "score": 2, "created_utc": 1612736580, "company": "amazon"}, {"body": "This was honestly the best part of the Super Bowl.", "score": 0, "created_utc": 1612736482, "company": "amazon"}, {"body": "I have faced issue with the payment option where your agent are openly denying to help as there have no alternative. Agent nae Sawai. We had a call discussion.", "score": 1, "created_utc": 1612736472, "company": "amazon"}, {"body": "Greeeeeeeat ad... I just laugh a lot (and yeah fantasized a little) #AlexasNewBody", "score": 0, "created_utc": 1612736403, "company": "amazon"}, {"body": "Horrible commercial!! Making cheating s em line a good thing. Disgusting! #AlexaCommercialSucked", "score": 0, "created_utc": 1612736372, "company": "amazon"}, {"body": "Alexa is in a box at my house she will never be turned on again check_mark_button", "score": 0, "created_utc": 1612736349, "company": "amazon"}, {"body": "This is creepy and uncomfortable", "score": 0, "created_utc": 1612736349, "company": "amazon"}, {"body": "I LOVED this commercial! Michael B. Jordan is a lot of women's Alexa fantasy. face_with_tears_of_joy", "score": 0, "created_utc": 1612736314, "company": "amazon"}, {"body": "Best commercial ever!! smiling_face_with_heart-eyes smiling_face_with_heart-eyes smiling_face_with_heart-eyes", "score": 0, "created_utc": 1612736301, "company": "amazon"}, {"body": "I haven't watched an ad on YouTube since I found out you could skip. Until yesterday. Yeah, I watched it a few times.", "score": 1, "created_utc": 1612736296, "company": "amazon"}, {"body": "Straight up blasphemy. Glorifies adulterous behaviors, idolization and transhumanism.", "score": 0, "created_utc": 1612736286, "company": "amazon"}, {"body": "A lot of hate here. The racist resentment speaks when their real names are hidden.", "score": 0, "created_utc": 1612736235, "company": "amazon"}, {"body": "can we please get some floor mats? Not asking for much #amazon #amazonemployee", "score": 0, "created_utc": 1612736209, "company": "amazon"}, {"body": "This ad is straight up porn.", "score": 0, "created_utc": 1612736162, "company": "amazon"}, {"body": "In a way this offended everyone man_shrugging_medium_skin_tone ad is the best ad of the super bowl this year", "score": 0, "created_utc": 1612736162, "company": "amazon"}, {"body": "BRUHHHHHHHHHHHHH Y'all WYLINNN at hahahahaha That's hilarious", "score": 0, "created_utc": 1612736160, "company": "amazon"}, {"body": "This commercial was stupid. And the comment of things are getting really wet out here was in poor taste. All of this commercial was bad. And I'm not even a parent. Like...?", "score": 0, "created_utc": 1612736149, "company": "amazon"}, {"body": "Whoa", "score": 0, "created_utc": 1612736142, "company": "amazon"}, {"body": "Hilarious heart_exclamation", "score": 0, "created_utc": 1612736135, "company": "amazon"}, {"body": "God damn, it's not like you don't already know how thirsty we all are by spying on us! You're just gonna openly weaponize it like that?! We are smarter than that. (Unless, of course, there are test models...)", "score": 0, "created_utc": 1612736023, "company": "amazon"}, {"body": "dis pretty funny face_with_tears_of_joy", "score": 0, "created_utc": 1612735999, "company": "amazon"}, {"body": "This nigga is a menace face_with_tears_of_joy", "score": 0, "created_utc": 1612735962, "company": "amazon"}, {"body": "One of the best commercials! Damn!", "score": 0, "created_utc": 1612735895, "company": "amazon"}, {"body": "Fuck off Amazon. Quit trying to stop your employees from unionizing.", "score": 0, "created_utc": 1612735879, "company": "amazon"}, {"body": "So we're glorifying having a wife cheat with an electronic device. Cute face_with_rolling_eyes", "score": 0, "created_utc": 1612735864, "company": "amazon"}, {"body": "#sonu #amazondailyquiztime I hop i win this contest today.", "score": 0, "created_utc": 1612735852, "company": "amazon"}, {"body": "buy #amc why don't you #stocks", "score": 1, "created_utc": 1612735799, "company": "amazon"}, {"body": "So loving this fantasy and role reversal in this one. Had me laughing and engaged !", "score": 0, "created_utc": 1612735798, "company": "amazon"}, {"body": "Sex sells.", "score": 0, "created_utc": 1612735767, "company": "amazon"}, {"body": "But... I did not expect it to be... so BIG!", "score": 0, "created_utc": 1612735752, "company": "amazon"}, {"body": "Honestly might be the best ad I've ever seen face_with_tears_of_joy", "score": 0, "created_utc": 1612735717, "company": "amazon"}, {"body": "Not gonna lie, y'all got my FULL ATTENTION", "score": 0, "created_utc": 1612735716, "company": "amazon"}, {"body": "Stupid and very sexist!", "score": 0, "created_utc": 1612735694, "company": "amazon"}, {"body": "Dang the pressure is on! I gotta get my list together, but the first person that comes to mind is That would be a funny Alexa to hang with! Also, he's one of my celeb crushes soooo woman_shrugging_light_skin_tone kind of win-win for me there.", "score": 0, "created_utc": 1612735650, "company": "amazon"}, {"body": "This is truly a very disturbing and kinda creepy commercial", "score": 0, "created_utc": 1612735635, "company": "amazon"}, {"body": "Lmfao. This is great!", "score": 0, "created_utc": 1612735627, "company": "amazon"}, {"body": "This is an Alexa I can get down with", "score": 0, "created_utc": 1612735569, "company": "amazon"}, {"body": "Air duct cleaning .Westerville , Ohio ...740-771-6554", "score": 1, "created_utc": 1612735505, "company": "amazon"}, {"body": "Satan lives deep In this culture! Turn from this, accept Jesus Christ!!! This is so evil!", "score": 0, "created_utc": 1612735485, "company": "amazon"}, {"body": "Disconnected both of my Alexas. They are only useful if always on and I don't need every word being listened to by Amazon or govt", "score": 0, "created_utc": 1612735472, "company": "amazon"}, {"body": "good", "score": 0, "created_utc": 1612735467, "company": "amazon"}, {"body": "The seller asked me to contact customer support and you people are not helping me out. Giving #Lameexcuses", "score": 2, "created_utc": 1612735411, "company": "amazon"}, {"body": "Are we surprised Twitter and Amazon are promoting adultery? rolling_on_the_floor_laughing", "score": 0, "created_utc": 1612735341, "company": "amazon"}, {"body": "and this is how they provide customer service! Untrained agents", "score": 1, "created_utc": 1612735329, "company": "amazon"}, {"body": "No such thing as too good. It's every woman's prerogative to be well taken cared for by Michael, I mean Alexa.", "score": 0, "created_utc": 1612735326, "company": "amazon"}, {"body": "Best #SuperBowl ad this year! face_with_tears_of_joy", "score": 0, "created_utc": 1612735268, "company": "amazon"}, {"body": "This was her husband's real reaction rolling_on_the_floor_laughing", "score": 0, "created_utc": 1612735204, "company": "amazon"}, {"body": "Do you know if we have an extra ones of these? is the new I'll have what she's having from When Harry Met Sally.", "score": 7, "created_utc": 1612735162, "company": "amazon"}, {"body": "Does this count as diversity?", "score": 0, "created_utc": 1612735146, "company": "amazon"}, {"body": "This offends me. How dare you exploit a man like that.", "score": 1, "created_utc": 1612735125, "company": "amazon"}, {"body": "So round, so firm, so fully packed!", "score": 0, "created_utc": 1612735122, "company": "amazon"}, {"body": "My cat is so jealous of my Echo Dot face_with_tears_of_joy face_with_tears_of_joy face_with_tears_of_joy The dirty looks he gives it... grinning_squinting_face grinning_squinting_face grinning_squinting_face", "score": 0, "created_utc": 1612735119, "company": "amazon"}, {"body": "How about you just give us Michael B. Jordans voice for Google hot_face", "score": 0, "created_utc": 1612735079, "company": "amazon"}, {"body": "I literally turn this ad off ASAP every time it forces itself upon me...", "score": 0, "created_utc": 1612735045, "company": "amazon"}, {"body": "Nice work", "score": 0, "created_utc": 1612735001, "company": "amazon"}, {"body": "So I guess we all assumed Alexa's gender this whole time... Stupid", "score": 0, "created_utc": 1612734956, "company": "amazon"}, {"body": "I unplugged Alexa and stuck it in with my socks. The new Alexa might be worth buying thinking_face Ohhh Alexa! face_with_tears_of_joy Great Ad indeed.", "score": 0, "created_utc": 1612734946, "company": "amazon"}, {"body": "ugly hoe", "score": 0, "created_utc": 1612734896, "company": "amazon"}, {"body": "I found this ad to be extremely toxic, lots of sexual innuendo, totally classless. Disgusting smut.", "score": 0, "created_utc": 1612734895, "company": "amazon"}, {"body": "Can I get a without remorse trailer?", "score": 0, "created_utc": 1612734893, "company": "amazon"}, {"body": "Michael B Jordan is gonna steal yo bitch", "score": 0, "created_utc": 1612734891, "company": "amazon"}, {"body": "Haven't seen an ad this good in I can't even remembe. It's perfect! So funny. So cute. Love it!!", "score": 0, "created_utc": 1612734891, "company": "amazon"}, {"body": "This is a whole level of hypocrisy switch the genders and tell me this commercial is still acceptable", "score": 0, "created_utc": 1612734891, "company": "amazon"}, {"body": "NO MASKS?", "score": 0, "created_utc": 1612734888, "company": "amazon"}, {"body": "This ad makes me uncomfortable.", "score": 0, "created_utc": 1612734882, "company": "amazon"}, {"body": "This why I must have two #bathrooms, ain't nobody got time for that.", "score": 2, "created_utc": 1612734781, "company": "amazon"}, {"body": "95 rupees delivery charge for an item? And that too for a customer having a Prime subscription? Seriously? Have you guys gone bonkers?", "score": 1, "created_utc": 1612734776, "company": "amazon"}, {"body": "What were you thinking? This, this sort of thing is why I stopped watching tv. Just Ewwwwww I have neither the desire nor the inclination to see into somebody's personal life in this way - not even a fictional character.", "score": 1, "created_utc": 1612734770, "company": "amazon"}, {"body": "Just goood genes. He's so handsome", "score": 0, "created_utc": 1612734724, "company": "amazon"}, {"body": "Way too much fighting. This ad is awesome, exemplifies desire and lust while being funny. Yeah, men can be objectified too.. but trust me fellas... we aint no Michael B. Jordan", "score": 9, "created_utc": 1612734701, "company": "amazon"}, {"body": "Yes please! relieved_face", "score": 0, "created_utc": 1612734676, "company": "amazon"}, {"body": "Does one order him on Prime? Asking for a friend.", "score": 0, "created_utc": 1612734674, "company": "amazon"}, {"body": "I can still be of help, DM", "score": 0, "created_utc": 1612734672, "company": "amazon"}, {"body": "One of my favorites tonight lol smiling_face_with_hearts", "score": 0, "created_utc": 1612734641, "company": "amazon"}, {"body": "Best ad I've seen for Alexa or anything else for that matter! face_with_tears_of_joy face_with_tears_of_joy face_with_tears_of_joy", "score": 3, "created_utc": 1612734628, "company": "amazon"}, {"body": "Creepiest commercial.", "score": 0, "created_utc": 1612734614, "company": "amazon"}, {"body": "Why do you offer same day delivery when it seems like you miss that window about half the time? And it's not like I live far from your distribution center, as my girlfriend puts it I live a couple blocks from where your delivery vans sleep...", "score": 2, "created_utc": 1612734610, "company": "amazon"}, {"body": "So, wait... We get to have custom voices now in Alexa? I don't get this ad at all.", "score": 0, "created_utc": 1612734599, "company": "amazon"}, {"body": "can i find an alexa that looks like this?", "score": 0, "created_utc": 1612734574, "company": "amazon"}, {"body": "I want THIS #Alexa!! LOL .. yeah whateverrrr Remember her? hahahaha", "score": 0, "created_utc": 1612734552, "company": "amazon"}, {"body": "Great commercial", "score": 0, "created_utc": 1612734533, "company": "amazon"}, {"body": "I sent back a item, I havent recieved a refund nor the item back (it was incase it wasnt sent back to you)", "score": 2, "created_utc": 1612734517, "company": "amazon"}, {"body": "Got a Alexa show used coming from EBay. Going to try to set it up to dial out when host body drops dead! I am dying slowly of terminal cancer. Donated body to science. Body has to be found under 12 hours! I live alone got no family and close friends. In home care hospice!", "score": 2, "created_utc": 1612734513, "company": "amazon"}, {"body": "It's the casting of two black people. Who are.great actors The husband was funny. He was like, am I being #cheated on, with a machine?", "score": 4, "created_utc": 1612734509, "company": "amazon"}, {"body": "Best commercial ever clapping_hands_medium-dark_skin_tone clapping_hands_medium-dark_skin_tone clapping_hands_medium-dark_skin_tone", "score": 0, "created_utc": 1612734500, "company": "amazon"}, {"body": "Awesome. Amazon. Promoting emotional infidelity World- wide.", "score": 0, "created_utc": 1612734488, "company": "amazon"}, {"body": "This commercial was an absolute hoot!!! My husband &amp; I howled...it was so funny!!!", "score": 0, "created_utc": 1612734476, "company": "amazon"}, {"body": "Cucked by Michael B. Jordan.", "score": 0, "created_utc": 1612734403, "company": "amazon"}, {"body": "I want this version of Alexa. Right now.", "score": 1, "created_utc": 1612734331, "company": "amazon"}, {"body": "Alexa, you got the attention of all the authors and they love this!!!", "score": 0, "created_utc": 1612734320, "company": "amazon"}, {"body": "Ok that man there", "score": 0, "created_utc": 1612734281, "company": "amazon"}, {"body": "When can I get one of these?!? #AlexasNewBody", "score": 0, "created_utc": 1612734243, "company": "amazon"}, {"body": "Should have been an Indian guy. An ode to your Indian skilled immigrants in green card backlog (cough American slave labor) programming alexa devices.", "score": 0, "created_utc": 1612734243, "company": "amazon"}, {"body": "how I'm bathing from now on!", "score": 0, "created_utc": 1612734191, "company": "amazon"}, {"body": "old design is better new is too bulky and noticeable", "score": 0, "created_utc": 1612734186, "company": "amazon"}, {"body": "Nope. This was a fail. Cringy. Not sexy. Weird. Maybe hire the #babylonbee next time.", "score": 0, "created_utc": 1612734182, "company": "amazon"}, {"body": "Noooo! My Siri is not happy.", "score": 0, "created_utc": 1612734167, "company": "amazon"}, {"body": "It's the Tom Brady League #TBL", "score": 0, "created_utc": 1612734158, "company": "amazon"}, {"body": "warning warning WARNING THIS IS AN AUTO RATIO warning warning", "score": 1, "created_utc": 1612734132, "company": "amazon"}, {"body": "This was a creepy as. This was a sick ad. Ok to cheat on your partner if the other person is not really there? Pretty twisted.", "score": 0, "created_utc": 1612734107, "company": "amazon"}, {"body": "This was by far the best ad, way too many celebrities hawking nonsense in the majority of the SB adds.", "score": 0, "created_utc": 1612733992, "company": "amazon"}, {"body": "shit Alexa getting that bbc", "score": 0, "created_utc": 1612733932, "company": "amazon"}, {"body": "Oh fuck off Amazon, get blocked middle_finger", "score": 1, "created_utc": 1612733894, "company": "amazon"}, {"body": "So y'all gonna sit here and pretend that subliminally encouraging infidelity in black families is ok? face_with_tears_of_joy", "score": 0, "created_utc": 1612733824, "company": "amazon"}, {"body": "if you are in school or in a less paying job Sugar mummy Sugar baby needed.just chat. I'm here to pay all your bills and pay for all your needs. I need a Real and Trustworthy Sugar Baby. First 10 to LIKE and RETWEET, FOLLOW get $2500 #sugarmummys Red heart #Cashappblessings", "score": 0, "created_utc": 1612733484, "company": "amazon"}, {"body": "Was really funny!!!", "score": 0, "created_utc": 1612733418, "company": "amazon"}, {"body": "when will I be able to have voice my alexa? #amazon #alexa #SuperBowlLV", "score": 1, "created_utc": 1612733033, "company": "amazon"}, {"body": "Thanks to amazon for giving such cash back I am very happy and please give me cash back always beaming_face_with_smiling_eyes beaming_face_with_smiling_eyes grinning_face_with_smiling_eyes grinning_face_with_smiling_eyes thumbs_up . And my appeal to everyone please use amazon pay.", "score": 1, "created_utc": 1612732904, "company": "amazon"}, {"body": "Fuck you, pigs!", "score": 0, "created_utc": 1612732865, "company": "amazon"}, {"body": "maybe instead of spending coins on a trash ass ad y'all should invest in some damn customer service reps, ones that can actually fucking help!", "score": 1, "created_utc": 1612732832, "company": "amazon"}, {"body": "wtf is going on with your customer service?!? I haven't been able to get into my account for damn near a month! I've called every day since January 15th and have gotten nowhere! All this money and ya can't provide proper service?!?!", "score": 0, "created_utc": 1612732762, "company": "amazon"}, {"body": "I formally request Katie Mcgrath's voice to be a choice in the echo dot also known as Alexa", "score": 0, "created_utc": 1612732569, "company": "amazon"}, {"body": "Yeahhh face_with_tears_of_joy face_with_tears_of_joy", "score": 0, "created_utc": 1612732552, "company": "amazon"}, {"body": "Laugh now cry later", "score": 0, "created_utc": 1612732171, "company": "amazon"}, {"body": "When will you release season 2 of Alex Rider?", "score": 0, "created_utc": 1612731701, "company": "amazon"}, {"body": "tell me this is already an Alexa skill with ready to read any audiobook? If not let's make this happen!", "score": 0, "created_utc": 1612730733, "company": "amazon"}, {"body": "Whoever came up with the concept of this commercial...she need a raise and a promotion because....THANK YOU!!!", "score": 1, "created_utc": 1612730593, "company": "amazon"}, {"body": "can I buy Toilet Paper with #dogecoin ?", "score": 0, "created_utc": 1612730493, "company": "amazon"}, {"body": "Can you please help me to find out the account using this id , to whom this account is belongs because last 4 month continue I got this message about 129 Deduction charges for prime membership which is not belongs to me. Please help", "score": 2, "created_utc": 1612730443, "company": "amazon"}, {"body": "My Alexa has NEVER been that alluring...just sayin'.", "score": 0, "created_utc": 1612730381, "company": "amazon"}, {"body": "face_with_tears_of_joy face_with_tears_of_joy face_with_tears_of_joy LOL!!! I just realized this was the same line!! They don't want Alexa MBJ to be GREAT! face_with_tears_of_joy", "score": 1, "created_utc": 1612730137, "company": "amazon"}, {"body": "another weekend, ANOTHER missed delivery. Well done! Why am I paying for Prime. Oh, yea... customer service asking me how we should resolve this, infuriating...", "score": 1, "created_utc": 1612729662, "company": "amazon"}, {"body": "I will never own ones of these scary things but that commercial is funny as hell!!!", "score": 0, "created_utc": 1612729618, "company": "amazon"}, {"body": "Amazon lurking on main.", "score": 0, "created_utc": 1612729444, "company": "amazon"}, {"body": "Please refer to Order no. 171-7331453-7348363. Placed an order for 2 Oil factory extra virgin olive oil but received Promace olive oil. I've already complaint the very next day for replacement but till today it is not done. Please reply.", "score": 5, "created_utc": 1612729402, "company": "amazon"}, {"body": "#Rajesh Kumar Signh why are you not giving my prizes", "score": 0, "created_utc": 1612729350, "company": "amazon"}, {"body": "Alexa is a female. Makes no sense", "score": 0, "created_utc": 1612729191, "company": "amazon"}, {"body": "Please do have male voices on #alexa! When can I get it? #SuperBowlCommercials #SuperBowl", "score": 1, "created_utc": 1612729100, "company": "amazon"}, {"body": "Boston Comedian Chris Tabb has a YOUTUBE channel. You can peep all the loud, blue, clean, audience belly laughing, fun, crazy comedy and more to come on the YouTube channel. Yes ALL of it. #Subscribe #Like #Share red_heart U", "score": 0, "created_utc": 1612728824, "company": "amazon"}, {"body": "why does the code for Minecraft Java I just bought not work", "score": 1, "created_utc": 1612728798, "company": "amazon"}, {"body": "#Alexa Contact and the directors &amp; producers of #SisterAct and get me a screen part along side of in #SisterAct4 &amp; please add it to my schedule. #AlexasNewBody perfect fit for me. Lol face_with_tears_of_joy", "score": 1, "created_utc": 1612728785, "company": "amazon"}, {"body": "2/3of my items were stolen out of my order. Video shows that my package was already cut open when driver had it since that one item fell out as he was delivering it. Thank god for the", "score": 1, "created_utc": 1612728761, "company": "amazon"}, {"body": "I really dislike your delivery service. I need to get ready for school, and you had my package out for delivery since 9 am. it's 11pm and it's been delayed jnt tomorrow. stick with FedEx/UPS, y'all clearly don't know how to deliver", "score": 1, "created_utc": 1612728726, "company": "amazon"}, {"body": "Honey, I already ran the sprinklers! grinning_squinting_face grinning_squinting_face", "score": 0, "created_utc": 1612728497, "company": "amazon"}, {"body": "This is hilarious. Never hilarious enough to buy one of these monstrosities. But funny. Are the bitter ass impotent men having amnesia in the comments and crying about how unfair ads are yet?", "score": 8, "created_utc": 1612728430, "company": "amazon"}, {"body": "Thank u I finally found Winnie the Pooh plush on your site", "score": 0, "created_utc": 1612728335, "company": "amazon"}, {"body": "I'm tryna see who the dark skinned woman is in the ad is because she's gorgeous smiling_face_with_heart-eyes smiling_face_with_heart-eyes smiling_face_with_heart-eyes smiling_face_with_heart-eyes", "score": 0, "created_utc": 1612728331, "company": "amazon"}, {"body": "I think you're onto something here... make this happen! drooling_face smiling_face_with_heart-eyes", "score": 0, "created_utc": 1612728175, "company": "amazon"}, {"body": "Please good life choosing everyone, God helping this coronavirus and everything", "score": 0, "created_utc": 1612728087, "company": "amazon"}, {"body": "Here's what to expect from post-#SuperBowl performance at #BigConcertSmallBiz black female small business owner in Ohio and are struggling with COVID. Donley powerwashing and landscaping LLc. Please support our business. We are drowning in debt.", "score": 0, "created_utc": 1612727865, "company": "amazon"}, {"body": "thanks for sending to brighten up my evening! #score #BestCommercial", "score": 0, "created_utc": 1612727841, "company": "amazon"}, {"body": "First a verified pizza influencer and then the biggest company in the world is replying to you.", "score": 37, "created_utc": 1612727764, "company": "amazon"}, {"body": "I concur.", "score": 0, "created_utc": 1612727421, "company": "amazon"}, {"body": "wait can I get a brand deal Mr. Bezos????", "score": 0, "created_utc": 1612727411, "company": "amazon"}, {"body": "SELLING EXTRA PS5 (DISC EDITION) IF ANYONE NEEDS HIT MY DM , FIRST COME FIRST SERVED red_heart Thank you folded_hands_light_skin_tone", "score": 1, "created_utc": 1612727402, "company": "amazon"}, {"body": "Brent*", "score": 3, "created_utc": 1612727333, "company": "amazon"}, {"body": "There's a lot to love, more than meets the eye!", "score": 30, "created_utc": 1612727327, "company": "amazon"}, {"body": "a multi million dollar company gave me a $30 credit after I told them that a DELIVERY DRIVER ENTERED MY fkn home A credit worth LESS then what I spent on that delivery", "score": 2, "created_utc": 1612727284, "company": "amazon"}, {"body": "And i can't buy from amazon cuz you wont accept my doge.", "score": 0, "created_utc": 1612727180, "company": "amazon"}, {"body": "hello everyone, sorry if you wish would you like to open the link below, i need your help, thank you. pleading_face folded_hands_light_skin_tone", "score": 0, "created_utc": 1612727096, "company": "amazon"}, {"body": "do it because I need these face_with_steam_from_nose face_with_steam_from_nose face_with_steam_from_nose face_with_steam_from_nose face_with_steam_from_nose face_with_steam_from_nose face_with_steam_from_nose", "score": 1, "created_utc": 1612726819, "company": "amazon"}, {"body": "my order states you're sorry for missing the delivery window but it's still coming tonight???. It's 10 38pm? If it's the snow we are cool with that but update the tracking please.", "score": 1, "created_utc": 1612726795, "company": "amazon"}, {"body": "Amazon wins again! Amazon Alexa had the best Super Bowl LV commercial. Imagine if you could like avatar your own Alexa robot. I wouldn't be surprise in the future. It'll probably be like a robotic hologram. Thats a good idea... And Michael B. Jordan a heck of an actor period .", "score": 0, "created_utc": 1612726776, "company": "amazon"}, {"body": "When do we get the Male version of this with", "score": 0, "created_utc": 1612726730, "company": "amazon"}, {"body": "LOVED this commercial !!!", "score": 0, "created_utc": 1612726635, "company": "amazon"}, {"body": "had the best #SuperBowlLV commercial w/ until came w/ the ULTIMATE with star-struck clapping_hands_medium_skin_tone red_apple growing_heart raising_hands_medium_skin_tone smiling_face_with_heart-eyes heart_exclamation heart_exclamation", "score": 0, "created_utc": 1612726625, "company": "amazon"}, {"body": "I think u won the Superbowl (ads) trophy", "score": 0, "created_utc": 1612726624, "company": "amazon"}, {"body": "Check out my latest article Furniture Sellers and E-Commerce via", "score": 0, "created_utc": 1612726622, "company": "amazon"}, {"body": "I just want to SHOUT OUT Amazon workers in Aurora Colorado for their EXCELLENT service, before, during and after the most challenging year ever to occur in my 64 years! THANK YOU!!", "score": 0, "created_utc": 1612726584, "company": "amazon"}, {"body": "Online shopping from a great selection at Black Celebration Month Store.", "score": 0, "created_utc": 1612726506, "company": "amazon"}, {"body": "Great, now talk about how you're going to support the unionization efforts of your Bessemer FC employees. Talk about the anti-Union suppression and harassment of those workers.", "score": 1, "created_utc": 1612726505, "company": "amazon"}, {"body": "what was this loudly_crying_face", "score": 1, "created_utc": 1612726491, "company": "amazon"}, {"body": "drop your prices on doctor who and fraggle rock blu-rays face_with_steam_from_nose face_with_steam_from_nose face_with_steam_from_nose face_with_steam_from_nose face_with_steam_from_nose face_with_steam_from_nose face_with_steam_from_nose", "score": 2, "created_utc": 1612726467, "company": "amazon"}, {"body": "I wonder if this post would be acceptable if it was a female", "score": 0, "created_utc": 1612726364, "company": "amazon"}, {"body": "Hmm so what I got from this commercial is that 1. You believe black people are superior (\"perfect vessel\") aka racism 2. You don't support body positivity 3. Infidelity is okay. So much for supporting the left. Although #3 and Alexa being a being a women in a man's body is SJW.", "score": 0, "created_utc": 1612726352, "company": "amazon"}, {"body": "Did just Thirst Trap amazon?", "score": 30, "created_utc": 1612726330, "company": "amazon"}, {"body": "Ain't that the truth", "score": 0, "created_utc": 1612726302, "company": "amazon"}, {"body": "Keep it in your pants Amazon", "score": 0, "created_utc": 1612726300, "company": "amazon"}, {"body": "Do You Have An Alexa That Has a Nice Sound And Bass Like #Googlehomemax", "score": 0, "created_utc": 1612726245, "company": "amazon"}, {"body": "THIS won the Super Bowl.", "score": 0, "created_utc": 1612726024, "company": "amazon"}, {"body": "u have 35 minutes", "score": 0, "created_utc": 1612725994, "company": "amazon"}, {"body": "The commerical is the perfect example of why \"red pill\" and MGTOW are growing trends for men.", "score": 1, "created_utc": 1612725987, "company": "amazon"}, {"body": "The best commercial of the night!", "score": 0, "created_utc": 1612725982, "company": "amazon"}, {"body": "y'all wanna full me in???", "score": 1, "created_utc": 1612725919, "company": "amazon"}, {"body": "Top tier commercial this honestly funny af", "score": 0, "created_utc": 1612725843, "company": "amazon"}, {"body": "Very cool", "score": 0, "created_utc": 1612725771, "company": "amazon"}, {"body": "Alexa commercial definitely took my breath away. face_savoring_food", "score": 0, "created_utc": 1612725761, "company": "amazon"}, {"body": "Quit playing with us and give us the Michael B Jordan voice!!!", "score": 0, "created_utc": 1612725726, "company": "amazon"}, {"body": "made me pretty uncomfortable there ....", "score": 0, "created_utc": 1612725707, "company": "amazon"}, {"body": "Genius casting is Alexa personified - Alexa read my audio book! #brandbowl #SuperBowlAds #3percentSB", "score": 4, "created_utc": 1612725700, "company": "amazon"}, {"body": "Please recreate that Michael B. Jordan Alexa commercial with weary_face", "score": 0, "created_utc": 1612725665, "company": "amazon"}, {"body": "I want to close my amazon account.", "score": 1, "created_utc": 1612725648, "company": "amazon"}, {"body": "yes a little too good face_with_tears_of_joy face_with_tears_of_joy face_with_tears_of_joy", "score": 0, "created_utc": 1612725634, "company": "amazon"}, {"body": "used #michaelbjordan so nicely in their spot. Made sense.", "score": 0, "created_utc": 1612725607, "company": "amazon"}, {"body": "#SuperBowl commercial is sexist and racist", "score": 0, "created_utc": 1612725565, "company": "amazon"}, {"body": "can you make it an option for Michael B Jordan to voice Alexa!? Asking for a friend", "score": 1, "created_utc": 1612725561, "company": "amazon"}, {"body": "Thank god we don't objectify men like we do women. Oh wait #feminist #EqualRights #fightforequality", "score": 1, "created_utc": 1612725549, "company": "amazon"}, {"body": "wondering when the edition of the will be on the market? I'd like to preorder mine.", "score": 0, "created_utc": 1612725544, "company": "amazon"}, {"body": "#ParabatThakare #GalaxyS21Quiz I played this interesting Quiz on Amazon-Play games at Amazon FunZone", "score": 0, "created_utc": 1612725543, "company": "amazon"}, {"body": "Does Alexa steal your personal info or just delivery drivers tips?", "score": 1, "created_utc": 1612725537, "company": "amazon"}, {"body": "these commercials are fire . Amazon marking, great job! Buy Cerner", "score": 0, "created_utc": 1612725524, "company": "amazon"}, {"body": "commercial makes makes me SUPER uncomfortable. #itsanofromme", "score": 0, "created_utc": 1612725497, "company": "amazon"}, {"body": "Alexas body with sexy thumbs_up_medium-dark_skin_tone", "score": 0, "created_utc": 1612725496, "company": "amazon"}, {"body": "who ever made your #alexa #SuperBowlCommercials should be shown the door. Wildly off the mark and offensive", "score": 0, "created_utc": 1612725469, "company": "amazon"}, {"body": "troll itself after the its #SuperBowl #ICMKTG #NKU205 #SBAds #brandbowl #adbowl #KelloggBowl #TXAdPrBowl #NKUSBP", "score": 2, "created_utc": 1612725465, "company": "amazon"}, {"body": "past commercials have been smart, creative, fun and great representation of the brand and product features. In a #MeToo era this one was a big miss #SuperBowl", "score": 0, "created_utc": 1612725458, "company": "amazon"}, {"body": "y'all need to add the ability to search and mass edit playlists on amazon music, make it possible to remove something that is only on unlimited bc it's annoying as hell and taking up space on my playlist. I don't wanna have to scroll and read everything on a playlist woman_facepalming_light_skin_tone", "score": 1, "created_utc": 1612725442, "company": "amazon"}, {"body": "did we really need a horny commercial for the new #echo?", "score": 0, "created_utc": 1612725441, "company": "amazon"}, {"body": "with the best commercial..... put your shirt back on rolling_on_the_floor_laughing rolling_on_the_floor_laughing rolling_on_the_floor_laughing rolling_on_the_floor_laughing", "score": 0, "created_utc": 1612725432, "company": "amazon"}, {"body": "Ok. You won. I'm ordering one right now. And no, I don't need cover for my Alexa. smiling_face_with_horns smiling_face_with_horns smiling_face_with_horns", "score": 0, "created_utc": 1612725422, "company": "amazon"}, {"body": "swing and a miss on your commercial.", "score": 0, "created_utc": 1612725404, "company": "amazon"}, {"body": "Best commercial of the night", "score": 0, "created_utc": 1612725403, "company": "amazon"}, {"body": "When the husband says Alexa, turn off the sprinklers! Things are getting way too wet around here! skull skull skull", "score": 0, "created_utc": 1612725384, "company": "amazon"}, {"body": "That commercial JUST went off!! It was HILARIOUS!!", "score": 0, "created_utc": 1612725373, "company": "amazon"}, {"body": "I really like the commercial with Michael b Jordan", "score": 0, "created_utc": 1612725352, "company": "amazon"}, {"body": "Loved the commercial! My favorite grinning_face grinning_face", "score": 0, "created_utc": 1612725303, "company": "amazon"}, {"body": "What solution you have for a repeated complaint against fraudulent tariff plan offered by #CheaterAmazonpay which doesn't exist at all what as explained by #BSNL ?", "score": 1, "created_utc": 1612725268, "company": "amazon"}, {"body": "#OPPOReno5Pro5G I played this interesting Quiz on Amazon-Play games at Amazon FunZone", "score": 0, "created_utc": 1612725224, "company": "amazon"}, {"body": "You open the garage and we'll drive the car. winking_face", "score": 18, "created_utc": 1612725224, "company": "amazon"}, {"body": "Best commercial EVER", "score": 0, "created_utc": 1612725215, "company": "amazon"}, {"body": "She has only smooth round body, we know.", "score": 0, "created_utc": 1612725181, "company": "amazon"}, {"body": "give me this Alexa and I promise to become a Prime lifer backhand_index_pointing_down_medium-light_skin_tone", "score": 0, "created_utc": 1612725171, "company": "amazon"}, {"body": "Amazon, give us the Michael B. Jordan Echo!!!", "score": 0, "created_utc": 1612725111, "company": "amazon"}, {"body": "Literally you face_with_tears_of_joy face_with_tears_of_joy face_with_tears_of_joy", "score": 0, "created_utc": 1612725109, "company": "amazon"}, {"body": "But she thinks that she is beautiful", "score": 0, "created_utc": 1612725092, "company": "amazon"}, {"body": ".. Yall need to warn people when you're going to show with no shirt on!! My boyfriend was in the room flushed_face", "score": 0, "created_utc": 1612725087, "company": "amazon"}, {"body": "where do I place my order to get one of these??? smiling_face_with_hearts", "score": 0, "created_utc": 1612725076, "company": "amazon"}, {"body": "That's what she said.", "score": 0, "created_utc": 1612725064, "company": "amazon"}, {"body": "how do I order the Michael B. Jordan alexa device? Asking for a friend grinning_face_with_sweat", "score": 0, "created_utc": 1612725056, "company": "amazon"}, {"body": "The best commercial of the night", "score": 8, "created_utc": 1612725038, "company": "amazon"}, {"body": "and are humanizing big tech for younger generations, the way banks and telecom couldn't with the demo at the time. Day 1 from Bezos means focusing on Gen Z #Marketingtwitter #SuperBowlad #adtwitter", "score": 1, "created_utc": 1612725027, "company": "amazon"}, {"body": "I would like to upgrade my Alexa to the Michael B. Jordan version please", "score": 2, "created_utc": 1612725016, "company": "amazon"}, {"body": "has just won. All the commercials.", "score": 0, "created_utc": 1612725007, "company": "amazon"}, {"body": "Okay but can we get this man to be my Alexa eyes also Michael love your performance in #genlock #Alexa #Amazon #SuperBowl", "score": 0, "created_utc": 1612725005, "company": "amazon"}, {"body": "I need that #alexa ! Please read to me! #SuperBowl #mahomes #Amazon", "score": 0, "created_utc": 1612725000, "company": "amazon"}, {"body": "Bad services", "score": 0, "created_utc": 1612724985, "company": "amazon"}, {"body": "Very bad service", "score": 2, "created_utc": 1612724985, "company": "amazon"}, {"body": "and their Alexa commercial with was hilarious! 5/5 #UofSCAdPoll", "score": 0, "created_utc": 1612724984, "company": "amazon"}, {"body": "I need THAT #alexa #alexanewbody #SuperBowlCommercials", "score": 0, "created_utc": 1612724980, "company": "amazon"}, {"body": "Alexa fire fire fire Finally, from woman's POV. Props to Black cast, Black lead, Female lead...and personifying Alexa in an entertaining way. #3PercentSB #SuperBowl #Ads", "score": 103, "created_utc": 1612724975, "company": "amazon"}, {"body": "Hahahahaha I just watched it about 10 seconds ago", "score": 0, "created_utc": 1612724967, "company": "amazon"}, {"body": "just sealed the deal with the best #SuperBowlCommercial where's the female Alexa? rolling_on_the_floor_laughing rolling_on_the_floor_laughing rolling_on_the_floor_laughing rolling_on_the_floor_laughing loudly_crying_face loudly_crying_face", "score": 0, "created_utc": 1612724962, "company": "amazon"}, {"body": "I love you. But what was that? #bluebadge #bluebadgelife #amazonlife #alumni #amazonalumni", "score": 0, "created_utc": 1612724956, "company": "amazon"}, {"body": "Such an interesting commercial", "score": 0, "created_utc": 1612724955, "company": "amazon"}, {"body": "I wonder if Alexa became the robot human lookin... thinking_face", "score": 0, "created_utc": 1612724955, "company": "amazon"}, {"body": "Just said Alexa, I liked your commercial and she went on to tell me what a commercial was. Missed opportunity big one!!", "score": 2, "created_utc": 1612724953, "company": "amazon"}, {"body": "just won BEST SUPERBOWL COMMERCIAL!! rolling_on_the_floor_laughing face_with_tears_of_joy rolling_on_the_floor_laughing NOT EVEN FOR MICHAEL B JORDAN!! I ENJOYED THE INNUENDO AND CLEVER WORDING rolling_on_the_floor_laughing rolling_on_the_floor_laughing face_with_tears_of_joy", "score": 0, "created_utc": 1612724947, "company": "amazon"}, {"body": "Can I have that Alexa? Sign me up!", "score": 0, "created_utc": 1612724942, "company": "amazon"}, {"body": "please please please figure out a way to put in my home. Please.", "score": 0, "created_utc": 1612724942, "company": "amazon"}, {"body": "\"Alexa stop, things are getting way too wet around here\". lol", "score": 0, "created_utc": 1612724940, "company": "amazon"}, {"body": "what was that commercial? Infidelity is OK?", "score": 2, "created_utc": 1612724939, "company": "amazon"}, {"body": "I have never in history received a delivery from your lasership. Yet again lost or your driver is dead in a ditch.", "score": 1, "created_utc": 1612724936, "company": "amazon"}, {"body": "Best commercial of the year", "score": 2, "created_utc": 1612724932, "company": "amazon"}, {"body": "WHAT I GOTTA DO TO GET THAT ALEXA??????", "score": 0, "created_utc": 1612724929, "company": "amazon"}, {"body": "will now be fucking all your wives for only 14.99/mo", "score": 0, "created_utc": 1612724920, "company": "amazon"}, {"body": "plans to sell a lot of Alexa devices.....to the ladies. Lucky Generals &amp; Hungry Man went not so subtle here. Disclaimer You should not take your Alexa in to the bath tub. Also -- good luck getting Michael B. Jordan in to your tub. Cue the sprinklers. #AlexasNewBody", "score": 0, "created_utc": 1612724918, "company": "amazon"}, {"body": "#Alexa #ad coming in at the last minute with a win. #SuperBowl #Commercials", "score": 1, "created_utc": 1612724917, "company": "amazon"}, {"body": "y'all really fucked up in that ad. Sexualizing #Alexa? No wonder this country is so fucked up.", "score": 0, "created_utc": 1612724917, "company": "amazon"}, {"body": "Alexa Ad always nailed it! clapping_hands_medium-light_skin_tone clapping_hands_medium-light_skin_tone clapping_hands_medium-light_skin_tone #SuperBowl", "score": 0, "created_utc": 1612724916, "company": "amazon"}, {"body": "IROBOT COMING SOON", "score": 0, "created_utc": 1612724911, "company": "amazon"}, {"body": "Wow that suckdd", "score": 2, "created_utc": 1612724910, "company": "amazon"}, {"body": "I DEMAND THAT YOU REPLACE MY ALEXA WITH MICHAEL B JORDAN RIGHT NOWWWWW weary_face weary_face weary_face weary_face weary_face weary_face weary_face", "score": 0, "created_utc": 1612724906, "company": "amazon"}, {"body": "poor taste of a commercial! Actually disgusting", "score": 0, "created_utc": 1612724899, "company": "amazon"}, {"body": "Alexa, you win.", "score": 0, "created_utc": 1612724899, "company": "amazon"}, {"body": "Alexa on that #wap", "score": 0, "created_utc": 1612724893, "company": "amazon"}, {"body": "Umm, I think there's a pandemic going on. Couldn't figure out how to do the Michael B. Jordan spot with social distancing?", "score": 0, "created_utc": 1612724891, "company": "amazon"}, {"body": "wtf was that commercial with", "score": 1, "created_utc": 1612724890, "company": "amazon"}, {"body": "can we make that #alexa dream come true? #SuperBowl", "score": 1, "created_utc": 1612724890, "company": "amazon"}, {"body": "nice commercial about cheating #morons", "score": 0, "created_utc": 1612724885, "company": "amazon"}, {"body": "Wtf? Disgusting", "score": 1, "created_utc": 1612724882, "company": "amazon"}, {"body": "Fact Michael B. Jordan's father is Michael A. Jordan.", "score": 0, "created_utc": 1612724878, "company": "amazon"}, {"body": "that was good #Alexa #SuperBowlLV", "score": 0, "created_utc": 1612724878, "company": "amazon"}, {"body": "what did I just watch?", "score": 0, "created_utc": 1612724873, "company": "amazon"}, {"body": "GO TO HORNY JAIL AMAZON!", "score": 3, "created_utc": 1612724871, "company": "amazon"}, {"body": "Go fuck yourself", "score": 0, "created_utc": 1612724868, "company": "amazon"}, {"body": "that commercial was a little much", "score": 0, "created_utc": 1612724868, "company": "amazon"}, {"body": "So does this mean I can change her voice to Michael B Jordan? eyes", "score": 0, "created_utc": 1612724867, "company": "amazon"}, {"body": "Infidelity? That's your bid?", "score": 1, "created_utc": 1612724866, "company": "amazon"}, {"body": "Alexa commercial wins. Hands down #SuperBowl", "score": 0, "created_utc": 1612724866, "company": "amazon"}, {"body": "#alexa commercial with rolling_on_the_floor_laughing rolling_on_the_floor_laughing rolling_on_the_floor_laughing grinning_squinting_face yes!", "score": 0, "created_utc": 1612724864, "company": "amazon"}, {"body": "Alexa, add white wine to my shopping list. #datenight", "score": 4, "created_utc": 1612724854, "company": "amazon"}, {"body": "Love it! Lol", "score": 0, "created_utc": 1612724851, "company": "amazon"}, {"body": "and win the night", "score": 0, "created_utc": 1612724849, "company": "amazon"}, {"body": "FINALLY", "score": 0, "created_utc": 1612724845, "company": "amazon"}, {"body": "No. Stupid &amp; not funny.", "score": 3, "created_utc": 1612724844, "company": "amazon"}, {"body": "- \"Things are getting way too wet around here!\" There's no such thing as TOO WET. Am I right #WAP #alexa #alexasbody #superbowlad", "score": 3, "created_utc": 1612724844, "company": "amazon"}, {"body": "I love the commercial so much", "score": 0, "created_utc": 1612724842, "company": "amazon"}, {"body": "Hilarious", "score": 0, "created_utc": 1612724841, "company": "amazon"}, {"body": "Damn let the commercial finish first face_with_tears_of_joy", "score": 4, "created_utc": 1612724839, "company": "amazon"}, {"body": "It's on!!!", "score": 1, "created_utc": 1612724819, "company": "amazon"}, {"body": "is wild af for this commercial rolling_on_the_floor_laughing", "score": 0, "created_utc": 1612724809, "company": "amazon"}, {"body": "Every time this ad pops up on YouTube, I watch it through to the end. I've never done that with a YouTube ad.", "score": 0, "created_utc": 1612724392, "company": "amazon"}, {"body": "Put more devices in your house to spy on you! No Thank You!", "score": 0, "created_utc": 1612724338, "company": "amazon"}, {"body": "Huge if true.", "score": 52, "created_utc": 1612724289, "company": "amazon"}, {"body": "When does the ad air?", "score": 1, "created_utc": 1612724265, "company": "amazon"}, {"body": "This isn't wheel of time I don't give a fuck", "score": 0, "created_utc": 1612724091, "company": "amazon"}, {"body": "Skynet can't feel her face because she doesn't have one", "score": 0, "created_utc": 1612724076, "company": "amazon"}, {"body": "Stop taking driver's TIPA", "score": 0, "created_utc": 1612724005, "company": "amazon"}, {"body": "Alexa, put this one in my shopping cart....now!", "score": 0, "created_utc": 1612723695, "company": "amazon"}, {"body": "WHY haven't my items shipped yet???", "score": 1, "created_utc": 1612723683, "company": "amazon"}, {"body": "- What's happening with your delivery in NYC? Days with no delivery slots available?", "score": 2, "created_utc": 1612723567, "company": "amazon"}, {"body": "IDK who delivered my packages this afternoon but THANK YOU for knocking!!!!", "score": 0, "created_utc": 1612723340, "company": "amazon"}, {"body": "holy crap y'all's suck at shipping cat food. Every time it comes in a bag we know we need to go through them, find the half that burst, and then get you to replace them. man_facepalming_light_skin_tone Use boxes!", "score": 1, "created_utc": 1612723292, "company": "amazon"}, {"body": "Nice highjack", "score": 0, "created_utc": 1612723277, "company": "amazon"}, {"body": "#Chandan #AmazoneFunzoneSlots I won", "score": 2, "created_utc": 1612723164, "company": "amazon"}, {"body": "Eat shit. And let your employees unionize.", "score": 2, "created_utc": 1612723027, "company": "amazon"}, {"body": "#AmazoneFunezoneSlote #AmazonPlayer #AmazonSpinandWin #Chandan I won #AmazonValentine", "score": 4, "created_utc": 1612722986, "company": "amazon"}, {"body": "Why are your customer service policies so bad?", "score": 1, "created_utc": 1612722946, "company": "amazon"}, {"body": "- you better be paying extra $$s to your Twitter team today. They are on POINT! Touchdown after Touchdown. #SuperBowl #nfl #NFLPlayoffs", "score": 2, "created_utc": 1612722916, "company": "amazon"}]}