{"data": [{"body": "why you make it so hard to report scammers? #facebook #scam #treasury", "score": 0, "created_utc": 1612839704, "company": "facebook"}, {"body": "needs to die off. Trying to spread correct information on Facebook is like trying to convince Qanon people on Parler(when it was active) to come on over and vote down the middle for Joe. It's a lost cause and maybe it's not the internet itself that's the problem ", "score": 1, "created_utc": 1612839608, "company": "facebook"}, {"body": "Could someone explain to me why my Facebook account was randomly disabled this morning because of community guidelines?? I have not broken any guidelines as I only post from time to time and most of these are birthday posts and the random photo every now and then.", "score": 0, "created_utc": 1612839557, "company": "facebook"}, {"body": "Creator studio for Instagram has been down for a couple of days , I don't want to post in low quality from my phone, is there any solution to this problem ? When I enter my account info (yes it's correct) I get a 400 error when attempting to login.", "score": 0, "created_utc": 1612839268, "company": "facebook"}, {"body": "why did you just deactivate my wifes Instagram account for deleting people this is a craft page which has been helping her and others during lockdown, should I put a racist tweet/post up and not get deleted/deactivated #doublestandards #pleasereactivate", "score": 2, "created_utc": 1612838796, "company": "facebook"}, {"body": "You people arent doing shit, just a bunch of fluff to make yourselves look good person_shrugging", "score": 0, "created_utc": 1612838781, "company": "facebook"}, {"body": "says \"your move\" #bitcoin #ElonMusk #crypto #fintech #defi #binance #coinbase #blockchain #DigitalTransformation $btc $eth $bnb $ltc $xrp $dot $uni $sxp $xvs $hard $doge $usdt $busd $usdc $vai $aave $kava $pols $cake $sushi", "score": 0, "created_utc": 1612838668, "company": "facebook"}, {"body": "banned the English-language account of the Institute of National Remembrance on February 6. The reason was a post from several months ago discussing #German plans to Germanise #Polish children during #WorldWarII. #Poland More", "score": 1, "created_utc": 1612838574, "company": "facebook"}, {"body": "do you know how to deal with this. Get this taken care of immediately #TigrayGenocide", "score": 0, "created_utc": 1612838194, "company": "facebook"}, {"body": "sir plz help me with my Facebook account", "score": 0, "created_utc": 1612837823, "company": "facebook"}, {"body": "i have been locked out my account with the address . I am not able to resolve this issue on your website because apparently facebook thinks i am a fake. Help me resolve this please.", "score": 0, "created_utc": 1612837760, "company": "facebook"}, {"body": "I would just like to inquire, is there a feature in messenger that a certain photo will be uploaded in stories AFTER 24 hours? I only know that stories will be posted FOR 24 hours but haven't heard it posted AFTER 24 hours.", "score": 0, "created_utc": 1612837341, "company": "facebook"}, {"body": "Hey Facebook Team, our IGTV channel has been hacked. The hacker has changed email address and phone number associated with this. We emailed you the details also. Please help and this is disturbing our community.", "score": 1, "created_utc": 1612835496, "company": "facebook"}, {"body": "I am trying desperately to reach support but nobody is getting back to me my business page will not display on anything other than the mobile app, I desperately need this resolved and have been trying for over a month now but nobody has contacted me, please contact me.", "score": 2, "created_utc": 1612835227, "company": "facebook"}, {"body": "testing a new option which would enable Reels creators to gain more audience by sharing their Reels to Facebook Watch. Find out more now from #socialmediatuesday #digitalmarketing #socialmedia #brands", "score": 0, "created_utc": 1612834723, "company": "facebook"}, {"body": "Hi, there. If you're having trouble logging in, please visit our Help Center for troubleshooting tips -RM (via Twitter", "score": 0, "created_utc": 1612834182, "company": "facebook"}, {"body": "Myanmar police kill peaceful protesters with gun. Here is his photo. Most likely he is ex-military officer. Shame on military coup.", "score": 0, "created_utc": 1612834077, "company": "facebook"}, {"body": "how long does it take for someone to get access to their account back? Sent in my ID almost 3 weeks ago and haven't heard anything?", "score": 0, "created_utc": 1612833975, "company": "facebook"}, {"body": "your reporting function is not fit for purpose. I've seen a post that is in breech of the definition of anti-semitism and yet cannot report due to the dumb drop down options &amp; given that your team can't read or spot it, it's getting rejected. of interest?", "score": 0, "created_utc": 1612833608, "company": "facebook"}, {"body": "please can someone help me.", "score": 0, "created_utc": 1612833189, "company": "facebook"}, {"body": "is bad for #Democracy", "score": 0, "created_utc": 1612832327, "company": "facebook"}, {"body": "banned the English-language account of the on February 6. The reason was a post from several months ago discussing #German plans to Germanise #Polish children during World War II. More", "score": 0, "created_utc": 1612831834, "company": "facebook"}, {"body": "Page created by me, I'm the owner. I set someone as manager who I thought I trusted, but he changed my executive authority to an analyst. I want my management back. A reference number is #2542001836094167", "score": 0, "created_utc": 1612831376, "company": "facebook"}, {"body": "Child abuse and Racism = Yes. Cow in a field = No.", "score": 0, "created_utc": 1612831184, "company": "facebook"}, {"body": "can y'all unbloc my page please lol", "score": 0, "created_utc": 1612830871, "company": "facebook"}, {"body": "hey there i am trying to file a review but fb is not accepting it &amp; give me the message about the covid bla bla situation and it's almost a 6month now and i cant get my account back or a rely or a ticket! #facebookdisabledme i need somebody to talk to!", "score": 2, "created_utc": 1612830427, "company": "facebook"}, {"body": "I'd like to complain about the treatment I'm receiving from your platform. I swear once and get a 30 day yet people can share hate filled propaganda freely.", "score": 0, "created_utc": 1612830350, "company": "facebook"}, {"body": "hey there i am trying to file a review but fb is not accepting it &amp; give me the message about the covid bla bla situation and it's almost a 6month now and i cant get my account back or a rely or a ticket!", "score": 0, "created_utc": 1612830255, "company": "facebook"}, {"body": "can you imagine getting banned from Facebook for having an opinion on someone who held someone at knife point and got shot. How can you ban someone for freedom of speech. #FacebookIsStupid", "score": 0, "created_utc": 1612829805, "company": "facebook"}, {"body": "Why is your web app broken? Click notifications? Zuck please fix!! #Facebook #socialmedia", "score": 0, "created_utc": 1612829504, "company": "facebook"}, {"body": "Need a help! Nobody answering in the help center loudly_crying_face loudly_crying_face loudly_crying_face broken_heart", "score": 0, "created_utc": 1612828384, "company": "facebook"}, {"body": "Why do you make it so difficult to report fake profiles? There's no room to leave any clarification/background information, and the standard response is always This doesn't go against any of our Community Standards even though I'm trying to report an actual scammer.", "score": 0, "created_utc": 1612828252, "company": "facebook"}, {"body": "just refuses to accept that I said \"NO\" and still send notifications to me about downloading the windows messenger version, I don't want that so I say \"NO\" - next week the dam thing is back. #badmarketing", "score": 0, "created_utc": 1612828156, "company": "facebook"}, {"body": "why can't I deactivate my messenger?", "score": 0, "created_utc": 1612827932, "company": "facebook"}, {"body": "support channel for changing the name of a page is quite possibly the worst customer service exchange I've ever experienced in my life", "score": 0, "created_utc": 1612827595, "company": "facebook"}, {"body": "Sorry to bother. Account got hacked on 01/28, in good standing before then for over 10yrs. Support won't respond. I have family and friends on there that are no longer with us... I really don't want to lose this acct. Please help if you can (", "score": 4, "created_utc": 1612827348, "company": "facebook"}, {"body": "Hi, My account was disabled for no reason and incorrectly. I am contacting my local lawyers and they will be looking into how you handle your business practice. Please correct immediately before we step toward legal ramifications", "score": 2, "created_utc": 1612826629, "company": "facebook"}, {"body": "y'all and Mark are a bitch.", "score": 0, "created_utc": 1612826244, "company": "facebook"}, {"body": "what is wrong with your #securitysystem what is wrong with your #support team ? It's not even possible to recover an account which was logged out just 5 min back. It is a stupid loop which ends nowhere. How are we suppose to use it ?", "score": 0, "created_utc": 1612825152, "company": "facebook"}, {"body": "is a POS app. Someone says racist shit i report. Doesnt go against standards, i call them a cunt....i am restricted 30 days lol.. man_facepalming_medium_skin_tone someone make a new social media app please", "score": 0, "created_utc": 1612825060, "company": "facebook"}, {"body": "I defended someone that was being attacked and humiliated for posting about a place to rent on #Facebook. You let all the nasty comments on, but restricted my account for defending him. Your #communitystandards team can't tell what is hate and what it's not", "score": 0, "created_utc": 1612824702, "company": "facebook"}, {"body": "to use it's as a low budget Android alternative to !", "score": 0, "created_utc": 1612824698, "company": "facebook"}, {"body": "I said nawty things about racists in general and I catch a 3 day ban ~ meanwhile, it's okay for profiles to directly call me a retard, libtard and tell me the world would be better off if I were dead. You've got buggered up priorities. woman_shrugging_light_skin_tone", "score": 0, "created_utc": 1612824292, "company": "facebook"}, {"body": "I want verification on one of my official pages how it", "score": 1, "created_utc": 1612823480, "company": "facebook"}, {"body": "where has my recent news feed option gone? I've been commenting on 4 day old stuff", "score": 0, "created_utc": 1612823038, "company": "facebook"}, {"body": "SOS SOS SOS Please help us end military dictatorships Myanmar/Burma by taking down MRTV &amp; Tatmadaw News Agency Facebook page to stop them from spreading false information for illegitimate military regime. We need you!!!", "score": 1, "created_utc": 1612823034, "company": "facebook"}, {"body": ", seriously do you think this page is not impersonating me??? Photo 1. My Page. Photo 2. Fake Page Photo 3. I'm denied. They are scamming my followers out of $1,000's with numerous accounts and there's nothing you'll do? #FacebookHelp #Scam", "score": 0, "created_utc": 1612822686, "company": "facebook"}, {"body": "the only app that blocks you for getting harassed . Fuck y'all", "score": 0, "created_utc": 1612821623, "company": "facebook"}, {"body": "Hii sir i have a great idea which can boost whole Facebook inc over 40% hike Contact me - 7440961156. We can be world no.1 in market cap. Deal for 0.5% of whole Facebook inc stake. I will work there...", "score": 0, "created_utc": 1612821494, "company": "facebook"}, {"body": "Seems the only way to get account back these days are hackers. Really you guys? Just help me out! #facebookdisabledme #facebooklogout", "score": 2, "created_utc": 1612821482, "company": "facebook"}, {"body": "will you please accept #dogecoin as a form of payment? #DogecoinRise #DOGE #Dogecoinarmy", "score": 2, "created_utc": 1612820922, "company": "facebook"}, {"body": "The Facebook algorithm is going haywire. You're still allowing hate speech towards trans, gays and women, even suggestions of suicide, but giving out mutes for words like turnip potato and idiot. Do something, you turnip!", "score": 0, "created_utc": 1612820417, "company": "facebook"}, {"body": "fake ads &amp; #scams continue. We are receiving emails &amp; calls for confirmation as #fraudsters are asking money from people who are approaching them after interacting with these #fake ads. Reporting of ads doesn't help. What can you do?", "score": 3, "created_utc": 1612820082, "company": "facebook"}, {"body": "you don't even have a way to contact you to dispute what was your post and your intentions of posting it", "score": 0, "created_utc": 1612819527, "company": "facebook"}, {"body": "wow, maybe you are racist", "score": 0, "created_utc": 1612819447, "company": "facebook"}, {"body": "Under which category this post should be reported for violating community standards where some idiot is mocking an Indian politician for his physical disability? Asking this because when reported FB finds no wrong.", "score": 0, "created_utc": 1612819347, "company": "facebook"}, {"body": "eveytime a friend post about trump and his cruelty they jus give you an option to watch and block the video unless you click it, but if say I dislike what Candice Owens stands for I get put in Facebook jail", "score": 0, "created_utc": 1612819342, "company": "facebook"}, {"body": "why do you hate black voices, don't are first amendment matter too? I need answers", "score": 0, "created_utc": 1612819152, "company": "facebook"}, {"body": "put black people in Facebook jail for no reason", "score": 0, "created_utc": 1612819087, "company": "facebook"}, {"body": "has cool peeps with picks but sucks big time re anything else Dina Soar rolling_on_the_floor_laughing hugging_face", "score": 0, "created_utc": 1612818948, "company": "facebook"}, {"body": "never bands white people for anything", "score": 0, "created_utc": 1612818733, "company": "facebook"}, {"body": "You've got to do something about fixing disabled accounts, especially when people provide ID! I've been disabled for a week....it's unfair when some people have been waiting for months. Covid has been going on a year, you can't use that as your excuse anymore. Fix it!", "score": 2, "created_utc": 1612818304, "company": "facebook"}, {"body": "You've got to do something about fixing disabled accounts, especially when people provide ID! I've been disabled for a week....it's unfair when some people have been waiting for months. Covid has been going on a year, you can't use that as your excuse anymore. Get it together!", "score": 0, "created_utc": 1612818204, "company": "facebook"}, {"body": "my IG was hacked and I want it back", "score": 10, "created_utc": 1612817977, "company": "facebook"}, {"body": "why are you guys not helpin with there support team people need help and knot gettin responses", "score": 0, "created_utc": 1612817953, "company": "facebook"}, {"body": "kindly resolve my issue. I am unable to login. Why this problem has came?", "score": 0, "created_utc": 1612817809, "company": "facebook"}, {"body": "Why can't you fix account? She's a major figure in this pandemic so of course she's a major target too. She's been hacked. There's no report button. We need our local epidemiologist back.", "score": 3, "created_utc": 1612817801, "company": "facebook"}, {"body": "so someone makes a comment at me on your platform telling me to kill myself and i get a ban for standing up for myself #facebook hypocrites", "score": 0, "created_utc": 1612817578, "company": "facebook"}, {"body": "and the American media; In America you could criticize any government, even your own government! but you can't criticize Israel? Isn't this biased? Didn't you do the same with South Africa when it was an apartheid regime? and you called Nelson Mandela a terrorist too!", "score": 1, "created_utc": 1612816874, "company": "facebook"}, {"body": "Who is your tutor when it comes to #censorship ? Is it the #CCPChina or are you inspired by the #Nazi #gestapo? face_with_rolling_eyes thinking_face #vaccination. There are not many #Facts. One is, that we know pretty much nothing about. It's all #Believe. And we still have freedom of belief. Right?", "score": 0, "created_utc": 1612816844, "company": "facebook"}, {"body": "is Create Post broken on business pages? Tried clearing cookies/storage. Safari 14 Mac.", "score": 0, "created_utc": 1612816808, "company": "facebook"}, {"body": "So let me get this straight! In America you could criticize any government, or official in the entire world, even your own government! but you can't criticize Israel? Isn't this biased? Facebook, stop being Israel's bitch!", "score": 0, "created_utc": 1612816608, "company": "facebook"}, {"body": "Squirrel", "score": 0, "created_utc": 1612816461, "company": "facebook"}, {"body": "So let me get this straight! In America you could criticize any government, or official in the entire world, even your own government! but you can't criticize Israel? Isn't this biased? Facebook, stop being Israel's bitch!", "score": 0, "created_utc": 1612816205, "company": "facebook"}, {"body": "what's wrong with your APP? Everytime I create a post with multiple medias EVERY edit is erased when I click DONE. Shaking my phone didn't address my issue. I would use my browser if you didn't limit it! What's the matter not making enough money selling private info?", "score": 0, "created_utc": 1612816147, "company": "facebook"}, {"body": "what the heck is going on with the hacking that's taking place? A lot of accounts are being hacked lately, many of my friends accounts have been hacked. Get involved and solve this ASAP", "score": 4, "created_utc": 1612816023, "company": "facebook"}, {"body": "please help me with my account!! Puhhhlease", "score": 1, "created_utc": 1612814859, "company": "facebook"}, {"body": "so D Damien Gonzalez of Tampa Florida can call me a dummy but I can't call him a _____!", "score": 0, "created_utc": 1612814830, "company": "facebook"}, {"body": "my account is hacked and email mobile no also change .how can i recovered my Id", "score": 10, "created_utc": 1612813644, "company": "facebook"}, {"body": "please check my ID is disabled with no reason ..", "score": 5, "created_utc": 1612813492, "company": "facebook"}, {"body": "I got banned for posting a video of Fat Bastard from Austin Powers. Can you please reverse this?", "score": 0, "created_utc": 1612812766, "company": "facebook"}, {"body": "Sir my instagram account is disabled , i requested many times but it didn't re-activate , its my personal account , i have stored data on it , Due to linked account my fb account is also disabled ,pls reactivate it. insta id- preet_judge_official", "score": 2, "created_utc": 1612812419, "company": "facebook"}, {"body": "will now take down posts claiming #vaccines cause #autism - - About time!", "score": 0, "created_utc": 1612812314, "company": "facebook"}, {"body": "middle_finger_dark_skin_tone disrespectfully", "score": 0, "created_utc": 1612812136, "company": "facebook"}, {"body": "has become absolute trash. How can you let someone hijack a whole thread sharing bigoted shit against trans ppl, but block the person that calls them out for bullying?", "score": 0, "created_utc": 1612811905, "company": "facebook"}, {"body": "my account is disabled and won't be open due to community standards but I can't do anything plsee respond mr facebook because my Facebook account is business account also plse give my account back sir", "score": 5, "created_utc": 1612811820, "company": "facebook"}, {"body": "my account is disabled and won't be open due to community standards but I can't do anything plsee respond mr facebook because my Facebook account is business account also plse give my account back sir", "score": 2, "created_utc": 1612811748, "company": "facebook"}, {"body": "since you suspended me for making a point abt Candace O denial of racism, her own blackness &amp; support of conservative rioters, will you be suspending the rest of the Blk ppl in this thread for making the same point? Who's being hateful you or us? woman_shrugging_medium_skin_tone", "score": 0, "created_utc": 1612811616, "company": "facebook"}, {"body": "my account is disabled and won't be open due to community standards but I can't do anything plsee respond mr facebook because my Facebook account is business account also", "score": 0, "created_utc": 1612811200, "company": "facebook"}, {"body": "makes it nearly impossible to Delete a Facebook Account. And it takes forever and a day to download MY own data files. Ever heard of #dataprivacy This is unacceptable. I hated the movie, also. #IHateFacebook", "score": 0, "created_utc": 1612811146, "company": "facebook"}, {"body": "So my account was disabled overnight, no warning, no email, nothing. I've never had a community guidelines violation EVER, and actually reported several that got removed. How and why is my account disabled? I can't even submit for an appeal.", "score": 0, "created_utc": 1612811111, "company": "facebook"}, {"body": "Zuckerberg is a complete idiot! He's lucky people liked his sham called Facebook", "score": 1, "created_utc": 1612811101, "company": "facebook"}, {"body": "suspended me for saying something about a British twit when he said something far worse. What a fucking joke", "score": 0, "created_utc": 1612811064, "company": "facebook"}, {"body": "I was blocked for a message that was not created by me! I just subscribe and nobody is blocked for saying fucking, fag, I notice! and to me they go 8 times that they block me for nonsense! be more fair! Or is it ... that the government pays you to censor to me?", "score": 0, "created_utc": 1612810862, "company": "facebook"}, {"body": "I've been trying to get access to an old profile I used a UCLA email to open I am an Alumni now so... I was hacked 6 years ago Valessa De La Ville I have no way of getting into it. Please help! I'm not sure what else to do. My emails have gone unanswered for too long.", "score": 10, "created_utc": 1612810786, "company": "facebook"}, {"body": "your new logo looks dumb af", "score": 0, "created_utc": 1612810362, "company": "facebook"}, {"body": "why don't you just go ahead and send out a list of what we cannot say. Might be shorter to just tell us what we CAN say.", "score": 0, "created_utc": 1612809724, "company": "facebook"}, {"body": "My facebook was disabled because someone hacked it. I sent them an ID to prove which of the two accounts was me but I get a message that it is deactivated and can't be reversed. I can't open a new one as it says there is already an account with my email. What do I do?", "score": 8, "created_utc": 1612809494, "company": "facebook"}, {"body": "suspended on for having a conversation with someone, that you falsely deemed bullying. Please reinstate. You are silencing dissent, and it's anything but supporting free expression.", "score": 0, "created_utc": 1612809420, "company": "facebook"}, {"body": "Since last night I have not been able to use my Whatsapp. Why?", "score": 0, "created_utc": 1612809407, "company": "facebook"}, {"body": "please let me talk to somebody via chat, I have lost access to my account because I forgot my password I just reset and dont have access to my old emails. #pleasehelp I can access my account. I can send my government ID. #pleasehelp #facebookhelp", "score": 0, "created_utc": 1612809354, "company": "facebook"}, {"body": "that #MarkZuckerberg JUDGE JURY AND EXECUTIONER OL JUDGE ZUCKERBERG GAVE ME THIRTY DAYS FOR BLACK ON BLACK CRIME YOU DIDNT GIVE THE OFFENSE THIRTY DAYS GAVE ME THIRTY DAYS THOUGH....WE #BEEFING NOW BUDDY!!!!", "score": 0, "created_utc": 1612809143, "company": "facebook"}, {"body": "you have black men speaking about black women and degrading them. I defend them and now im doing too much. I need my acct suspension to be lifted. I need to tell him a thing or two", "score": 0, "created_utc": 1612808964, "company": "facebook"}, {"body": "really sucks at authoritative information", "score": 0, "created_utc": 1612808711, "company": "facebook"}, {"body": "Prove it.", "score": 0, "created_utc": 1612808250, "company": "facebook"}, {"body": "and are no different than old Russia and current China. Disallowing dissension from state ideology. Medical OPINION is just that - opinions yet to be proven or disproved! We live in strange regressive times.", "score": 0, "created_utc": 1612808126, "company": "facebook"}, {"body": "What say you?", "score": 0, "created_utc": 1612807752, "company": "facebook"}, {"body": "Hey #FacebookBusiness #FacebookBusinessSupport #FacebookSupport  my boss and I have been trying to reach y'all via your help pages to no success. The fact that I'm using Twitter to try to get help on Facebook is breaking my brain a bit...but...help? Please?", "score": 0, "created_utc": 1612807729, "company": "facebook"}, {"body": "How do I allow a tag. #Thankyou #HowToAllowATag #WhatToPressToAllowATag #AllowATag #HowToAllowAATag #ThankYou", "score": 0, "created_utc": 1612807697, "company": "facebook"}, {"body": "I couldn't login to my facebook account, please resolve it.", "score": 0, "created_utc": 1612807686, "company": "facebook"}, {"body": "#pro coming soon; you can see who sees you. &lt;#", "score": 0, "created_utc": 1612807679, "company": "facebook"}, {"body": "you gonna coverup the Magdalene Convents next", "score": 0, "created_utc": 1612807550, "company": "facebook"}, {"body": "looks like you were the predominant culprit that day and not Will and deplatform you now? #CapitolRiots", "score": 0, "created_utc": 1612807064, "company": "facebook"}, {"body": "Check your dm ! I sent proof!", "score": 0, "created_utc": 1612806891, "company": "facebook"}, {"body": "Hi, still waiting for a response.", "score": 0, "created_utc": 1612806685, "company": "facebook"}, {"body": "demonetized this article, which is a simple writeup on a news story about DTJ suggesting that he'll primary Liz Cheney in 2022, because it \"depicts or discusses topics that fall into the restricted categories listed in the Content Guidelines for Monetization.\"", "score": 90, "created_utc": 1612806620, "company": "facebook"}, {"body": "why don't you match this? XPRIZE Foundation | Home Page", "score": 0, "created_utc": 1612806361, "company": "facebook"}, {"body": "you are an absolute joke you silence the ones that you don't agree with. You are turning into nazi Germany. Hopefully humptybiden will fall off his wall.", "score": 1, "created_utc": 1612805866, "company": "facebook"}, {"body": "How is it possible that you're allowing this insane level of mis/disinformation? It is DESTROYING our democracy!", "score": 0, "created_utc": 1612805617, "company": "facebook"}, {"body": "is sharing why I got banned for 30 days enough to get banned for another 30 fucking days? Only my friends and family are within my contacts, nobody gets offended when I joke around why do you harass me?", "score": 0, "created_utc": 1612804706, "company": "facebook"}, {"body": "I have been stuck in a loop trying to get the funds sent to my nonprofit, after doing a Facebook birthday fundraiser. We were approved almost a month ago, but no payout has been received. Trying to get answers, has become a full time job. How can I get assistance?", "score": 0, "created_utc": 1612804530, "company": "facebook"}, {"body": "email account for faebook account was hacked 13 days ago. Sent id verification, but no response back other than a message that the info was received. Very concerned to lose my business page. Any help?", "score": 7, "created_utc": 1612804390, "company": "facebook"}, {"body": "WTF is wrong with your dumb ass page, I literally put a screenshot of how you banned me for 30 days and you didi it again because i make fun of it? you PC facist motherfuckers", "score": 0, "created_utc": 1612804193, "company": "facebook"}, {"body": "should help people of #Myanmar by blocking their dsinfo and some page they takeover by coup, MOI web portal, MRTV, that they sue to spread military coup propaganda and crackdown peaceful protest. #militarycoup #WhatIsHappeningInMyanmar #RespectOurVotes", "score": 1, "created_utc": 1612804137, "company": "facebook"}, {"body": "needs to add more reporting options .e.g \"anti vaccination bullshit\" , \"Discredited anti vaccination lies\", \"Anti vaccination scammer\",\"Prolific anti vaccination liar\"", "score": 0, "created_utc": 1612804099, "company": "facebook"}, {"body": "For #NationalinventorsDay (2/11) Check out the #VideoTombstone I invented and a #Book I wrote called Cemetery of Lies. You can see more about them at #Cemeteryoflies #tombstones #digitaltombstone #talkingtombstone", "score": 0, "created_utc": 1612804060, "company": "facebook"}, {"body": "why are y'all allowing this on your platforms?", "score": 0, "created_utc": 1612803272, "company": "facebook"}, {"body": "can someone please explain this?", "score": 0, "created_utc": 1612802701, "company": "facebook"}, {"body": "is the death of democracy backhand_index_pointing_down_medium-light_skin_tone backhand_index_pointing_down_medium-light_skin_tone backhand_index_pointing_down_medium-light_skin_tone backhand_index_pointing_down_medium-light_skin_tone", "score": 0, "created_utc": 1612802157, "company": "facebook"}, {"body": "don't be bullied by aparthied israels bullies into censorship Instead listen to Rabbi Alissa and", "score": 0, "created_utc": 1612801605, "company": "facebook"}, {"body": "one of you cowards explain how i get banned for this yet you dont do jack shit to ppl accusing biden of touching kids Edward Conway says the nutjob that can't spell..durp durp durp", "score": 0, "created_utc": 1612801556, "company": "facebook"}, {"body": "Israel is doing the killing, we are being killed, and when we post about it face book suspends our accounts and calls us antisemitic, so does Israel! Face book, stop being Israel's bitch, stop being biased", "score": 0, "created_utc": 1612801170, "company": "facebook"}, {"body": "turn off public auto mention please!i lots think the bc aymytk mention is there abd you cannot delete it. So annoying!!", "score": 0, "created_utc": 1612800865, "company": "facebook"}, {"body": "Face book, your loyalty should be to America not to Israhell Stop defending the murderers and the Apartheid regime in Israel", "score": 0, "created_utc": 1612800661, "company": "facebook"}, {"body": "#facebook are you serious this is why people leave you or just can't get back on as your app will not accept my proof of my drivers licence or was it because I. Turned of my adds following me", "score": 1, "created_utc": 1612800630, "company": "facebook"}, {"body": "Face book, stop being Israel's bitch!", "score": 3, "created_utc": 1612800517, "company": "facebook"}, {"body": "Thank you Twitter, Shame on you face book! I posted some photos of Palestinians being tortured by Israel, some heartless trolls kept taunting me and kept reacting with laughing emojis to my photos! laughing at a pain of a nation! harassing me! &gt;&gt;&gt;", "score": 1, "created_utc": 1612800429, "company": "facebook"}, {"body": "I have the same issue and I either get redundant codes via SMS or I get no codes whatsoever!! A reply and some actual support and help would be really appreciated thanks", "score": 0, "created_utc": 1612800244, "company": "facebook"}, {"body": "delete and ban users who spread this garbage. And unless you do, you are apart of the problem.", "score": 0, "created_utc": 1612799364, "company": "facebook"}, {"body": "Why did you remove the ability to edit scheduled posts in Business Suite?? Change it back!! Editing posts is a basic functionality.", "score": 0, "created_utc": 1612799044, "company": "facebook"}, {"body": "You all need to be sued for violating your own policies since you all play favorites.", "score": 0, "created_utc": 1612798826, "company": "facebook"}, {"body": "yall are a bunch of communists over there at facebook huh? You all just pick and choose who you ban dont you? I complain about someone harassing me and get ignored. i stick up for myself and get punished for it! wtf communist facebook?!", "score": 0, "created_utc": 1612798603, "company": "facebook"}, {"body": "I have been trying trying to log-in with my account. I have requested change my e-mail and I have received security code in my new e-mail but there's no way to enter it since I can't find where to put it. It's not on my browser. ---", "score": 1, "created_utc": 1612798482, "company": "facebook"}, {"body": "has ruined their advertising platform. What used to be an amazing tool to promote a small business or your real estate listing has now been ruined. With their minimum radius I am in the gta and am now getting ads from realtors in Bruce county for home market evaluation", "score": 0, "created_utc": 1612798346, "company": "facebook"}, {"body": "Hi my old account was mistakenly disabled for no reason well actually it was mistakenly flagged under 13 when I am 18 years old and I have no longer access to the old phone number that was on it I want you to help me get it back I don't have a ID to submit", "score": 6, "created_utc": 1612798238, "company": "facebook"}, {"body": "Curious!! Why CENSURE ! Netflixs, the great hack?", "score": 2, "created_utc": 1612798194, "company": "facebook"}, {"body": "I've had my account over 10 yrs. Why did you disable it? When am I going to get it back???", "score": 2, "created_utc": 1612798180, "company": "facebook"}, {"body": "mfs are on top of their shit lately with banning people grinning_face_with_sweat", "score": 0, "created_utc": 1612798153, "company": "facebook"}, {"body": "needs to fail. #BoycottFacebook", "score": 0, "created_utc": 1612798122, "company": "facebook"}, {"body": "when a southerner calls someone ugly it's not an inference on their looks or lack of looks. It's telling that person they aren't being very nice. It means they're cranky. I'll take your apology now regarding that law of community standards. face_with_rolling_eyes", "score": 0, "created_utc": 1612798069, "company": "facebook"}, {"body": "again, tweeting you to restore an account that was ridiculously suspended. Please read previous tweets. It's obvious you don't want me (because of my political orientation - very communist esque) on your platform.", "score": 0, "created_utc": 1612797793, "company": "facebook"}, {"body": "Thanks to everybody that recommended cybersecurity041 on G with there assistance I was able to get back my disabled business account", "score": 1, "created_utc": 1612797563, "company": "facebook"}, {"body": "wtf? We are disgusted and tired of this bs! Do something about this.", "score": 0, "created_utc": 1612796584, "company": "facebook"}, {"body": "Today my account on Facebook was hacked by someone and tried to retrieve it in any way, but I was unable to ask the management of the Facebook company to communicate with me and recover my account for me #Facebook", "score": 12, "created_utc": 1612796286, "company": "facebook"}, {"body": "dogecoin", "score": 0, "created_utc": 1612796095, "company": "facebook"}, {"body": "do you idiots ever plan on doing something about the fake profiles promoting bitcoin and FX scams? Reporting the profiles are useless as apparently they're following your guidelines.", "score": 0, "created_utc": 1612795813, "company": "facebook"}, {"body": "I had my stars back for 2 streams and you take them away just now WHILE I'M STILL LIVE??? PLEASE SOMEONE CONTACT ME", "score": 0, "created_utc": 1612795700, "company": "facebook"}, {"body": "Can you folks help us access our marketing account? I sent you a DM with details of the issue. Please assist. Thanks.", "score": 0, "created_utc": 1612795570, "company": "facebook"}, {"body": "time to see if you have crypto in your DNA.", "score": 0, "created_utc": 1612795549, "company": "facebook"}, {"body": "I've been contacting your support about problems with a page I manage and I keep getting promised emails with updates and/or resolution of the issue. I have never received a follow up. This has been going for at least two months if not more. Help, please!", "score": 0, "created_utc": 1612795202, "company": "facebook"}, {"body": "really needs a clear all notifications button. I just manually cleared 28 notifications. It doesn't take long it's just annoying and I'm lazy.", "score": 0, "created_utc": 1612795159, "company": "facebook"}, {"body": "Thank u to restictet My account. This is not realted from any violence,this was about humanity n social awareness. You did wrong with me. And thank u to keep eyes on my post.", "score": 0, "created_utc": 1612794823, "company": "facebook"}, {"body": "why have you got rid of the chat heads on android? It's starting to irritated me the fact that I now have to get off an app to reply!?!? pouting_face", "score": 0, "created_utc": 1612794024, "company": "facebook"}, {"body": "pull the trigger on $BTC", "score": 0, "created_utc": 1612793954, "company": "facebook"}, {"body": "fuck you guys. You can't stop me.", "score": 0, "created_utc": 1612793776, "company": "facebook"}, {"body": "OK we're about to have some WORDS! I can't access my groups for the life of me and right now I'm going to TEAR MY HAIR OUT! What internet program (whichever word is right) do I need to use, to get this working correctly?", "score": 0, "created_utc": 1612793272, "company": "facebook"}, {"body": "needs to be taken down. An extraneous site that has taken on dangerous totalitarian principles.", "score": 0, "created_utc": 1612793156, "company": "facebook"}, {"body": "When you guys can take any DISCUSSION, and frame it into something that doesn't fit your community standards, something is very wrong - ESPECIALLY when you don't take down all the anti-Trump folks posts that Trump supporters are all idiots. Literally no difference.", "score": 0, "created_utc": 1612792681, "company": "facebook"}, {"body": "Can someone look into my account suspension? I was suspended for \"bullying/harassment,\" by commenting my opinion that someone has a low EQ/IQ, which I believe is true. My profile - this is NOT harrassment or bullying. It was a simple comment rpl", "score": 0, "created_utc": 1612792621, "company": "facebook"}, {"body": "The Republicans white supremacist who want a slave wage working class every time the minimum wage has gone up it was fear-mongering by Republicans that the economy would collapse and it just never happens", "score": 0, "created_utc": 1612792344, "company": "facebook"}, {"body": "dear Facebook you keep disabling my account. Even though I provide you with a legit phone number that u send a code to that I provide a video of myself or my dl. Then you put in a disclaimer saying due to covid you might not be able to verify the account", "score": 1, "created_utc": 1612792052, "company": "facebook"}, {"body": "Do not let trump back on your platform ever. Thats it thats the tweet #Facebook", "score": 0, "created_utc": 1612791892, "company": "facebook"}, {"body": "Sorry to bother. Account got hacked on 01/28, in good standing before then for over 10yrs. Support won't respond. I have family and friends on there that are no longer here... I really don't want to lose this acct. Please help if you can (", "score": 9, "created_utc": 1612791758, "company": "facebook"}, {"body": "Hunter Biden Continues To Hold Stake In Chinese Private Equity Firm, Records Show, Despite Reports That He Was Planning To Divest", "score": 0, "created_utc": 1612791652, "company": "facebook"}, {"body": "Biden said he did not know his son's business??? He Lied!! Biden is the most corrupt president-elect!! Keep an eye on him! Will he sell the USA to anyone who pays him?", "score": 0, "created_utc": 1612791642, "company": "facebook"}, {"body": "High-tech controls and sells people's info, also rigged elections. They are the terminator of democracy. \" In November 2019, Mark Zuckerberg invited nine civil rights leaders to dinner at his home...\", steps how they arranged and rigged the 2020 election.", "score": 0, "created_utc": 1612791634, "company": "facebook"}, {"body": "so who do I complain to about how you operate your community standards. Or do you want another story like this BBC News - 'Overtly sexual' cow blocked as Facebook ad", "score": 0, "created_utc": 1612791583, "company": "facebook"}, {"body": "The page has been put out of use by the owner and And needs to be taken out of service so no one can use my wife's picture or I will put a .45 acp between your eyes or would you prefer a .380 in each eye.", "score": 0, "created_utc": 1612791143, "company": "facebook"}, {"body": "instagram creator studio is down please fix it!", "score": 2, "created_utc": 1612790973, "company": "facebook"}, {"body": "Who gives a flying middle_finger_light_skin_tone", "score": 0, "created_utc": 1612790969, "company": "facebook"}, {"body": "Go middle_finger_light_skin_tone Yourself FB, you will never silence us zucherbitch!", "score": 0, "created_utc": 1612790948, "company": "facebook"}, {"body": "love #oklahomapimp #oklahomapimpcomic fFacebook app", "score": 0, "created_utc": 1612790839, "company": "facebook"}, {"body": "has become an obedient subservient of Pakistani military cyberteam, which always reports genuine Baloch political activists in #facebook campaign and facebook block them as per their demand and leave Baloch vulnerable to Pakistani military aggression!", "score": 0, "created_utc": 1612790752, "company": "facebook"}, {"body": "what about a new feature to create whatsapp groups using a existing group and you just select the members that you don't want in the new group?", "score": 0, "created_utc": 1612790730, "company": "facebook"}, {"body": "FB &amp; Instagram have the ability to make an outrageous contribution to the world. Step up. You are very slow to respond.", "score": 0, "created_utc": 1612790710, "company": "facebook"}, {"body": "our Navan Garden Centre Facebook Pages post has been hacked. This is a sponsored post that has been hacked. Can you please rectify", "score": 4, "created_utc": 1612790556, "company": "facebook"}, {"body": "it's going to take time?? You gotta be kidding me!", "score": 0, "created_utc": 1612790466, "company": "facebook"}, {"body": "my account has been compromised. They have added an email (not mine) and added 2 step authentication. Need help regaining access and securing my account. Have submitted ID but no response!", "score": 2, "created_utc": 1612790257, "company": "facebook"}, {"body": "what a stupid platform. I just got suspended for commenting on a post calling someone else a Muppet, when I called them a sock puppet. How is that bullying? I'll stick with Twitter from now on.", "score": 0, "created_utc": 1612790177, "company": "facebook"}, {"body": "please check your dm messages- having a problem logging in to Facebook for the past week and cannot get any help", "score": 0, "created_utc": 1612790162, "company": "facebook"}, {"body": "is evil.", "score": 0, "created_utc": 1612789926, "company": "facebook"}, {"body": "I've been blocked because I told a pedophile to go fuck himself yet I report his comment and it doesn't go against community standards. Way to go Facebook for Supporting Pedophiles since 2004.", "score": 0, "created_utc": 1612789851, "company": "facebook"}, {"body": "exploits independent creators. They take your money for an ad and then, when the ad ends, inform you that it contained a low-quality attribute which made it visible to fewer people.", "score": 4, "created_utc": 1612789410, "company": "facebook"}, {"body": "I want to speak to the manager.", "score": 0, "created_utc": 1612789333, "company": "facebook"}, {"body": "ok this is the 2nd time in several months I was charged 25$ for who know what. I don't have a payment at all ever on facebook the last time I contacted you guys I received your version of a \" Oh, well..\" response I want to know what this transaction is please.", "score": 0, "created_utc": 1612789224, "company": "facebook"}, {"body": "come on how is this worth a 30 day ban skull ain't no way y'all reviewed this. This is hate speech??? Where the manager at.", "score": 0, "created_utc": 1612789207, "company": "facebook"}, {"body": "has banned page A post that mentioned 'Maqbool Butt Day' was reported as against facebook community standards. Hence proved is acting on advice of ruling class Its unacceptable ! #RestoreFreedomOfSpeech #NotoLeftBusting", "score": 0, "created_utc": 1612789123, "company": "facebook"}, {"body": "My sister's account got hacked. She's been sending her ID and emailing you guys for weeks.", "score": 17, "created_utc": 1612789120, "company": "facebook"}, {"body": "All I want is my social life back! Please do help! Got disabled after a hack. Sent ID of drivers licens and all! Haven't helped...", "score": 3, "created_utc": 1612789078, "company": "facebook"}, {"body": "My account on Facebook and Instagram gone with hope of getting them back. A user for 10+ years. Never done anything. Now gone with a poof! HELP!", "score": 0, "created_utc": 1612788896, "company": "facebook"}, {"body": "if you're racist, just say that.", "score": 0, "created_utc": 1612788709, "company": "facebook"}, {"body": "My Facebook was hacked and then banned a month ago. Instagram gone too. I have appealed. It's permanent gone without any appeals left. I lost everything! I have used your platforms for over 10 years and now gone. Completely. Please help me get them back!", "score": 1, "created_utc": 1612788186, "company": "facebook"}, {"body": "You post this while censoring black conservatives. Your pandering is absolutely pathetic.", "score": 0, "created_utc": 1612787966, "company": "facebook"}, {"body": "Why isn't calling someone a pedo against facebook standards.", "score": 0, "created_utc": 1612787803, "company": "facebook"}, {"body": "You suspended my account because someone said don't let children sit on men's laps and I questioned why just men since women can be sexual predators as well.", "score": 1, "created_utc": 1612787792, "company": "facebook"}, {"body": "I don't deserve a thirty day ban for calling us men idiots when my friend complains about getting dick pics that are perfectly okay for you to not punish", "score": 0, "created_utc": 1612787642, "company": "facebook"}, {"body": "will let you post disinformation and hate, but not pictures of naked cows or clothed cricketers.", "score": 0, "created_utc": 1612787204, "company": "facebook"}, {"body": "There is a difference between HATE SPEECH AND SPEECH THAT YOU HATE, or didn't y'all learn that in school or by you family.", "score": 0, "created_utc": 1612787059, "company": "facebook"}, {"body": "and thier incompetence for all to see. Double standards. The meme contains NO nudity and is NOT sexually suggestive (&amp;they have banned me for posting these 2 screenshots now to silence me) #facebook #communitystandards #opression #Dictatorship", "score": 5, "created_utc": 1612787002, "company": "facebook"}, {"body": "Why do you \"send\" pages to ***marketplace*** appeal page, when you have rejected an item in my ***shop*** These are two very different places on FB.", "score": 0, "created_utc": 1612787001, "company": "facebook"}, {"body": "my account was mistakenly flagged by fb system for identifying impostor accounts. send matter to the authorities. Through the overall review. and please verification my account and fixing it.#facebookdisabledme", "score": 6, "created_utc": 1612786823, "company": "facebook"}, {"body": "these days \"profile locked\" got engaged with \"profile locked\" ~ ya friend liked it.", "score": 0, "created_utc": 1612786801, "company": "facebook"}, {"body": "How do you appeal a rejected item to the store if the FB appeal page is broken!!!", "score": 0, "created_utc": 1612786713, "company": "facebook"}, {"body": "why y'all keep blocking my account", "score": 0, "created_utc": 1612786351, "company": "facebook"}, {"body": "who's always lagging behind in doing the right thing, says it plans to remove posts with false vaccine claims. #health #feedly #Facebook", "score": 0, "created_utc": 1612786141, "company": "facebook"}, {"body": "Really??", "score": 0, "created_utc": 1612786108, "company": "facebook"}, {"body": "is \"fuck donald Trump\" considered hate speech? Because Joe Biden is in fact a piece of shit. middle_finger", "score": 0, "created_utc": 1612786089, "company": "facebook"}, {"body": "Here the proof PPatience Bambrick, Salt Lake City, Called Me A Racist! But yet you banned me for 3 days! Ummmmmmmm Hello! Here ya go!", "score": 0, "created_utc": 1612785776, "company": "facebook"}, {"body": "you have just banned me from posting for three days for making a joke. Your AI is useless!", "score": 0, "created_utc": 1612785559, "company": "facebook"}, {"body": "Why is it so hard to reach a live person for support on Business Manager. Like how are you going to be one the largest social media platforms and not have a working support button!!!??!!?", "score": 0, "created_utc": 1612785431, "company": "facebook"}, {"body": "is soooo slow when it comes to everything important, but they sure get those ads out as fast as possible They couldn't have done this like years ago?? ?? via", "score": 0, "created_utc": 1612785175, "company": "facebook"}, {"body": "do you still have the Facebook marketing experts program for advertising? I am having trouble with ads repeatedly getting rejected. I haven't had much luck with the Facebook for business forum as none of the answers apply to my specific situation.", "score": 0, "created_utc": 1612784771, "company": "facebook"}, {"body": "Do you guys even understand your own Community Standard? Can't bring up the message this guy posted, but I guarantee that if an actual PERSON saw the comment, this would be banned. Unless Rasict comments are okay now???", "score": 0, "created_utc": 1612784695, "company": "facebook"}, {"body": "be wildin", "score": 0, "created_utc": 1612784234, "company": "facebook"}, {"body": "my Facebook has been hacked and im getting nowhere with the online support.", "score": 9, "created_utc": 1612784137, "company": "facebook"}, {"body": "my Facebook account is blocked and no review has taken place", "score": 0, "created_utc": 1612783657, "company": "facebook"}, {"body": "I am unable to post blog on my facebook page. My face page is AB BIHAR NEWS. So please solve as soon as possible", "score": 0, "created_utc": 1612783524, "company": "facebook"}, {"body": ", this is ridiculous. I have been trying to recover my account for over a week now. Have sent in my identification documents and still nothing. All I get is an error message saying something went wrong. What is wrong with this platform?", "score": 0, "created_utc": 1612783406, "company": "facebook"}, {"body": "When are you going to stop the adverts offering fake Beatles and Pink Floyd posters? A number of us have reported them today and they still keep cropping up. Why do you allow scam ads?", "score": 0, "created_utc": 1612782985, "company": "facebook"}, {"body": "contacted you multiple times about a fake Illinois Department of Employment Security page. I post fake page and a lady asked how did I know it was fake. Informed her government page have a check mark after their name unfortunately she had already given the page her info", "score": 0, "created_utc": 1612782803, "company": "facebook"}, {"body": "could do more, but they consistently show they won't &amp; don't care enough for us all to make it really happen. pouting_face It's affecting the world too.", "score": 1, "created_utc": 1612782287, "company": "facebook"}, {"body": "I got banned for a joke to my partner but comments that openly threaten BIPOC, trans, and NB people are not against your community standards? Fix this.", "score": 0, "created_utc": 1612782087, "company": "facebook"}, {"body": "my sister's FB account has been stolen, I've reported it twice but nothing's happened yet. Can you help a guy and his sister out?", "score": 0, "created_utc": 1612781745, "company": "facebook"}, {"body": "hey could tell me what happened?????", "score": 0, "created_utc": 1612781063, "company": "facebook"}, {"body": "hi, please can someone help me. I will message every day till you can because this is ridiculous. Been a big user for so long so not sure why this is how I'm treated", "score": 0, "created_utc": 1612780978, "company": "facebook"}, {"body": "Your warning' against certain comments wouldn't even let me delete the comment in question, and now I'm locked out for 30 days?! That's BS!!! #IHateFacebook", "score": 3, "created_utc": 1612780885, "company": "facebook"}, {"body": "i posted a message on FB informing my friends and family that my cat has passed and your heartless algorithm removed my post how low can you get FUCK YOU", "score": 0, "created_utc": 1612780703, "company": "facebook"}, {"body": "Account got hacked on 01/28, account in good standing before then for over a decade. Your support won't respond. I have family and friends on there that are no longer with us... I really don't want to lose this account. Please help (", "score": 8, "created_utc": 1612780617, "company": "facebook"}, {"body": "is crazy . I got banned for 30 DAYS for calling a fat guy fat , but when I report this they say it doesn't go against their standards", "score": 0, "created_utc": 1612780613, "company": "facebook"}, {"body": "is dying slow! F U #MarkZuckerberg grinning_squinting_face", "score": 0, "created_utc": 1612780526, "company": "facebook"}, {"body": "Facebook Ads Tutorial 2021 Click Here", "score": 0, "created_utc": 1612780511, "company": "facebook"}, {"body": "Facebook ads tutorial Click Here", "score": 0, "created_utc": 1612780348, "company": "facebook"}, {"body": "You should not offer the option of delete comment when you make a comment that you don't like when I select Delete Comment and your gestapo freezes my account anyway for making the comment. I have two words for you, and they are not happy birthday.", "score": 0, "created_utc": 1612780003, "company": "facebook"}, {"body": "account got hacked and hacker activated 2 factor auth. Your app is not allowing me to access my account with authentication code which is tied to hacker's device. I created tickets. No response from last 2 weeks #FacebookIsStupid #privacy #crapingCustomerExperience", "score": 0, "created_utc": 1612779707, "company": "facebook"}, {"body": "my sister is facing issue in signing in.. Fb is asking for uploading photo id proof, she uploaded but still verification is not done. Still she cannot login to her Facebook account back, it's been more than 15 days she's waiting. Please help us on this..", "score": 1, "created_utc": 1612779440, "company": "facebook"}, {"body": "such a waste website You have advertised for bellroy with below link and this is fraud my money has gone the real bellroy are denying", "score": 1, "created_utc": 1612779244, "company": "facebook"}, {"body": "mission is NOT to give people the power to build community and bring the world closer together.", "score": 1, "created_utc": 1612778669, "company": "facebook"}, {"body": "My acc has become hacked can i get help plz.", "score": 16, "created_utc": 1612778371, "company": "facebook"}, {"body": "So explain to me why I get banned for calling someone a C.U.N.T. for saying \"ewww\" on a pro-lgbt page? Was anything done to the woman? Probably not. #FuckFacebook", "score": 0, "created_utc": 1612778021, "company": "facebook"}, {"body": "your help support SUCKS! I've filled out form with ID multiple times since November and have not heard back at all. In November, my account got hacked into and the hacker added 2FA. I have zero access to my account. (1/2)", "score": 16, "created_utc": 1612777709, "company": "facebook"}, {"body": "please I implore you, stop muting the sounds to my s PLEASE", "score": 1, "created_utc": 1612777423, "company": "facebook"}, {"body": "FACEBOOK MISSION IS TO PROPAGANDISE AND CONTROL THE MASSES. TODAY I RECEIVED AN EMAIL FROM FACEBOOK REQUESTING THAT I SIGN A PETITION BANNING PRESIDENT TRUMP FROM ITS PLATFORM! THAT IS NOT ONLY UNFAIR AND UNJUST BUT IT IS ALSO \"STALINISM\"! TIME FOR THE GOVT TO SEIZE CONTROL!", "score": 1, "created_utc": 1612777053, "company": "facebook"}, {"body": "I have tried and tried for 178 days to submit my ID for an appeal but you won't let me submit it. After you wrongfully without reason disabled my FB and Instagram.. All im asking is for the memories of my mom and son back before she passed away. #facebookdisabledme", "score": 24, "created_utc": 1612776903, "company": "facebook"}, {"body": "I can't even get into argument with someone on Facebook without someone getting hurt But I can get called a cracker that fucks my sister because I'm inbred, come talk to me when your dick gets bigger That's all okay but I call her trash And I'm the racist face_with_tears_of_joy right", "score": 0, "created_utc": 1612776292, "company": "facebook"}, {"body": "Tried to close old account. Did ID using camera. Yet you rejected it? You asked for Drivers Licence, which I used? How do I delete my account?", "score": 0, "created_utc": 1612776249, "company": "facebook"}, {"body": "go look up a song by Beck called loser ... My response to the other person whom quotes the song was the very next verse !! 30 day ban for song lyrics... Cancel culture pussies !!", "score": 0, "created_utc": 1612776014, "company": "facebook"}, {"body": "ye are some mad mothercunts for using sms for verification, what if im abroad ye daft tools, fuck yall in pooper hopefully zuck gets rawdog fuckin imbeciles", "score": 0, "created_utc": 1612775973, "company": "facebook"}, {"body": "Can anyone tell me why my Facebook account would randomly be disabled?", "score": 11, "created_utc": 1612775947, "company": "facebook"}, {"body": "can you respond to my DMs please... does anyone work at FB? Ever? No contact us section or anything for those that can't access the site. My account is disabled and no one has notified me at all about why and I can't access FB, I'm unable to send a review request.", "score": 11, "created_utc": 1612775693, "company": "facebook"}, {"body": "Sir, I have lost access to my Google Authenticator, please recover my facebook account. Now I can't login to my own account .Please Help me", "score": 9, "created_utc": 1612775653, "company": "facebook"}, {"body": "do you also have any option to port from Jio ? Because very soon we al are going to do this....Due to pathetic service of Thanks Me Later face_without_mouth", "score": 0, "created_utc": 1612775499, "company": "facebook"}, {"body": "the google ads payment system is not functioning properly. It keeps saying payment made and no payment was taken from my account and it's going up to 100 now. I don't want y'all to come and try block me for none Payment. Fix it and get your money oooo ehn e", "score": 0, "created_utc": 1612775451, "company": "facebook"}, {"body": "Government of India IT ministry accounts move to Koo as Govt mulls action against Twitter for spreading propaganda for money", "score": 0, "created_utc": 1612775297, "company": "facebook"}, {"body": "30 day ban for this? Seriously? rolling_on_the_floor_laughing woman_facepalming_light_skin_tone You OK hun? Who hurt you #fuckerberg?.. Bare in mind I was responding to someone who wished death upon me and my 8 year old because she didn't know basic button commands face_with_tears_of_joy #facebookdisabledme #Facebook", "score": 4, "created_utc": 1612775115, "company": "facebook"}, {"body": "Arrest #BrittanyJohnson (Lovely Peaches) as well as #ban her from Social Media. - Sign the Petition! via", "score": 0, "created_utc": 1612774825, "company": "facebook"}, {"body": "How about voicenote status updates on all platforms including WhatsApp, Instagram.", "score": 0, "created_utc": 1612774602, "company": "facebook"}, {"body": "How you think about your customer influences how you respond to them.  Marilyn Suttle Still stuck in the SMS Checkpoint loop of doom #FACEBOOKSMSCHECKPOINTLOOPOFDOOM", "score": 0, "created_utc": 1612774217, "company": "facebook"}, {"body": "hey I need help recovering an account that was disabled many years ago due to a wrong age input. This account holds memories of my youth. Is it possible for me to get it recovered? However I don't remember the credentials but I remember the number linked to it.", "score": 9, "created_utc": 1612774173, "company": "facebook"}, {"body": "is the biggest fascist and hate enabler in the world", "score": 0, "created_utc": 1612774002, "company": "facebook"}, {"body": "is weak at confronting Holocaust denial and anti Semitism. The hypocrisy of and in tolerating this", "score": 0, "created_utc": 1612773834, "company": "facebook"}, {"body": "I have suggestions for resolving these issues but I have no way to reach a human so you are at the moment just one big greedy BOT!", "score": 0, "created_utc": 1612773370, "company": "facebook"}, {"body": "Facebook's role in this shameful &amp; illegal breaking of electoral law and traditions is appalling. Roman emperors were replaced for less. That is yr CEO's sense of himself? Anti democratic action by an arrogant elite in the name of \"democracy\".", "score": 0, "created_utc": 1612773364, "company": "facebook"}, {"body": "I am sick and tired of the greed that your company has and the lack of support Facebook gives content creators", "score": 0, "created_utc": 1612773320, "company": "facebook"}, {"body": "2) This is the the only way I have to communicate with your company rather than a private message that is ridiculous!", "score": 0, "created_utc": 1612773273, "company": "facebook"}, {"body": "1) it is nearly impossible to communicate with a human being at Facebook ! has incredible customers service you don't !", "score": 0, "created_utc": 1612773226, "company": "facebook"}, {"body": "I am trying to request ownership of a page through the ad manager, in which I am a manager and one that appeared that they cannot accept because the page is running on a commercial Instagram. I would have to return my profile to staff to accept ownership. What do I do?", "score": 0, "created_utc": 1612772986, "company": "facebook"}, {"body": "I deactivated a month ago, and now that I'm trying to login to re-activate my account, I'm being asked to enter a code that is not being sent to me. I have tried submitting my ID for verification but nothing seems to be working. What are my options?", "score": 0, "created_utc": 1612772961, "company": "facebook"}, {"body": "is the demon", "score": 0, "created_utc": 1612772930, "company": "facebook"}, {"body": "why do you allow so many scammers on your platform. I've reported 100's of scammers offering fake jobs and fake get rich quick schemes and you immediately say it doesn't go against community standards. You need to change your standards.", "score": 0, "created_utc": 1612772920, "company": "facebook"}, {"body": "has worst security check ever. I No longer have access to my previously used devices but still can't log in despite having access to BOTH my backup emails. HELP!", "score": 5, "created_utc": 1612772850, "company": "facebook"}, {"body": "your application of community standards is even more inconsistent than the NFL's calls last night. You need to unrestrict my account - now.", "score": 0, "created_utc": 1612772724, "company": "facebook"}, {"body": "you owe me 1.696 million plus 8 grand a month in damages", "score": 1, "created_utc": 1612772661, "company": "facebook"}, {"body": ".........................speaks for CHINA ONLY ! SATANSTOOL", "score": 1, "created_utc": 1612772626, "company": "facebook"}, {"body": "needs shut down. Watch The Social Dilemma documentary.", "score": 0, "created_utc": 1612772537, "company": "facebook"}, {"body": "Been stuck in the facebook SMS Checkpoint loop for 2 weeks. Its gotten old. Give me my account back. Zero response from the non existent Facebook customer service. I've tried all your \"help\" pages. they don't work. #facebooksmscheckpointloopofdeath", "score": 0, "created_utc": 1612772510, "company": "facebook"}, {"body": "has banned my account for *Telling a TERF to fuck off when she complained TERF was a slur. (24 hours) *Saying Straight White Men are trash. (3 days) *explaining I was banned for saying that straight white men are trash (a week) It's a broken system.", "score": 0, "created_utc": 1612772389, "company": "facebook"}, {"body": "The Art of Compassionate Business. This is the discount code ACB230. The 30% off can be redeemed via this page This discount is related to the hardback version. I hope that you enjoy the book!", "score": 0, "created_utc": 1612772327, "company": "facebook"}, {"body": "I'm not the only one #facebooksmscheckpointloopofdeath", "score": 0, "created_utc": 1612772250, "company": "facebook"}, {"body": "I had to download and make a Twitter account, just for this. I haven't seen anything from you all from all of the Emails / help forms I've submitted over the past 2 weeks about the SMS Checkpoint loop of death. #facebooksmscheckpointloopofdeath", "score": 0, "created_utc": 1612772211, "company": "facebook"}, {"body": "You all have impossible customer service. I have searched every facebook help board, and my issue is not resolved. I have emailed, and filled out every help form. Nothing. Been two weeks with out a reply. But the SMS checkpoint is a consistent issue.", "score": 0, "created_utc": 1612771964, "company": "facebook"}, {"body": "so confused w/ ur privacy settings. I want to review/approve EVERYTHING that people post on my timeline. NOT JUST things I'm TAGGED in but also random benign messages that friends post to my timeline. I want to approve everything before it's visible. Help plzzzz!", "score": 0, "created_utc": 1612771838, "company": "facebook"}, {"body": "why does FB icon NOT SHOW UP ON MY OPTIONS TO SHARE?", "score": 0, "created_utc": 1612771747, "company": "facebook"}, {"body": "i am having difficulty logging in after being hacked, can someone assist?", "score": 5, "created_utc": 1612771663, "company": "facebook"}, {"body": "got this link on messenger ... please deal with this site asap...", "score": 0, "created_utc": 1612771654, "company": "facebook"}, {"body": "why don't you all take down pages that have been hacked? my sister's account has been hacked by scammers and getting money out of her fb friends but the police and you won't do anything!!!!", "score": 17, "created_utc": 1612771631, "company": "facebook"}, {"body": "Pls remove the #Myanmar MRTV, now controlled by military since the coup. After banning all other channels &amp; limiting internet access nationwide, MRTV continue to spread lies, brainwashing, propaganda about current situation in Myanmar. #WhatsHappeningInMaynmar #FakeNews", "score": 1, "created_utc": 1612771466, "company": "facebook"}, {"body": "MY account is hacked from more than a month and i cant login becuse hacker also chaged my email. So reached facebook help center hacked page but i didn't got any help from that. so please help me in this to get back my account", "score": 16, "created_utc": 1612770586, "company": "facebook"}, {"body": "I would like to request team that remind us others birthday notification in morning not in the evening.", "score": 0, "created_utc": 1612770553, "company": "facebook"}, {"body": "This man Anoop Meena is abusing Facebook, please block his Facebook id", "score": 0, "created_utc": 1612770459, "company": "facebook"}, {"body": "put me in FB jail for 30 days for saying silly rabbit to someone but won't block people that say they want to kill our lawmakers. Silly rabbit is harassment and bullying but threatening murder is ok?! WTF?!", "score": 0, "created_utc": 1612770439, "company": "facebook"}, {"body": "This man Anoop Meena is abusing Facebook, please block his Facebook id", "score": 0, "created_utc": 1612770436, "company": "facebook"}, {"body": "This man Anoop Meena is abusing Facebook, please block his Facebook id", "score": 0, "created_utc": 1612770414, "company": "facebook"}, {"body": "No guidelines violation still this is getting the new permanent on my friend's id. Facebook clear the review problem so that he can be able to connect to his friends and family thumbs_up", "score": 0, "created_utc": 1612770130, "company": "facebook"}, {"body": "I need help with my account. Your help center is not helping", "score": 1, "created_utc": 1612769664, "company": "facebook"}, {"body": "this is all my ideas everything you see I had the idea from the start like when you ask who I wanted to marry", "score": 2, "created_utc": 1612769602, "company": "facebook"}, {"body": "why my profile are temporarily blocked without any reason?", "score": 0, "created_utc": 1612769351, "company": "facebook"}, {"body": "locked out of my personal account on Christmas Day. The hackers posted on my personal account to get me locked out. They then took over my business account taking $3 g now are replying to my customers with vulgar comments. Resetting pswd is not an opt please help me.", "score": 3, "created_utc": 1612769349, "company": "facebook"}, {"body": "why I don't c my birthday timeline or notification?", "score": 0, "created_utc": 1612769245, "company": "facebook"}, {"body": "imagine getting banned on Facebook for calling a car a farm tool face_with_tears_of_joy face_with_tears_of_joy face_with_tears_of_joy Freedom of speech will always win. Take your app to Germany and Russia. They limit speech there. Hoes. Sluts. Whores. Thots. Pussys. Skanks. Peterpuffers. Pole smokers. Meat eaters. Cunts.", "score": 0, "created_utc": 1612769230, "company": "facebook"}, {"body": "took away my watch tab and my dark mode pouting_cat pouting_cat", "score": 0, "created_utc": 1612769079, "company": "facebook"}, {"body": "Explain to me how the following photo does not violate call community standards involving \"hate speech/racial/ethnic\" #facebook", "score": 0, "created_utc": 1612768213, "company": "facebook"}, {"body": "My Facebook account has been disabled. If you guys cannot activate my account, please refund the money that is still available in my ads account. Extremely disappointed with facebook, deactivating account for no reason.", "score": 16, "created_utc": 1612768197, "company": "facebook"}, {"body": "my facebook account is disabled without any reason Please do something for this Facebook account-", "score": 1, "created_utc": 1612767736, "company": "facebook"}, {"body": "hi I am having Major issues with my account there is an email on my account that's not mine and I've been logged out", "score": 0, "created_utc": 1612767677, "company": "facebook"}, {"body": "Why do I have to give a reason to hide an ad? Just let me hide it.", "score": 0, "created_utc": 1612767430, "company": "facebook"}, {"body": "FB response to a recent article that ad is banned under the admonishment Ad Can't Run Temporary Restriction on Ads About Social Issues, Elections or Politics.' This is pure censorship and un-American. I plan to drop my FB account in protest.", "score": 2, "created_utc": 1612766857, "company": "facebook"}, {"body": "how is this page NOT breaching Facebook rules that do not allow the #selling of live animals?? You remove some posts but not the pages/groups themselves! Give your members the option of telling you why its a sales post if your bots can't tell", "score": 0, "created_utc": 1612765918, "company": "facebook"}, {"body": "my dad's account has been hacked. Someone else has used his email address and seems to have changed the entire content of his profile. The modified profile is all in Arabic!!! In addition a new profile has been created with his picture which I can see! Can someone help?", "score": 15, "created_utc": 1612765904, "company": "facebook"}, {"body": "- Sheryl Sandberg Downplayed Facebook's Role In The Capitol Hill SiegeJustice Department Files Tell A Very Different Story #forbes #feedly #Facebook #FacebookIsStupid", "score": 0, "created_utc": 1612765761, "company": "facebook"}, {"body": "if your Facebook account was hacked than it's considered Identity Fraud or Thief and I talk to the BBB and they gave me this number and told me to call and also have others call Federal Trade Commissioner at (877) 382-4357 also (510) 844-2005 Tahira A, Consumer Services Manage", "score": 0, "created_utc": 1612765669, "company": "facebook"}, {"body": "ALREADY CENSORING MIKE. #censorship #Facebook", "score": 12, "created_utc": 1612765479, "company": "facebook"}, {"body": "is trash !! They block you for sharing somebody's post but won't delete or block the original post! Because it doesn't go against standard ? Tf standards do y'all have really. Tired of they biased asses unamused_face .", "score": 0, "created_utc": 1612765439, "company": "facebook"}, {"body": "are you ever gonna reply to my email about my hacked account??? It's been over a month locked out of my acct fuck your shitty customer service. I can't wait to delete my acct when I finally can get back inside it. STUPID FUCKS", "score": 14, "created_utc": 1612765071, "company": "facebook"}, {"body": "why do i keep getting logged out for reaction to posts? Happens at least twice a week and I have to change my password. Running out of passwords now FFS.", "score": 0, "created_utc": 1612764940, "company": "facebook"}, {"body": "Dear Facebook, Please ban the following Myanmar media acc. 1. MRTV 2. Eleven Media Group The 2 are outlets used by the military to spread misinformation and terrorism. Thanks.", "score": 2, "created_utc": 1612764853, "company": "facebook"}, {"body": "see still at it. Shows 120 dollars marked down to 35. 4pcs new. Fix your marketplace policy to help protect your users. #facebookmarketplaceistrash #facebook #facebookmarketing", "score": 0, "created_utc": 1612764848, "company": "facebook"}, {"body": "big fuck off big fuck u", "score": 0, "created_utc": 1612764441, "company": "facebook"}, {"body": "They are fooling us by not showing the transparency about why my ad account is disabled. Besides, not returning the money that is in Facebook wallet (which is of no use) #shameonfacebook", "score": 0, "created_utc": 1612764402, "company": "facebook"}, {"body": "They are fooling us by not showing the transparency about why my ad account is disabled. Besides, not returning the money that is in Facebook wallet (which is of no use) #shameonfacebook", "score": 2, "created_utc": 1612764395, "company": "facebook"}, {"body": "They are fooling us by not showing the transparency about why my ad account is disabled. Besides, not returning the money that is in Facebook wallet (which is of no use) #shameonfacebook", "score": 0, "created_utc": 1612764365, "company": "facebook"}, {"body": "They are fooling us by not showing the transparency about why my ad account is disabled. Besides, not returning the money that is in Facebook wallet (which is of no use) #shameonfacebook", "score": 0, "created_utc": 1612764358, "company": "facebook"}, {"body": "#facebooksupport #marketplace You guys have blocked my marketplace without giving me a valid reason. After me asking many times about the post that have violated guidelines, no clarification given from your side. Pathetic. Disappointed. Seeking support.", "score": 0, "created_utc": 1612763897, "company": "facebook"}, {"body": "is prompting some #Reels creators to share their Reels clips to Facebook.", "score": 0, "created_utc": 1612763703, "company": "facebook"}, {"body": "This guy is still disrespecting Hindu Goddess. You must take legal action on it.", "score": 0, "created_utc": 1612763669, "company": "facebook"}, {"body": "have sent multiple forms over the past 2 weeks about my account. Still no response or resolution. Account was hacked 2 weeks ago and i am stuck in the checkpoint loop of doom. No sms.", "score": 0, "created_utc": 1612763583, "company": "facebook"}, {"body": "in this valentines please update the app and add a feature \" who visited my profile\" in this way we can found my loved one. Please fb folded_hands folded_hands folded_hands yellow_heart Need a love", "score": 0, "created_utc": 1612763420, "company": "facebook"}, {"body": "hi guys I'm on IOS 14.4 I've tried deleting your app and reinstalling it, however I'm still having problem getting badge notifications on my iPhone I've checked the settings inside and out and I still have issues? Please can someone help? Many thanks", "score": 0, "created_utc": 1612763302, "company": "facebook"}, {"body": "contributed more to spread of hate and crime - facism, racism, internat'l &amp; domestic terriorism, than any messaging platform in 200 yrs. Families/ friends no longer speak; kids groomed by pedophiles; whole wars planned. FB is a cesspool making $$$ for themselves", "score": 0, "created_utc": 1612763004, "company": "facebook"}, {"body": "Your policies are shit! #fuckfacebook #facebook", "score": 0, "created_utc": 1612762971, "company": "facebook"}, {"body": "and - Please correct yourselves. It shouldn't have to go this far. Let's all be fair. . .", "score": 0, "created_utc": 1612762409, "company": "facebook"}, {"body": "needs new ladership that can earn the trust of its users again. I believe that a new CEO with a vision in privacy and transparency will bring that up. What an amazing app with so many features, but afraid of your data. That does not match.", "score": 0, "created_utc": 1612762175, "company": "facebook"}, {"body": "Boycott", "score": 0, "created_utc": 1612762172, "company": "facebook"}, {"body": "Down with", "score": 0, "created_utc": 1612761982, "company": "facebook"}, {"body": "Fuck yall stay out our community we don't want shit fro. You you the opps", "score": 0, "created_utc": 1612761932, "company": "facebook"}, {"body": "Fuck fb don't mention shit about our history you racist fucks", "score": 0, "created_utc": 1612761887, "company": "facebook"}, {"body": "how can this comment violate the guideline?i don't understand", "score": 0, "created_utc": 1612761692, "company": "facebook"}, {"body": "What's Wrong with you guys .. why not I am not getting my Official Facebook account back yet Why every time in February why February ??????????????", "score": 0, "created_utc": 1612761432, "company": "facebook"}, {"body": "Facebook business accounts are getting hacked. Stay alert everyone", "score": 4, "created_utc": 1612759830, "company": "facebook"}, {"body": "I've been locked out of my Facebook account for almost a week now because I'm not old enough for an account. I've filled out the form and am still waiting for a reply. How do I get someone to get back to me?", "score": 8, "created_utc": 1612759241, "company": "facebook"}, {"body": "Fuck off", "score": 0, "created_utc": 1612759166, "company": "facebook"}, {"body": "hello I received a notification saying that my page named Animal Protection - Mutual Aid, Research And Information was no longer published. I do not understand why? Could you explain to me? Has anyone flagged our page?", "score": 0, "created_utc": 1612759151, "company": "facebook"}, {"body": "is strange. Report an overtly racist group and they pat your hand and suggest you block them. Call a racist a 'weirdo' and you get 3 days in the chokey.", "score": 0, "created_utc": 1612759064, "company": "facebook"}, {"body": "DOne TBD", "score": 0, "created_utc": 1612759026, "company": "facebook"}, {"body": "this is the biggest problem please solve this SMS is not sent from my facebook account", "score": 0, "created_utc": 1612758919, "company": "facebook"}, {"body": "why is the business support function not working since the middle of last week? This, along with the wrongful unpublishing of business pages and long appeal lead times are proving extremely frustrating. Any explanation for this?", "score": 0, "created_utc": 1612758172, "company": "facebook"}, {"body": "in trying to get my ads working as you've blocked me. I need help but both pages have NO online chat ive been trying to resolve this issue for months.", "score": 1, "created_utc": 1612758057, "company": "facebook"}, {"body": "help me out facebook", "score": 1, "created_utc": 1612757971, "company": "facebook"}, {"body": "why is there no way if grtting in contact with you but you are veryyyyyyy quick to take money from my account  woozy_face upside-down_face", "score": 0, "created_utc": 1612757280, "company": "facebook"}, {"body": "This is my Facebook account &amp; I am unable to login it from 20+ days , My Free Fire account is linked with my Facebook account ,now i can't login in game ,and I invested more then 5k money in game , Facebook team is not helping me , what can I do now. Help me , please..", "score": 1, "created_utc": 1612755744, "company": "facebook"}, {"body": "please tell me how I can recover my account if someone has control of it. I can't reset the password as the codes are going to an email I don't recognise. Please give me another solution", "score": 4, "created_utc": 1612755540, "company": "facebook"}, {"body": "Hi Facebook my page limited issue I,m not Facebook against monetization policy please solve my page issue thanks &amp; regards bilal ali", "score": 0, "created_utc": 1612755479, "company": "facebook"}, {"body": "i bet if it was one of your employees that got screwed you wouldn't deny their claim. #facebookmarketplaceistrash #facebook #facebookmarketing", "score": 0, "created_utc": 1612755433, "company": "facebook"}, {"body": "YOU BANNED ME FOR 7 DAYS BECAUSE SOMEONE INSULTED MY DEAD DAD, NOW GO BACK AND REVIEW MY ACCOUNT PROPERLY. THIS IS FUCKING RIDICULOUS. #facebooksupport #facebook", "score": 0, "created_utc": 1612755033, "company": "facebook"}, {"body": "You should come speak with us, before its too late. You on the wrong side of history and the wrong side of the South African Constitution. #wecantbreathe", "score": 2, "created_utc": 1612754708, "company": "facebook"}, {"body": "What is this? A team of so many people and not caring for this. I have never ever seen this section filled from Facebook. At least share an update log link here! unamused_face thinking_face", "score": 0, "created_utc": 1612754283, "company": "facebook"}, {"body": "why is it taking forever to send the authentication code to my registered number", "score": 0, "created_utc": 1612754154, "company": "facebook"}, {"body": "FIX THE INCOMING SPAM MESSAGES IN OUR INBOXES!!!!!", "score": 1, "created_utc": 1612753648, "company": "facebook"}, {"body": "someone has added me to an ad account which I have no knowledge about and I can't remove myself from it. I never asked nor authorised this. How do I remove the link ?", "score": 0, "created_utc": 1612752705, "company": "facebook"}, {"body": "are behaving like they are scared of information out there. Proves might be onto something...", "score": 0, "created_utc": 1612752043, "company": "facebook"}, {"body": "is there a human i can talk to about problems, instead of un helpful bots. For such a big platform, the customer service is shocking", "score": 0, "created_utc": 1612751351, "company": "facebook"}, {"body": "why is it taking forever to send the code to my phone", "score": 0, "created_utc": 1612750932, "company": "facebook"}, {"body": "which part false which true Pl explain", "score": 0, "created_utc": 1612750139, "company": "facebook"}, {"body": "you are one of the most sad, awful and oppressive platforms on the interenet. I don't know what else I was expecting from a company who constantly sells our data and refuses to pay a cent to Australia for corrupting our so called news feeds.", "score": 0, "created_utc": 1612749971, "company": "facebook"}, {"body": "you've just confirmed you can see what I'm writing here and continue to futher opress my right of free speech instead address of the issue. If you weren't such cowards, these tweets would not be happening", "score": 0, "created_utc": 1612749781, "company": "facebook"}, {"body": "So now you've deviously made it 3 days and not even bother to notify me or tell me why? That's fine, I know why. You're odious sexists who can't handle a womans honest opinion.", "score": 0, "created_utc": 1612749706, "company": "facebook"}, {"body": "...dear fb \"fact checkers\".....I posted the Absolute Truth video put out by Mike Lindell, and the title says it all. I'm sorry you find truth so hard to understand....you should seek help. Flagging my post doesn't change the FACTS that Mike presents. Deal with it.", "score": 0, "created_utc": 1612749223, "company": "facebook"}, {"body": "fuck Facebook they blocked after i responded to a threatening abusive comment serious this time the next 30 days i changing everything to signal and YouTube i wish g+ was still available fuck face book", "score": 0, "created_utc": 1612749109, "company": "facebook"}, {"body": "You will never hear the end of this.", "score": 0, "created_utc": 1612748657, "company": "facebook"}, {"body": "How dare you not even allow someone to contact you after blocking their account. People have responsibilites apart from standing up to bullies for being disgusting, completely insensitve and derogatory. Also on a high horse.", "score": 1, "created_utc": 1612748594, "company": "facebook"}, {"body": "Please take some action against this account or they are free under some secular standards.", "score": 0, "created_utc": 1612748566, "company": "facebook"}, {"body": "restricts my account for standing up against posts against the government. If someone can post against the govt and still that'll be under community guidelines, then my response to them was a clean answer about public being hypocritical and I got banned for 3 days !", "score": 1, "created_utc": 1612748200, "company": "facebook"}, {"body": "law should be equal for all people, if Trump was banned cause of false &amp; incitement messages, Why aren't Somali politicians and leaders accountable for using inciting and fake messages to the public?!", "score": 0, "created_utc": 1612748153, "company": "facebook"}, {"body": "Is this how all important your Facebook users are I sent you guys a message but you can't even reply nonsense", "score": 0, "created_utc": 1612747969, "company": "facebook"}, {"body": "So i ve sent you a photo of my national ID as per requested to try to recover my facebook account. Its been around 2 weeks and i havent received an email back. Is it normal to take this long to review the information or is it due to the pandemic? Thx", "score": 0, "created_utc": 1612746953, "company": "facebook"}, {"body": "Your reporting really is awful. Nowhere can we actually give detail. A series of check boxes that hardly never meet what you're trying to say. Your safe guarding has a lot of major issues", "score": 0, "created_utc": 1612745928, "company": "facebook"}, {"body": "Supreme Court' Overrules It, Orders Banned Posts Restored via", "score": 0, "created_utc": 1612745678, "company": "facebook"}, {"body": "please I need help I can't access my Facebook account, it says we will send a confirmation code to your phone number and I don't have access to that phone number again, what do I do to get my Facebook back?", "score": 1, "created_utc": 1612745105, "company": "facebook"}, {"body": "Hi, there. If you're having trouble logging in, please visit our Help Center for troubleshooting tips -RM (via Twitter", "score": 0, "created_utc": 1612744184, "company": "facebook"}, {"body": "Hi, there. If you are having trouble accessing your account please visit our Help Center for troubleshooting tips -RM (via Twitter", "score": 0, "created_utc": 1612744180, "company": "facebook"}, {"body": "Hi, there. If you are having trouble logging into your account please visit our Help Center for troubleshooting tips -RM (via Twitter", "score": 0, "created_utc": 1612744176, "company": "facebook"}, {"body": "you need to up your game! A fake account of my business has been made and is scamming people for money! Over 16 hours late and over 100 page reports you still haven't taken it down! DO YOUR JOB!!!", "score": 0, "created_utc": 1612743380, "company": "facebook"}, {"body": "can I sell on the usa marketplace from india?", "score": 0, "created_utc": 1612743273, "company": "facebook"}, {"body": "come on guys, yes you'll loose millions of users that are under 16, but unless you put your necks out and invest in sending your own teams into schools to teach kids how to properly use social media, the trolling and racists will never stop...", "score": 0, "created_utc": 1612742468, "company": "facebook"}, {"body": "You are sabotaging and throttling our voice at SAHARI..you are adding to the death toll in this country and denying our Constitutional rights in South Africa. Get your knee from our neck! #Wecantbreathe", "score": 5, "created_utc": 1612742176, "company": "facebook"}, {"body": "There is a problem with my hacked account. There is a two factor authenticator and I can't remove it. Please Help.", "score": 18, "created_utc": 1612742145, "company": "facebook"}, {"body": "please check message and revert", "score": 0, "created_utc": 1612741860, "company": "facebook"}, {"body": "what can I do now Plz help", "score": 2, "created_utc": 1612741766, "company": "facebook"}, {"body": "Too many people started ruining comment section by pasting long blank comments that needs 2 mins or more scrolling in too many posts . Please restrict this nuisance", "score": 0, "created_utc": 1612741371, "company": "facebook"}, {"body": "Hello. My account was hacked into about a month ago. Recovery code goes to an old Ecxite email address account I can't access any more. I've sent several help requests with ID. Any idea on how long responses should take? Thank you )", "score": 13, "created_utc": 1612741177, "company": "facebook"}, {"body": "Hi I'm just wondering, are you going to fix instagram creator studio? We can't log to it anymore", "score": 1, "created_utc": 1612740862, "company": "facebook"}, {"body": "How about celebrating black history month by not shutting down black people's accounts, thx.", "score": 0, "created_utc": 1612739717, "company": "facebook"}, {"body": "ima need y'all to fix my account like now cause I got disabled for calling someone ugly but legit have videos of people having seggs &amp; getting touched on your website this very unprofessional I wanna speak to mark immediately", "score": 6, "created_utc": 1612739283, "company": "facebook"}, {"body": "clean up all the ridiculous #spam on your pages!", "score": 0, "created_utc": 1612738996, "company": "facebook"}, {"body": "seriously get your shit together. how is this hate speech in any conceivable way? are you brain damaged?", "score": 0, "created_utc": 1612738791, "company": "facebook"}, {"body": "F you and your ridiculous censoring algorithm. I can't wait for the day you become the next MySpace", "score": 0, "created_utc": 1612738526, "company": "facebook"}, {"body": "please explain this bull. It won't let me see the comment that I made and I'd like to appeal.", "score": 0, "created_utc": 1612737595, "company": "facebook"}, {"body": "Hello,I'm facing some issue with Facebook app when I try to logging in.Using iphone 6", "score": 1, "created_utc": 1612737550, "company": "facebook"}, {"body": "Your system is broken. I continually get served posts from accounts that I have blocked. Fix it.", "score": 0, "created_utc": 1612736837, "company": "facebook"}, {"body": "ads is a racket. Zero customer service, bogus leads and impossible to actually talk to a person. Waste of money, don't even bother. #FacebookWeNeedToTalk", "score": 0, "created_utc": 1612735273, "company": "facebook"}, {"body": "is an ethical disgrace allowing unsafe moral practices that separate humans &amp; exploit them further. This website needs to become #PayToUse, Help? &lt;#&lt;#&lt;#", "score": 0, "created_utc": 1612735266, "company": "facebook"}, {"body": "how am I supposed to send I, d if you never accept it", "score": 0, "created_utc": 1612733928, "company": "facebook"}, {"body": "My Facebook lite is not working. It's only showing loading screen.", "score": 1, "created_utc": 1612733856, "company": "facebook"}, {"body": "why can strangers call me a N***ER with impunity but if I call my brother stupid you suspend my account for 3 days?", "score": 0, "created_utc": 1612733538, "company": "facebook"}, {"body": "my account is black I'd laddu khan laddu", "score": 0, "created_utc": 1612733439, "company": "facebook"}, {"body": "Fuck you Facebook. I just closed my account. You're the worst social network ever created.", "score": 0, "created_utc": 1612733110, "company": "facebook"}, {"body": "SOS there's a fake account on your site scamming people. He hijacked my account blocking all my attempts to report him", "score": 0, "created_utc": 1612733025, "company": "facebook"}, {"body": "how can someone appeal a disabled account if they try and submit a form using their info, but Facebook won't recognize the info to accept the form? Just one more reason people are leaving", "score": 4, "created_utc": 1612732635, "company": "facebook"}, {"body": "so you have an obvious phishing page on your site, and when reported you respond \"It doesn't violate our community standards\" .... nice.", "score": 1, "created_utc": 1612732603, "company": "facebook"}, {"body": "really needs a new leadership that can earn the trust of its users and customers. Facebook is not the Facebook it used to be despite all the great features and user integration it has on its main Facebook app.", "score": 0, "created_utc": 1612732066, "company": "facebook"}, {"body": "I created a Facebook account simply to play on my oculus quest then a week later you disable my account for no reason. I have now wasted money on the oculus and on the games. Please help me resolve this issue and unban my account. This is not right.", "score": 7, "created_utc": 1612731874, "company": "facebook"}, {"body": "I'ma keep making new profiles for as long as you keep siding with racist white individuals and then blocking me for saying white devil but when I tested it and said black devil you didn't do shit...hmmm. Happy I took screenshots smiling_face", "score": 0, "created_utc": 1612731568, "company": "facebook"}, {"body": "I'm in a FB group which has no admins. Please help us get an admin back.", "score": 0, "created_utc": 1612729981, "company": "facebook"}, {"body": "is crap. I can't wait to see the time your platform becomes irrelevant and ceased to appear.", "score": 0, "created_utc": 1612729900, "company": "facebook"}, {"body": "please help me to reset my password, i am unable to login", "score": 1, "created_utc": 1612729854, "company": "facebook"}, {"body": "listed twice in your policy. Guess it doesn't matter if you get your cut. #facebookmarketplaceistrash #Facebook #facebookmarketing", "score": 0, "created_utc": 1612729520, "company": "facebook"}, {"body": "please help me my face book I'd was stuck in identify confirmation i make fb id with my pubg I'd name kr Prince and my real name is mann kumar please help me to login my. Fb id i give you my I'd gmail Password. sujijaat10 please help me", "score": 1, "created_utc": 1612729476, "company": "facebook"}, {"body": "listing for 4 items and then being told it was for only one isnt significantly different than described? #facebookmarketplaceistrash #Facebook #facebookmarketing", "score": 0, "created_utc": 1612729467, "company": "facebook"}, {"body": "your policy not mine. #facebookmarketplaceistrash #Facebook #facebookmarketing", "score": 0, "created_utc": 1612729391, "company": "facebook"}, {"body": "I've been seeking support for my ads account. I've raised two tickets, no one is responding.", "score": 0, "created_utc": 1612729267, "company": "facebook"}, {"body": "reactivate my Instagram account memeigos I've done nothing wrong", "score": 0, "created_utc": 1612729160, "company": "facebook"}, {"body": "and need to be deplatformed by todays standards. #AbsoluteProof", "score": 0, "created_utc": 1612728882, "company": "facebook"}, {"body": "Can you please look into and suspend this page for spreading misleading information regarding to politics and situations happening in Myanmar right now? The page is being controlled by the military ! #Feb8Coup #WhatsHappeningInMyanmar GIVE BACK DEMOCRACY", "score": 0, "created_utc": 1612728425, "company": "facebook"}, {"body": "is run by dick lickers", "score": 0, "created_utc": 1612727570, "company": "facebook"}, {"body": "please help me my account is hack and I'm am fill for requirment all information but facebook is not reply for 10 days. I'm trying to many times to contract to facebook but no reply. Please someone help me pleading_face pleading_face pleading_face .", "score": 5, "created_utc": 1612727561, "company": "facebook"}, {"body": "HAHAHAHAHAHA says the company whose algorithms and moderators are white supremacists. Fuck you", "score": 0, "created_utc": 1612727507, "company": "facebook"}, {"body": "I didn't say a swear word, saying that I posted hate speech Double standard", "score": 0, "created_utc": 1612726381, "company": "facebook"}, {"body": "why give me a clickable link that just leads to this in my notifications? Seriously pointless. When someone shared your page content you used to provide a summary of the shares. Now... what?", "score": 0, "created_utc": 1612726295, "company": "facebook"}, {"body": "Can you please fix this??? You let me link my in my bio but I can't post it as a status? #NetNeutrality #Facebook #facebookdisabledme", "score": 2, "created_utc": 1612725658, "company": "facebook"}, {"body": "Why do you have a robot to police your \" community standards\" it's so half assed. Just day you don't care about hate speech.", "score": 0, "created_utc": 1612724826, "company": "facebook"}, {"body": "sucks.", "score": 0, "created_utc": 1612724467, "company": "facebook"}, {"body": "just pointing out your marketplace purchase protection is trash. But hey you guys get your cut right?", "score": 0, "created_utc": 1612724247, "company": "facebook"}, {"body": "hope you will correct your story now.", "score": 1, "created_utc": 1612724070, "company": "facebook"}, {"body": "why did you \"kill\" me during a pandemic in July? What a horrible message for my friends and family to see. This would be a great story from this journalism student in the and the", "score": 0, "created_utc": 1612723633, "company": "facebook"}, {"body": "Hey whats up you fascist crapbags. Knock off your nazi crap or you will end up paying for it.", "score": 0, "created_utc": 1612723344, "company": "facebook"}, {"body": "Get rid of the poke feature. No one uses it except creepy randos, trying to hook up with girls, as if #Facebook is some male fantasy pickup app. Most ppl don't even know the feature EXISTS.", "score": 0, "created_utc": 1612723302, "company": "facebook"}, {"body": "You are priceless. The way you keep reminding us of the good and the bad, that we were...", "score": 0, "created_utc": 1612723091, "company": "facebook"}, {"body": "you suck! You penalize only those who disagree with you and let the whiners become victims. I will never be on your page again.", "score": 0, "created_utc": 1612722918, "company": "facebook"}, {"body": "why don't you go and FaCebooK yourselves )", "score": 0, "created_utc": 1612722623, "company": "facebook"}, {"body": "I DELETED my FACEBOOK because it PROFITED from supporting RUSSIAN CYBERATTACKS and NOW is helping RIGHT-WING RACISTS, CONSPIRACY , Q Domestic Terrorism", "score": 0, "created_utc": 1612722480, "company": "facebook"}, {"body": "is there any way to contact you to recover an account? Google answers do not help.", "score": 1, "created_utc": 1612721468, "company": "facebook"}, {"body": "WHAT ARE YOU DOING? #Facebook #FreeSpeech We are the people! Don't just start censoring people everywhere for anything &amp; everything in knee jerk way! There's no excuse for this!", "score": 1, "created_utc": 1612720823, "company": "facebook"}, {"body": "what are you doing about the dangerous Facebook post I just reported!", "score": 0, "created_utc": 1612720308, "company": "facebook"}, {"body": "is an absolute joke. What happened to freedom of speech, banned for 30 days because I said Americans are crazy. Its a fact. Absolute joke of a social media site.", "score": 0, "created_utc": 1612720112, "company": "facebook"}, {"body": "You are suppressing Black voices, specially Black women voices", "score": 0, "created_utc": 1612719533, "company": "facebook"}, {"body": "I made a report of someone stealing my father's identity on Facebook and your moderators said it didn't go against Facebook policy. You've failed us. You're allowing illegal activity I can't even make another report. They dropped the case. Fix it. I am absolutely pissed", "score": 0, "created_utc": 1612719002, "company": "facebook"}, {"body": ", YOUR alternative flag teams are actually hacking our accounts. Now what are you going to do! ???? #Facebook #Hacked", "score": 5, "created_utc": 1612718844, "company": "facebook"}, {"body": "suspended me because I told a Democratic she was an idiot after she to me to F** Off.... pathetic... what happened to America and free speech!!!! Bye Facebook!", "score": 1, "created_utc": 1612718667, "company": "facebook"}, {"body": "because of your ads recommendations without verified i lost my money", "score": 0, "created_utc": 1612718189, "company": "facebook"}, {"body": "is nothing more than a tool for misinformation, dystopian mass advertising and election interference, and I look forward to my and everybody else's accounts being deleted by Zucc as he manically tries to depoliticize the whole platform and tanks his own market value", "score": 0, "created_utc": 1612717897, "company": "facebook"}, {"body": "ok I'll boycott Facebook", "score": 0, "created_utc": 1612717698, "company": "facebook"}, {"body": "Do Better.", "score": 0, "created_utc": 1612717654, "company": "facebook"}, {"body": "here's", "score": 0, "created_utc": 1612717644, "company": "facebook"}, {"body": "here's what going on", "score": 0, "created_utc": 1612717301, "company": "facebook"}, {"body": "I was locked out of my Facebook page and I need it my friend love my post and I forgot my password HELP!!!!!!!!!", "score": 4, "created_utc": 1612716671, "company": "facebook"}, {"body": "GET OUR ACCOUNTS BACK! Very poor customer service, shame on you! #facebookdisabledme", "score": 3, "created_utc": 1612716513, "company": "facebook"}, {"body": "I'm having a problem with my Facebook app and messenger...got a new device and when I logged into my accounts everything was gone it wanted me to redo everything...help", "score": 0, "created_utc": 1612715470, "company": "facebook"}, {"body": "do you guys think your cool disabling my accounts for no reason because my account violated community guidelines I'm sorry that I'm an American and want to post stuff that are pro America I guess freedom of speech doesn't apply to your cite fuck all of you", "score": 0, "created_utc": 1612715247, "company": "facebook"}, {"body": "lets racists spew their garbage all over its platform, then proceeds to restrict and suspend the accounts of people who stand against that shit and call them out for the trash they are. The only time they take action is when the racists have an insurrection. #FuckFB", "score": 0, "created_utc": 1612714952, "company": "facebook"}, {"body": "How do I get the avatar for a Facebook status? Like this...", "score": 0, "created_utc": 1612714562, "company": "facebook"}, {"body": "I watched you grow from nothing.. from do no evil to evil when you started making too much $$. Why aren't you doing something about Facebook hate groups? Watch the whole thing Facebook is mentioned OVER and OVER. What is wrong with you?", "score": 0, "created_utc": 1612714074, "company": "facebook"}, {"body": "police are getting ridiculous. Banned for telling a lady she has rights to her body to prevent unwanted pregnancy. Yes I said men are animals but am I really wrong? Can't stand trump but he's right about free speech being impeded by certain platforms.", "score": 0, "created_utc": 1612713669, "company": "facebook"}, {"body": "why Facebook ubdate doesn't have voice comments on posts besides writing?", "score": 0, "created_utc": 1612713483, "company": "facebook"}, {"body": "The support centre is useless. I have a problem getting into my account. It's locked me out. And I didn't even activate the two step authentication in the first place. I've been entering the code but it's not letting me in. I need to get my account sorted.", "score": 3, "created_utc": 1612712900, "company": "facebook"}, {"body": "I'm having a problem with my two step authentication. I can't get into my account. I've been reporting this problem and getting no response. Why is it so difficult to contact customer service for pressing concerns like this?", "score": 0, "created_utc": 1612712632, "company": "facebook"}, {"body": "if a Buyer gets scammed on Facebook Marketplace then Seller blocks the Buyer, how do you report this? Also, will Facebook help aid the police investigation by sharing the details? i.e. seller listed item and their details?", "score": 0, "created_utc": 1612712502, "company": "facebook"}, {"body": "Since you people purposely hide so people can't contact you. you suspended me for this, not meant to treat anyone. dumbass. well if I was a Trump supporter I would kill a cop. Then swear it was Antifa and BLM.did they blame 6th on them. omg your fucking stupid.", "score": 0, "created_utc": 1612712004, "company": "facebook"}, {"body": "why doesn't Facebook deal with people cloning accounts and trying to scam followers.", "score": 0, "created_utc": 1612711505, "company": "facebook"}, {"body": "REALLY STARTING TO TICK ME OFF. IM BLOCKED FOR ANOTHER 30 DAYS FOR SOMETHING THAT WAS POSTED A MONTH AGO.", "score": 0, "created_utc": 1612711299, "company": "facebook"}, {"body": "sort your fucking shit out. I've done nothing!! Just got over a 3 day ban for no reason then get hit with this?! You just trying to permanently block my account? Can't even use messenger this time sort it out you sensitive Karen.", "score": 0, "created_utc": 1612710958, "company": "facebook"}, {"body": "Let us educate to the infinite value of life and is convenient for us to reach the Fullness of Being and Existing forever, in Whom life gave us. with the book \"AWARENESS.\" with the book \"Be Responsible. with the book \"Sacred Coincidences\" Sincere", "score": 0, "created_utc": 1612710054, "company": "facebook"}, {"body": "How come there are so many fake Covid vaccine news groups on Facebook? They have blood on their hands.", "score": 0, "created_utc": 1612708738, "company": "facebook"}, {"body": "will you add the nearby' feature on WhatsApp, this will keep users from going to thanks thumbs_up_medium_skin_tone", "score": 0, "created_utc": 1612708513, "company": "facebook"}, {"body": "Facebook, why are you allowing all these fake video scam schemes to keep going ??? When reporting you say doesn't go against guidelines' shockingly poor !! People are being ripped off and you are allowing it !", "score": 1, "created_utc": 1612708441, "company": "facebook"}, {"body": "allows Trump supporters to wish death on democrats. Facebook does nothing when a Democrat is doxxed. Facebook doesn't care if rednecks threaten to bring a group to a Biden supporters house to burn it down. These things happened and are still up. Facebook is #trash", "score": 0, "created_utc": 1612708242, "company": "facebook"}, {"body": "needs to keep him out. He's not going to stop spreading hate. We will be back to square one.", "score": 0, "created_utc": 1612708150, "company": "facebook"}, {"body": "allows racism to continue. Facebook allows white racists to wish death on black people. Facebook allows homophobia. Facebook does nothing when a person from the LGBTQ+ community is threatened physically. Facebook is an awful cesspool.", "score": 0, "created_utc": 1612708147, "company": "facebook"}, {"body": "Please help.", "score": 0, "created_utc": 1612707748, "company": "facebook"}, {"body": "Thanks to everybody that recommended cybersecurity041 on my instagram with there assistance I was able to get back my old disabled business account", "score": 2, "created_utc": 1612707632, "company": "facebook"}, {"body": "he is dangerous Keep that in mind, D A N G E R O U S", "score": 0, "created_utc": 1612707583, "company": "facebook"}, {"body": "Hi i have a trouble with my Facebook account, i forgot my password and i tried everything( phone number,emali,username) but i still can't log in. Is there any way to log in on my Facebook account? Help me if you can. Thank u ))", "score": 1, "created_utc": 1612707356, "company": "facebook"}, {"body": "how many Palestinians have you killed today? #facebook", "score": 0, "created_utc": 1612706957, "company": "facebook"}, {"body": "I need you guys to message me! I tried to contact through the help center but it's not working. please dm me it's important.", "score": 0, "created_utc": 1612706934, "company": "facebook"}, {"body": "critical #error 1675030. Problem occur while adding a college; path is \"education_experience_save\".", "score": 0, "created_utc": 1612706572, "company": "facebook"}, {"body": "enough is enough. More than 2 weeks without access to my account after being hacked and disabled, even after I verified my identity. I need my account back for my continuing education and support groups. This is not what good #CustomerExperience looks like.", "score": 0, "created_utc": 1612706057, "company": "facebook"}, {"body": "\"always looking out for the security of the people of Facebook?\" I have had my account for almost 10 years, I am clearly over 13. I need access for my school, well-being &amp; mental health groups #Facebook #communityguidelines #CustomerService #dobetter", "score": 0, "created_utc": 1612705750, "company": "facebook"}, {"body": "So hey you guys - apparently domestic terrorists working around whatever you think you have in place to stop them. They organized Insurrection, posted their videos of treason &amp; sedition and you took none down. Way to fail.", "score": 1, "created_utc": 1612705701, "company": "facebook"}, {"body": "Thanks to everybody that recommended cybersecurity041 on my instagram with there assistance I was able to get back my old disabled business account", "score": 2, "created_utc": 1612705540, "company": "facebook"}, {"body": "Thanks to everybody that recommended cybersecurity041 on my instagram with there assistance I was able to get back my old disabled business account", "score": 3, "created_utc": 1612705023, "company": "facebook"}, {"body": "you are beyond a joke ! All these scam videos taking people money and using name and yet this is your response ??? are you getting a cut of this #scam #fraud #crime or what ? #Facebook #MarkZuckerberg #crime #security #scamming", "score": 2, "created_utc": 1612704959, "company": "facebook"}, {"body": "First when I made the account, you locked it til I gave you my phone number. Hadn't even posted yet. Now I sign out and walk away for a couple hours and you think I'm going to give you my photo ID as well?!? This data mining is absolutely ridiculous!!", "score": 2, "created_utc": 1612704950, "company": "facebook"}, {"body": "Mandate location upload on ever upload.", "score": 0, "created_utc": 1612704344, "company": "facebook"}, {"body": "I have a business account and a personal account with you guys and today someone hacked my personal account. How can I get access to both? I was planning to set up ads for my business.", "score": 14, "created_utc": 1612703490, "company": "facebook"}, {"body": "my business page has been taken over by someone else, I have been removed as an admin and cannot find out how to do anything about it anywhere", "score": 0, "created_utc": 1612703416, "company": "facebook"}, {"body": "didn't you say you were staying out of elections?", "score": 0, "created_utc": 1612703369, "company": "facebook"}, {"body": "Further update No news from and I was sent a screenshot from some random person who is making changes in my account. If you are going to disable the account and prevent the owner from operating it, you must prevent others from accessing it as well. #unacceptable", "score": 0, "created_utc": 1612702632, "company": "facebook"}, {"body": "maybe when you block it, deign to send a notification for what and for how many days? This is the second time I have been blocked and no notification is sent. Where are #HumanRights and #democracy?#Facebook #Azerbaijan #DoubleStandards #JusticeForShebi", "score": 0, "created_utc": 1612702481, "company": "facebook"}, {"body": "is a joke. My account was hacked and there is no one that help me. They continue to spam my friends with scams and there is nothing I can do about it. I've tried reporting them but they say they're no braking any rules man_facepalming_medium-dark_skin_tone", "score": 12, "created_utc": 1612702233, "company": "facebook"}, {"body": "Stop with the suggested for you, add, suggested for you, add, suggested for you, add, suggested for you, add, friends post, suggested for you, add, suggested for you, same add as 4 adds prior.", "score": 0, "created_utc": 1612702050, "company": "facebook"}, {"body": "This shit is totally utter bullshit there is no reason for restricting my comments at all! I even made a case and telling what it was from and you still denied it and this is why it's not taking your bullshit anymore.", "score": 3, "created_utc": 1612702047, "company": "facebook"}, {"body": "a guy named Antony Tomkin wrote on Facebook today that if Joe Biden met Jacinda's baby, he would abuse her. I reported it. Facebook said it doesn't go against their \"standards\" ( the level is lower than a snakes belly ). I'd like an EXPLANATION.", "score": 0, "created_utc": 1612701839, "company": "facebook"}, {"body": "Zuckerburg must really be missing those Qnut propaganda revenues because EVERY THIRD POST this morning is an ad.", "score": 0, "created_utc": 1612700468, "company": "facebook"}, {"body": "Neither of the 2 recovery processes to recover my fb account work (6 digit recovery code or email link after 3 of trusted contacts send the 4 digit code) cos I am not receiving the email that fb should send. You have not direct support team, hence the tweet.Please help", "score": 0, "created_utc": 1612700166, "company": "facebook"}, {"body": "fuck you bitch steady banning me pussy . Tell mark it's up from here", "score": 0, "created_utc": 1612699970, "company": "facebook"}, {"body": "Who thought it was a good idea to integrate messages and messages? The newsfeed is messy. It's a mess. I cannot make sense of what I'm seeing on my homepage. There are so many apps on the left and right side. Your bus dev reps screwed it up.", "score": 0, "created_utc": 1612699712, "company": "facebook"}, {"body": "isn't it funny how you will allow antisemites and white supremacists to talk about killing Jews and other minorities but the second anyone defends themselves you ban them. How many white supremacists does employ? Do you have a Nazi quota or just a preference?", "score": 0, "created_utc": 1612699634, "company": "facebook"}, {"body": "I can log in on my app on my phone, but can't use fbook on a laptop. I've done all the steps and sent the help requests already (y do u need my ID for that?!) and no response. Your authentication process is broke.", "score": 0, "created_utc": 1612699255, "company": "facebook"}, {"body": "You guys care about black history month? Why is it anytime I report racist comments it \"doesn't go against community standards\" ?", "score": 0, "created_utc": 1612699200, "company": "facebook"}, {"body": "damn no one work ! Some needs to shut this mofo down !", "score": 0, "created_utc": 1612699087, "company": "facebook"}, {"body": "For some reason my account was flagged as under 13, but while submitting my request I got a \"could not complete request\"", "score": 0, "created_utc": 1612698959, "company": "facebook"}, {"body": "All I did was post a quote from history - just because the quote came from Hitler doesn't mean I like that scumbag - it's HIS words not mine! You just \"erased history\" by deleting a quote ABOUT ERASING HISTORY! Think about the irony in that! Please unblock me! Thanks!", "score": 0, "created_utc": 1612698849, "company": "facebook"}, {"body": "You need to impose proper procedures to counteract secular and racist accounts being set up for malicious content. The current blocking process is generic and not regulated to advance criminal investigations to take place.", "score": 0, "created_utc": 1612698391, "company": "facebook"}, {"body": "FIX YOUR AI", "score": 0, "created_utc": 1612698248, "company": "facebook"}, {"body": "I got a three day mute for JOKING with my husband that I'd kill him for talking to girls at 3am? Fuck you, you raggedy bitch", "score": 3, "created_utc": 1612697805, "company": "facebook"}, {"body": "Please support the people's money, our goal is 1 $$$", "score": 0, "created_utc": 1612697764, "company": "facebook"}, {"body": "Thank you for sending your information. We have fewer people available to review information due to the coronavirus (COVID-19) pandemic. This means we may be unable to review your account. We apologize for any inconvenience", "score": 0, "created_utc": 1612697592, "company": "facebook"}, {"body": "I haven't been able to log into my Facebook for over 3 weeks! Is there any time frame on when this feature will be back up after you secure your account? I'm at a loss at what to do!", "score": 0, "created_utc": 1612696862, "company": "facebook"}, {"body": "No you do not get to have a hate filled glorified Php database and pretend you care about Black Folks while you destroy this earth.", "score": 0, "created_utc": 1612696812, "company": "facebook"}, {"body": "I need a pro Bono lawyer to Sue Facebook. They indicated that my post was against community standards. Asked me to Delete It. Then gave me Error message and said it couldn't be done when I tried.", "score": 0, "created_utc": 1612696695, "company": "facebook"}, {"body": "Why do you still keep suspended accounts live enough to do data analytics yet restrict the actual owners. My account was suspended in 2015 yet i have still received various notifications, adverts etc in my email. Completely contradicts GDPR", "score": 0, "created_utc": 1612696660, "company": "facebook"}, {"body": "So your community standards do not include free speech and science based discussions?", "score": 0, "created_utc": 1612696117, "company": "facebook"}, {"body": "You are making me quite mad as someone put their name in my page and you won't let me put my name in there as it suppose to be so I will sue you $100.00 an hour for the time it takes me to put my name back in there as it is suppose to be.", "score": 0, "created_utc": 1612695257, "company": "facebook"}, {"body": "My facebook account is hacked, please help me.", "score": 18, "created_utc": 1612694848, "company": "facebook"}, {"body": "Hello?", "score": 0, "created_utc": 1612694079, "company": "facebook"}, {"body": "you can take your bs community standards and shove it.", "score": 0, "created_utc": 1612693920, "company": "facebook"}, {"body": "Telling u now sort me fb out or this gonna be hell on", "score": 1, "created_utc": 1612693728, "company": "facebook"}, {"body": "needs to explain why during #BlackHistoryMonth when trying to post about celebrating #BHM, there's no option to face_with_symbols_on_mouth", "score": 1, "created_utc": 1612693211, "company": "facebook"}, {"body": "can you hjelp me here ? Contacted support a week ago but not responding.", "score": 0, "created_utc": 1612692997, "company": "facebook"}, {"body": "is a cesspool.", "score": 0, "created_utc": 1612692889, "company": "facebook"}, {"body": "looking forward to Fcuking you in the arse when they bring in their new privacy. Your a scummy company.", "score": 0, "created_utc": 1612692674, "company": "facebook"}, {"body": "I need help, my fb account doesn't let me enter.", "score": 0, "created_utc": 1612692611, "company": "facebook"}, {"body": "You say my user name should include my Real name and yet you let some fool put their name in there but you won't let me put MY name in there.", "score": 0, "created_utc": 1612692468, "company": "facebook"}, {"body": "I am SO freaking frustrated!!!!!!! I am locked out of my account and can not get in and your help goes in circles and ISNT helping!!!! I do not have access to my email on my account so I followed prompts to add a new email, but I never got the recover email!!! Help", "score": 12, "created_utc": 1612692449, "company": "facebook"}, {"body": "aye foreal why y'all be blocking me ? Like it be for stupid stuff wassup with that Lmaoo", "score": 0, "created_utc": 1612691935, "company": "facebook"}, {"body": "I've had my business account promotions disabled. It's been months. I've gone through help centre. Sent in a report. NOTHING BACK pouting_face pouting_face pouting_face Get someone to reach out", "score": 13, "created_utc": 1612691816, "company": "facebook"}, {"body": "You have let this tim.egal.75 change my page so much that you won't let me put it back the way it is suppose to be. I should sue you.", "score": 0, "created_utc": 1612691741, "company": "facebook"}, {"body": "fuck y'all dick in the booty ass mfs, calling someone a snitch bitch ain't bullying. Calling someone Walmart Kodak ain't bullying. Zuckerberg you softer than baby shit.", "score": 0, "created_utc": 1612691626, "company": "facebook"}, {"body": "can't handle how funny I am when dealing with these trolls. And for some reason the troll is still able to post.", "score": 0, "created_utc": 1612691599, "company": "facebook"}, {"body": "how can calling someone worm violate community standards when these other insults do not? I know they don't, because that's what you to,d me when I reported them...", "score": 0, "created_utc": 1612691216, "company": "facebook"}, {"body": "Hi! Trying to confirm ID through phone in marketplace. It sends 6 code digits but allows only 5 slots. And then says wrong code. Can you help?", "score": 0, "created_utc": 1612690768, "company": "facebook"}, {"body": "So you are now a bunch of Nazi fascists, censoring anything that doesn't fit the government narrative even when it's factual, basically you are nothing more than a Nazi propaganda and control outlet now! Disgusting platform, disgraceful people and company!", "score": 0, "created_utc": 1612690741, "company": "facebook"}, {"body": "my goodness can you stop making #marketplace better its #worse #leavewellenoughalone", "score": 0, "created_utc": 1612690698, "company": "facebook"}, {"body": "you are at the head of generation Censor. We have seen this behaviour before in history. It is a thread in the fabric of the kind of society you in your wokeness should be against yet you have embraced it. I am glad I cancelled you before you censored me. #ShameOnYou", "score": 0, "created_utc": 1612690613, "company": "facebook"}, {"body": "You people are being quite arrogant and ignorant not letting me change my page and I mean my page, and yet it seams that you let someone else change it. . Who is this tim.egal.75", "score": 0, "created_utc": 1612690384, "company": "facebook"}, {"body": "I have query for my ad publishing as I have already made the payment but ad has not been published yet. Unable to understand the problem. Can you please provide me a helpline number so that I could resolve my problem?", "score": 0, "created_utc": 1612690268, "company": "facebook"}, {"body": "there should be a live streaming option in also. #FacebookLive #WhatsApp", "score": 0, "created_utc": 1612690200, "company": "facebook"}, {"body": "it's absolutely insane that you don't have a feature to actually speak with any customer service.", "score": 0, "created_utc": 1612689897, "company": "facebook"}, {"body": "Allowing a known insurrectionist to have a social media platform makes complicit i. The sedition, treason &amp; insurrection. Past, present &amp; future. Civil &amp; criminal liability should attach.", "score": 0, "created_utc": 1612689493, "company": "facebook"}, {"body": "is ran by hypocritical fascists. People can call me \"retarded\", \"you need to die\" but I call them a \"potato brain\" and I get a 7 day ban... What is this kindergarten?", "score": 0, "created_utc": 1612689321, "company": "facebook"}, {"body": "Some one has created account with my profile photo and name. And has collected money. What shall I do? Shall I file FIR against that fake Account?", "score": 0, "created_utc": 1612688831, "company": "facebook"}, {"body": "just blocked me from posting/commenting for 3 days because I said the word \"fat\" in a comment that said our brain needs good fats?? Wtf??", "score": 0, "created_utc": 1612688820, "company": "facebook"}, {"body": "needs to be thrown out ....", "score": 0, "created_utc": 1612688646, "company": "facebook"}, {"body": "why can I not update my relationship for at least a month now. I've messaged nearly 20 times with no reply or support confused_face", "score": 0, "created_utc": 1612688452, "company": "facebook"}, {"body": "Do you really want to help #blackowned businesses? One small thing you can do to help is, stop blocking our products from being displayed! My company sells #certifiedvegan skincare, what is the issue? Would greatly appreciate some feedback on this!", "score": 0, "created_utc": 1612688208, "company": "facebook"}, {"body": "ask your business partners #WhereAreTheMissingFarmers #FarmersProtests #FarmersAreIndia #KisanEktaZindabad #HumanRights #SpeakUpForNodeep #SuperBowl #SuperBowl2021#indiashumanrightsviolations", "score": 0, "created_utc": 1612688005, "company": "facebook"}, {"body": "ask your business partners #WhereAreTheMissingFarmers #FarmersProtests #FarmersAreIndia #KisanEktaZindabad #HumanRights #SpeakUpForNodeep #SuperBowl2021", "score": 0, "created_utc": 1612687966, "company": "facebook"}, {"body": "what an arrogant decision. No appeal? Does everyone get the same level of respect? I'm so glad I never had -or will have - a Fakebook page.", "score": 0, "created_utc": 1612687883, "company": "facebook"}, {"body": "please fix it!!!!", "score": 0, "created_utc": 1612687870, "company": "facebook"}, {"body": "My account was hacked! I turned in my ID and you said you couldn't verify it with my ID. What else can I do?!?!?!? Help!!! #Hacked #Help #HackedAccount #Facebook", "score": 22, "created_utc": 1612687515, "company": "facebook"}, {"body": "any chance of a deleting or hide marketplace option in settings?", "score": 0, "created_utc": 1612687364, "company": "facebook"}, {"body": "Facebook keeps disabling my account for wrong reasons .Nothing written or posted wrong...i sent ID ..enabled..then disabled again this is 4th time.Garbage facebook bots..as scam business is on the ,yr wealth is built with fraud.", "score": 4, "created_utc": 1612687115, "company": "facebook"}, {"body": "banned this artwork and me from freedom of expression. On the dangers of social media addiction.", "score": 0, "created_utc": 1612686797, "company": "facebook"}, {"body": "If you want people to have a healthy year, how about you remove dangerous misinformation about Covid from you platform?", "score": 0, "created_utc": 1612686591, "company": "facebook"}, {"body": "So I haven't been on Facebook for 3 weeks. Facebook is now sending me text messages reminding me of people's birthdays... I haven't been on your app in weeks, and now you start texting me?!?!? So messed up.....", "score": 0, "created_utc": 1612686565, "company": "facebook"}, {"body": "How many hate groups are on your platform again?", "score": 0, "created_utc": 1612686480, "company": "facebook"}, {"body": "Sure is a shame that you provide a platform for racists and domestic terrorists without accepting any accountability. The public realm or 4th estate you are not. You're a glorified message board that captures and sells people's data.", "score": 0, "created_utc": 1612686344, "company": "facebook"}, {"body": "Why are you banning me from posting Art work expressing the possible addiction to social media?", "score": 0, "created_utc": 1612686141, "company": "facebook"}, {"body": "I am not sure that you understand racism, for example... I was warned on FB for making an observation of how English people behave that I thought was rude... Being English ... I can do that... How is that hate speech towards myself?", "score": 1, "created_utc": 1612686070, "company": "facebook"}, {"body": "Hello, I Posted the attached photo of an artist view of the addicting qualities of social media. And I was ruled and banned on the fact that it was promoting violence??? Please clarify how art of this nature promotes violence or is offensive?", "score": 0, "created_utc": 1612685962, "company": "facebook"}, {"body": "&amp; allow exploitation of children on their platform as well, but don't voice a different political opinion then them a$$holes. Makes you wonder what they are all into woman_shrugging_medium-light_skin_tone", "score": 0, "created_utc": 1612685888, "company": "facebook"}, {"body": "ask your business partners #WhereAreTheMissingFarmers #FarmersProtests #FarmersAreIndia #KisanEktaZindabad #HumanRights #SpeakUpForNodeep #SuperBowl2021 #endcorporategreed", "score": 0, "created_utc": 1612685622, "company": "facebook"}, {"body": "You guys do realize you behave exactly like the fascists of ever fascists regime that has ever existed, right? Your censorship and removal of every conservative viewpoint is sick.", "score": 0, "created_utc": 1612685304, "company": "facebook"}, {"body": "sucks", "score": 0, "created_utc": 1612685187, "company": "facebook"}, {"body": "how is that 4 different times people are allowed to go on racist rants but that the minute a POC replies they are put in jail? #racistmuch", "score": 0, "created_utc": 1612684900, "company": "facebook"}, {"body": "what y'all doin? For the #blacks in United_States I knkw i c the #BLM signs but #SoftwareEngineering #softwaredeveloper #jobseekers how many #blacks hired by your company?.. set up w the billions u have schools in poor neighbourhoods make it a goal to #hire #blackmen #BlackWomen", "score": 0, "created_utc": 1612684833, "company": "facebook"}, {"body": "y'all r dirty to the core stealth huh? My account associated w periscope and conservative comments I've made is being watched eyes Y'all disabling my features slowly but surely! #FacebookWeNeedToTalk #facebookdisabledme I m surprised #TwitterCensorship blocked 5 my accts", "score": 0, "created_utc": 1612684527, "company": "facebook"}, {"body": "The people of Burma are fighting for democracy with their lives. Please Recognize our efforts. Please kindly help us. #savemyanmarfrommilitarycoup", "score": 0, "created_utc": 1612684518, "company": "facebook"}, {"body": "please help me getting back my account. i have lost my Email and have no longer access to it. my registered number is same since 2010. not able to reset my password. i still have access in my mobile App. #help", "score": 1, "created_utc": 1612684429, "company": "facebook"}, {"body": "really? face_with_tears_of_joy You all are off the rails.", "score": 0, "created_utc": 1612684326, "company": "facebook"}, {"body": "y'all need to update your platform for marketplace. These are the type of customers y'all allow to fuck up your platform. Because you give them this leverage by making everything automated person_facepalming_medium-dark_skin_tone", "score": 0, "created_utc": 1612683676, "company": "facebook"}, {"body": "I don't have access to my phone number neither I am able to recollect my password, ho do I login, I have tried every option but didn't succeed", "score": 0, "created_utc": 1612683627, "company": "facebook"}, {"body": "My account has been wrongfully disabled since August 14th 2020!!! This same excuse everytime I try to submit my ID. When is this going to be fixed and when are we going to get our accounts back?!", "score": 9, "created_utc": 1612682659, "company": "facebook"}, {"body": "you people suck. A meme I posted that mocked the capitol insurrectionists was removed because it contained the guy with the confederate flag (hate speech). But if I report a post with dicks, including one that's ejaculating, you tell me that doesn't violate guidelines??", "score": 0, "created_utc": 1612682589, "company": "facebook"}, {"body": "ask your business partners #WhereAreTheMissingFarmers #FarmersProtests #FarmersAreIndia #KisanEktaZindabad #HumanRights #SpeakUpForNodeep #SuperBowl #farmersagainstcorporategreed", "score": 0, "created_utc": 1612682148, "company": "facebook"}, {"body": "ask your business partners #WhereAreTheMissingFarmers #FarmersProtests #FarmersAreIndia #KisanEktaZindabad #HumanRights #SpeakUpForNodeep #SuperBowl", "score": 2, "created_utc": 1612682098, "company": "facebook"}, {"body": "How can I get support with my business page? No support articles, but I need a person to verify my page. I'm running a business I don't have time for downtime. Please help!", "score": 0, "created_utc": 1612681758, "company": "facebook"}, {"body": "Why do you allow racist ads from weapons manufacturers on your platform? Here, we have Thomas Orapello commenting on a racist ad for a gun that shoots pepper bullets, telling people how they can kill people with it. Facebook needs to do better.", "score": 0, "created_utc": 1612681503, "company": "facebook"}, {"body": "At this point, I'm actually willing to work as a content moderator for y'all because why the fuck did this take 2 reports for it to get removed?! Y'all had to do a double take on a photo that clearly depicts violence against women?!", "score": 2, "created_utc": 1612681466, "company": "facebook"}, {"body": "has improved their image description AI! Want to ensure that all of your customers can access your photos on Facebook? Be sure to add alt text descriptions when you post photos. #SmallBizMarketing #SocialMediaMarketing", "score": 1, "created_utc": 1612681222, "company": "facebook"}, {"body": "you suspended my account for telling someone they're smug? Fuck y'all. I'm gone.", "score": 1, "created_utc": 1612681089, "company": "facebook"}, {"body": "I would like all my accounts deactivate ! I have been hacked Jamal Jenkins So pls see this done !", "score": 13, "created_utc": 1612680834, "company": "facebook"}, {"body": "Hello Facebook MY Instagram AC IS DISABLED BY M I S T A K E S ! Thanks so much for sparing time to read this message, but I am so desperate about my business account is disabled by mistakes", "score": 10, "created_utc": 1612680731, "company": "facebook"}, {"body": "ask your business partners #WhereAreTheMissingFarmers #FarmersProtests #FarmersAreIndia #KisanEktaZindabad #HumanRights #SpeakUpForNodeep #SuperBowl", "score": 0, "created_utc": 1612680692, "company": "facebook"}, {"body": "ask your business partners #WhereAreTheMissingFarmers #FarmersProtests #FarmersAreIndia #HumanRights #SpeakUpForNodeep #SuperBowl #SuperBowl2021", "score": 0, "created_utc": 1612680681, "company": "facebook"}, {"body": "my friend's account has been hacked. Please help", "score": 3, "created_utc": 1612680597, "company": "facebook"}, {"body": "I've managed to suppress the ads for alcohol on my fb feed but I can't seem to stop gambling ads. I block them as soon as I see them but they reappear after a time. Please tell me how to permanently disable gambling ads please.", "score": 1, "created_utc": 1612680596, "company": "facebook"}, {"body": "Having an identical issue but getting no support or help. My daughters account has been hacked &amp; no one at Facebook is replying/helping.", "score": 11, "created_utc": 1612680514, "company": "facebook"}, {"body": "ask your business partners #WhereAreTheMissingFarmers #FarmersProtests #FarmersAreIndia #KisanEktaZindabad #HumanRights #SpeakUpForNodeep #SuperBowl #SuperBowl2021", "score": 1, "created_utc": 1612680378, "company": "facebook"}, {"body": "-a platform that let's people post &amp; livestream all sorts of horrendous rhungs but announcement of a protest outside Indian Consulate is against its \"Community Standards\". Disgraceful suppression &amp; this has happened to hundreds of Kashmiri accounts since start of Feb.", "score": 10, "created_utc": 1612680216, "company": "facebook"}, {"body": "ask your business partners #WhereAreTheMissingFarmers #FarmersProtests #FarmersAreIndia #KisanEktaZindabad #HumanRights #SpeakUpForNodeep", "score": 0, "created_utc": 1612680208, "company": "facebook"}, {"body": "ask your business partners #WhereAreTheMissingFarmers #FarmersProtests #FarmersAreIndia #KisanEktaZindabad #HumanRights #SpeakUpForNodeep", "score": 0, "created_utc": 1612680173, "company": "facebook"}, {"body": "ask your business partners #WhereAreTheMissingFarmers #FarmersProtests #FarmersAreIndia #KisanEktaZindabad #HumanRights #SpeakUpForNodeep", "score": 0, "created_utc": 1612680108, "company": "facebook"}, {"body": "ask your business partners #WhereAreTheMissingFarmers #FarmersProtests #FarmersAreIndia #KisanEktaZindabad #HumanRights #SpeakUpForNodeep", "score": 0, "created_utc": 1612680087, "company": "facebook"}, {"body": "ask your business partners #WhereAreTheMissingFarmers #FarmersProtests #FarmersAreIndia #KisanEktaZindabad #HumanRights #SpeakUpForNodeep", "score": 0, "created_utc": 1612680020, "company": "facebook"}, {"body": "HEY SOMEONE IS USING MY MOMS EMAIL FOR THEIR PROFILE AND BECAUSE YOU HAVE NO SUPPORT WE CANT GET IT FIXED OR REMOVED! SO A LITTLE HELP WOULD BE NICE pouting_face", "score": 0, "created_utc": 1612679977, "company": "facebook"}, {"body": "ask your business partners #WhereAreTheMissingFarmers #FarmersProtests #FarmersAreIndia #KisanEktaZindabad #HumanRights #SpeakUpForNodeep", "score": 1, "created_utc": 1612679969, "company": "facebook"}, {"body": "ask your business partners #WhereAreTheMissingFarmers #FarmersProtests #FarmersAreIndia #KisanEktaZindabad #HumanRights #SpeakUpForNodeep", "score": 1, "created_utc": 1612679919, "company": "facebook"}, {"body": "ask your business partners #WhereAreTheMissingFarmers #FarmersProtests #FarmersAreIndia #KisanEktaZindabad #HumanRights #SpeakUpForNodeep", "score": 1, "created_utc": 1612679883, "company": "facebook"}, {"body": "Seems like an issue using Facebook on S21 Ultra, when scrolling the app crashes. Looked online and many others having the same issue.", "score": 1, "created_utc": 1612679878, "company": "facebook"}, {"body": "ask your business partners #WhereAreTheMissingFarmers #FarmersProtests #FarmersAreIndia #KisanEktaZindabad #HumanRights #SpeakUpForNodeep", "score": 1, "created_utc": 1612679868, "company": "facebook"}, {"body": "ask your business partners #WhereAreTheMissingFarmers #FarmersProtests #FarmersAreIndia #KisanEktaZindabad #HumanRights #SpeakUpForNodeep", "score": 0, "created_utc": 1612679823, "company": "facebook"}, {"body": "ask your business partners #WhereAreTheMissingFarmers #FarmersProtests #FarmersAreIndia #KisanEktaZindabad #HumanRights #SpeakUpForNodeep", "score": 0, "created_utc": 1612679734, "company": "facebook"}, {"body": "ask your business partners #WhereAreTheMissingFarmers #FarmersProtests #FarmersAreIndia #KisanEktaZindabad #HumanRights #SpeakUpForNodeep", "score": 0, "created_utc": 1612679649, "company": "facebook"}, {"body": "ask your business partners #WhereAreTheMissingFarmers #FarmersProtests #FarmersAreIndia #KisanEktaZindabad #HumanRights #SpeakUpForNodeep", "score": 0, "created_utc": 1612679518, "company": "facebook"}, {"body": "ask your business partners #WhereAreTheMissingFarmers #FarmersProtests #FarmersAreIndia #KisanEktaZindabad #HumanRights #SpeakUpForNodeep", "score": 0, "created_utc": 1612679466, "company": "facebook"}, {"body": "how do I get in contact with actual human support, not just suggested help..????", "score": 0, "created_utc": 1612679071, "company": "facebook"}, {"body": "Why are you so protective of pedo's and fake accounts? Yet catch people with minor bullshit all the time? Do you favor these people? #BREAKING #pizzagate", "score": 0, "created_utc": 1612678796, "company": "facebook"}, {"body": "said their in their that they didn't read our text.. but this is what i found in my", "score": 0, "created_utc": 1612678759, "company": "facebook"}, {"body": "wants us all to be sjw's so lets do that, lets make it known Facebook wont remove reported cases of child exploitation or fake accounts designed to cause problems. But has no issue putting out bans on long term accounts for minor if any violations. #share #BreakingNews", "score": 0, "created_utc": 1612678273, "company": "facebook"}, {"body": "home of the fake account &amp; pedophile pages, that the company refuses to remove person_shrugging #FacebookWeNeedToTalk #BreakingNews #BigTech", "score": 0, "created_utc": 1612678093, "company": "facebook"}, {"body": "every single one of those claims came from a fake account, except for the pedophile you went out of your way to protect. #Facebook #FacebookWeNeedToTalk #HumanRights", "score": 0, "created_utc": 1612677986, "company": "facebook"}, {"body": "You are liars and employ bullies, you are hypocrites, condemn bullying but do it to people who disagree with your politics. 7 day restriction for a comment that was not bullying then 30 days for not agreeing with the oppressive nazi behind the facebook moderation!", "score": 2, "created_utc": 1612677945, "company": "facebook"}, {"body": "will mute anything you post that goes against their POLITICAL IDEOLOGY. Not once have any of my reports of ANTISEMITISM gone against their community standards' ... including photos of slaughtered children. Seriously, what are your STANDARDS, Facebook? face_with_symbols_on_mouth", "score": 0, "created_utc": 1612677766, "company": "facebook"}, {"body": "boy, you got pedo groups over there but I can't express my opinion about an article because you claim it's hate speech.... FB is either pro-child abusers or just stupid... wonder if this has to do with your friend", "score": 1, "created_utc": 1612677723, "company": "facebook"}, {"body": "Hello Facebook MY Instagram AC IS DISABLED BY M I S T A K E S ! Thanks so much for sparing time to read this message, but I am so desperate about my business account is disabled by mistakes", "score": 4, "created_utc": 1612677574, "company": "facebook"}, {"body": "Hello Facebook MY Instagram AC IS DISABLED BY M I S T A K E S ! Thanks so much for sparing time to read this message, but I am so desperate about my business account is disabled by mistakes", "score": 0, "created_utc": 1612677568, "company": "facebook"}, {"body": "how can I speak to someone on phone or chat? Your online articles aren't very good.", "score": 0, "created_utc": 1612677548, "company": "facebook"}, {"body": "Hello Facebook MY Instagram AC IS DISABLED BY M I S T A K E S ! Thanks so much for sparing time to read this message, but I am so desperate about my business account is disabled by mistakes", "score": 0, "created_utc": 1612677545, "company": "facebook"}, {"body": "Hello Facebook MY Instagram AC IS DISABLED BY M I S T A K E S ! Thanks so much for sparing time to read this message, but I am so desperate about my business account is disabled by mistakes", "score": 4, "created_utc": 1612677538, "company": "facebook"}, {"body": "Hello, I'm facing an error, when I'm trying to login in creator studio(for instagram) with any instagram account, it shows me this error {\"error_type\" \"oauthexception\", \"code\" 400, \"error_message\" \"invalid redirect_uri\"} Help!", "score": 1, "created_utc": 1612677510, "company": "facebook"}, {"body": "thinks this is perfectly ok to say about and refused to take it down bc it didn't violate their community standards. People can just openly talk about murdering our representatives now?", "score": 0, "created_utc": 1612677453, "company": "facebook"}, {"body": "Hello Facebook MY Instagram AC IS DISABLED BY M I S T A K E S ! Thanks so much for sparing time to read this message, but I am so desperate about my business account is disabled by mistakes. Is there anyone could help me with this?", "score": 1, "created_utc": 1612677388, "company": "facebook"}, {"body": "Joe Morris David Morris 15 May at 12 16  Joe Morris David Morris 3 April  See more See more Book", "score": 0, "created_utc": 1612677254, "company": "facebook"}, {"body": "Hello Facebook MY Instagram AC IS DISABLED BY M I S T A K E S ! Thanks so much for sparing time to read this message, but I am so desperate about my business account is disabled by mistakes.", "score": 0, "created_utc": 1612677206, "company": "facebook"}, {"body": "Why doesn't Facebook check the ID of new users? That would stop the problems of fraud and abuse.", "score": 0, "created_utc": 1612676933, "company": "facebook"}, {"body": "My Facebook account was hacked twice , and I have tried reaching you severally via email, sent you my IDs, but I keep getting automated emails. Please address the issue because the hacker keeps trying to scam people. Thanks. P.S. I am available for further information", "score": 15, "created_utc": 1612676457, "company": "facebook"}, {"body": "waiting on you jackasses to finish closing out the fake reports from the last two fake account reports, service has really gone down hill thumbs_down #Facebook", "score": 0, "created_utc": 1612675984, "company": "facebook"}, {"body": "- might have a small issue with the search engine. How is a \"Found Black Cat\"? thinking_face #TheRock #JFS", "score": 0, "created_utc": 1612675926, "company": "facebook"}, {"body": "Sir Why I'm not Post or delete any Pic video message in ummeed-roshniki FB Page ? smirking_face", "score": 2, "created_utc": 1612675512, "company": "facebook"}, {"body": "I really got banned for calling a friend of mine a bitch? This is the dumbest 3 day ban I've ever seen, absolutely stupid Someone tell me about this #Parler", "score": 1, "created_utc": 1612675262, "company": "facebook"}, {"body": "has misread the #Myanmar market and come under regulatory criticism for it in the past for allowing #misinformation #hatespeech and incitement of real-world violence against Rohingya Muslims to proliferate. 1/3", "score": 2, "created_utc": 1612674931, "company": "facebook"}, {"body": "How irresponsible are you. My nephew account has been hacked and his details has been changed. But the profile still the same. The worst thing is that there is no correct option for immediate action. What a shame that you support this.", "score": 16, "created_utc": 1612674627, "company": "facebook"}, {"body": "y'all need to lighten the fuck up n stop banning my Facebook for no reason", "score": 0, "created_utc": 1612673384, "company": "facebook"}, {"body": "Dear FB, I complained about the post which does hurt the sentiments of Hindu community and you didn't take the comment down why ??? This is the worst representation of our Goddess mother Kali. Take immediate action else I will uninstall the FB.", "score": 1, "created_utc": 1612673305, "company": "facebook"}, {"body": "Facebook was an eye opener for us regarding upcoming Kickstarter campaign. Thanks!", "score": 0, "created_utc": 1612672486, "company": "facebook"}, {"body": "says I have to have an admin approve my pictures that I post to my own wall. Someone is scared of me passing truth I guess.", "score": 0, "created_utc": 1612671724, "company": "facebook"}, {"body": "you idiots banned me for 3 days for a fucking typo. WELL DONE", "score": 0, "created_utc": 1612671482, "company": "facebook"}, {"body": "you keep rejecting our commerce shop because not compliant with your commerce policy, a real shame that we had to remove a shark fin swimming toy because you thoughts we sell animals. Really bad experience... no word to describe how you are making things complicated.", "score": 1, "created_utc": 1612670884, "company": "facebook"}, {"body": "\"Hi we're facebook and instead of helping you with your problem here's some useless reading material cause were too lazy to actually help you. Enjoy losing years of memories and financial problems from the hacker having access to your payments.\" I miss myspace.", "score": 0, "created_utc": 1612670728, "company": "facebook"}, {"body": "Celebrate Black History month with FBI crime statistics #BlackHistoryMonth", "score": 0, "created_utc": 1612670598, "company": "facebook"}, {"body": "my facebook account is hacked and the hacker has full control on my account he changed my mobile number and deleted friends from list. I can't able to log into my account . Not a single method offered by Facebook is working. The support offered is very worse.", "score": 16, "created_utc": 1612670577, "company": "facebook"}, {"body": "This is useless. Your faq is useless. Ive tried everything there and sent in all my identifying documents and the only reply i ever got back was yall too busy to look at my shit so someone else can stay in my account.", "score": 0, "created_utc": 1612670562, "company": "facebook"}, {"body": "and in a nutshell.", "score": 0, "created_utc": 1612670535, "company": "facebook"}, {"body": "so im sure i got hacked and have tried so many times to contact and i have not gotten a reply back. Tried recovering my acct and sent identification and i get blown off. Are you really concerned about the safety of our identity or do you say that to all the guys?", "score": 11, "created_utc": 1612670418, "company": "facebook"}, {"body": "really are hypocritical tossers. Individuals get a ban for the likes of \" bell end\", yet we complain about the constant harassment from people selling directly and nothing happens. Their #Algorithms are shte. #Facebook #censorship #FacebookIsStupid #facebookwankers", "score": 0, "created_utc": 1612669952, "company": "facebook"}, {"body": "This is insane!!!! Facebook is ridiculous any more. I am in Facebook jail for 9 days over a picture I shared. They said I am inciting violence", "score": 0, "created_utc": 1612669951, "company": "facebook"}, {"body": "I have been trying to reach out to Facebook Support for the issue I have been facing related to my Ads account. Request you to kindly Provide me with assistance.", "score": 0, "created_utc": 1612669711, "company": "facebook"}, {"body": "#TikTok You BAN A PRESIDENT BUT ALLOW THIS CRAP!", "score": 0, "created_utc": 1612668753, "company": "facebook"}, {"body": "Facebook if you don't have employees because of covid why are you blocking me then that's almost a year, I have nowhere to go", "score": 0, "created_utc": 1612668501, "company": "facebook"}, {"body": "just took out a post by sinclair lewis saying it was partially false!!! That is NOT true! It was his opinion!!! here it is When fascism comes to America, it will be wrapped in the flag and carrying a cross.  Sinclair Lewis", "score": 0, "created_utc": 1612667451, "company": "facebook"}, {"body": "-5 rape, assault, and murder of left wing elected officials .. And attacks on left wing people commenting on posts. There's no doubt you allow them. Allowing them to attack others implies that you condone their violence to others .", "score": 0, "created_utc": 1612667046, "company": "facebook"}, {"body": "-4 the crime of terrorism? What do you call planting pipe bombs? I now believe your employees that said they were told to target Left wing views. What else should I think given the evidence that my account was targeted for facts, while you allowed RWers to promote", "score": 0, "created_utc": 1612666912, "company": "facebook"}, {"body": "I'm not sure why this got my account suspended, please advise", "score": 1, "created_utc": 1612666869, "company": "facebook"}, {"body": "-3 you hide instead of giving people the chance to defend their comments. If 100 plus other people can say it, so can I. And if right wing commenters can threaten me and spew vulgarities without being banned, why can't I make the statement that their actions fall under", "score": 0, "created_utc": 1612666758, "company": "facebook"}, {"body": "-2the rioters committing terrorism. What they did falls under the legal definition of terrorism so you can't dispute the truth in my statement. It's accurate. And I have seen probably 100 other people make the same statement. Yet I get banned while others don't. And", "score": 0, "created_utc": 1612666602, "company": "facebook"}, {"body": "my account needs to be restored immediately. I was wrongly accused of violating standards. You didn't take down comments laughing at AOC being assaulted. And other comments about the left being raped and killed. But I made the same statement MANY made on FB, about", "score": 0, "created_utc": 1612666435, "company": "facebook"}, {"body": "-4/ that discuss the crimes committed and trample their rights while allowing the right to say anything, post lies, and threaten lives. At least people know you said threats are acceptable. Just as a matter of public record.", "score": 0, "created_utc": 1612666255, "company": "facebook"}, {"body": "my account is hacked by this guy. Pls restore my account", "score": 13, "created_utc": 1612666139, "company": "facebook"}, {"body": "-3- no doubt in my mind that your employees are right. You do target left wing views. You proved that repeatedly. At least your employees are honest. The only conclusion that one can draw is that you support the rioters. What else can one think when you target accounts", "score": 0, "created_utc": 1612666085, "company": "facebook"}, {"body": "-2 a fact that MANY people have stated . Placing pipe bombs at the Capitol is an act of terrorism . And for saying that I GET ACCUSED of violating standards? So others can spew vulgarities and threaten me- but I can't say which law rioters broke? Really? There is", "score": 0, "created_utc": 1612665833, "company": "facebook"}, {"body": "why can't people defend themselves immediately when you WRONGLY accuse someone of violating standards. I didn't violate your standards. I'm blocked while you allow others to call me a cunt and threaten me. What did I do? I said the rioters committed terrorism. It's", "score": 0, "created_utc": 1612665618, "company": "facebook"}, {"body": "This is absolutely true, whether you like it or not! And your freaking fact checkers can go take a long walk off of a short pier!!", "score": 0, "created_utc": 1612664049, "company": "facebook"}, {"body": "hi im trying to get my Facebook back but I dont have money to get my Facebook recovered please I just wanna get it fixed asap fast please I need to knos whats going on on social media and yet no one iz helping me out sadly please ill do anything to get my Facebook back", "score": 0, "created_utc": 1612663783, "company": "facebook"}, {"body": "why is creator studio having so many problems... fix yo shit", "score": 1, "created_utc": 1612663113, "company": "facebook"}, {"body": "why you don't care of customer satisfaction but only for money iam also small business man but our ethics is above yours you are global company and dying for money how shameful is this statement but also ture #facebookislooser #facebookisfraud #FacebookIsStupid", "score": 0, "created_utc": 1612662999, "company": "facebook"}, {"body": "can you tell me if my account is deactivated and why do I keep receiving notifications if I can't access my account?", "score": 0, "created_utc": 1612662933, "company": "facebook"}, {"body": "very disappointed from policy of your company it makes you looser because these days small business refund money if customer did not take product or service but Facebook is money sucker it doesn't give it back even if u need or not its services once u paid it won't be", "score": 0, "created_utc": 1612662832, "company": "facebook"}, {"body": "Censors Female Professor's Book Critiquing Toxic Femininity' #TheAntiMaryExposed #ToxicFemininity", "score": 0, "created_utc": 1612662084, "company": "facebook"}, {"body": "Our Facebook pages show post reach are getting lower, even before internet was shut down. If we ever find out that you cooperated with the illegal military regime, don't think this matter will go unresolved. We will make sure you are held accountable.", "score": 0, "created_utc": 1612661919, "company": "facebook"}, {"body": "Where can I get help for my page? you make it impossible, but you let people take ownership of a page without question?", "score": 0, "created_utc": 1612661886, "company": "facebook"}, {"body": "Black History is written every day. It is constantly shaped by people who are living their stories out loud. The movements created by the Black community are constantly making waves around the world. Together, building a rich and divers", "score": 0, "created_utc": 1612661363, "company": "facebook"}, {"body": "Hi Jovanka. Please allow more time for the review of your disabled account. -IK (via Twitter", "score": 1, "created_utc": 1612661360, "company": "facebook"}, {"body": "taig loving queers", "score": 0, "created_utc": 1612659944, "company": "facebook"}, {"body": "cunts", "score": 0, "created_utc": 1612659938, "company": "facebook"}, {"body": "Just because I write bish does not make it bullying and restricting my account for it 50 years old I can cuss like a sailor if I want and me doing so does not make it bullying. So I am bullying someone in a credit help group woman_shrugging_medium_skin_tone really #censorship #bullying", "score": 1, "created_utc": 1612659609, "company": "facebook"}, {"body": "Dear Facebook. I have been trying to reach you for this issue as It shows my account will be disabled after few days while I have submitted all the concern information. please help me dear", "score": 2, "created_utc": 1612658651, "company": "facebook"}, {"body": "Who are your moderators in malaysia? Are they all malay? Do you audit their work?", "score": 0, "created_utc": 1612658411, "company": "facebook"}, {"body": "Who are your moderators in malaysia? Are they all malay? Do you audit their work?", "score": 0, "created_utc": 1612658401, "company": "facebook"}, {"body": "Who are your moderators in malaysia? Do you audit their work", "score": 1, "created_utc": 1612658367, "company": "facebook"}, {"body": "Who are your moderators in malaysia? Do you audit their work", "score": 0, "created_utc": 1612658353, "company": "facebook"}, {"body": "Who are your moderators in malaysia? Do you audit their work?", "score": 0, "created_utc": 1612658342, "company": "facebook"}, {"body": "Who are your moderators in malaysia? Are they all malays? Do you audit their moderation?", "score": 0, "created_utc": 1612658310, "company": "facebook"}, {"body": "who are your moderators in malaysia? Are they all malays?", "score": 0, "created_utc": 1612658073, "company": "facebook"}, {"body": "blocked my fb account without telling any reason.#WTF is this?", "score": 1, "created_utc": 1612657933, "company": "facebook"}, {"body": "You control your ad showing property because its very harmfull for people.A website \"wear loud\"whose ad show in #Facebook Page,cut my payment and do not delivered my item.If i am try to contact him then no any option is a verybig fraud", "score": 3, "created_utc": 1612657392, "company": "facebook"}, {"body": "Your broken algorithm just banned me from posting or commenting for 3 days while in the process of trying to educate white people about white privilege and black history, all because I said the word \"fuck\". It was apparently considered \"bullying\". Just... woman_facepalming_light_skin_tone", "score": 0, "created_utc": 1612656782, "company": "facebook"}, {"body": "I shared an article critical of the Proudboys and you locked my account for three days because it was about the proud boys. And when you asked me if I accepted the decision I thought the post was just being removed not I was in fb jail.", "score": 1, "created_utc": 1612656675, "company": "facebook"}, {"body": "algorithm is out of fucking control. Now I can't post or comment for 3 DAYS because I said the word \"fuck\".", "score": 0, "created_utc": 1612656581, "company": "facebook"}, {"body": "banned me for 24 hours cuz I said perv sensitive ass app", "score": 0, "created_utc": 1612655176, "company": "facebook"}, {"body": "Mark Zuckerberg &amp; are just evil. Facebook's Misleading Campaign Against #Apple's Privacy Policy Facebook cherry-picked the data that best supported its case &amp; then increased the size of the cherries it picked by a third. #FB", "score": 0, "created_utc": 1612655027, "company": "facebook"}, {"body": "Hi. I would like to talk to Mark Zuckerberg on Facebook and Regina Dugan on Leap on the telepathy chip I was entrusted with by a German agent, so please support them and me.", "score": 0, "created_utc": 1612653982, "company": "facebook"}, {"body": "Facebook what is the meaning of this? How can you reject my advertising and yet deducted my money again. You have to fix this", "score": 2, "created_utc": 1612653742, "company": "facebook"}, {"body": "doesn't think somebody who thinks they're the Joker posting ableist and racist memes about democrats off topic in response to a news report of a pedophile being arrested goes against community guidelines", "score": 2, "created_utc": 1612652663, "company": "facebook"}, {"body": "stop this bullshit im 5'10 almost 5'11", "score": 0, "created_utc": 1612652500, "company": "facebook"}, {"body": "Hi my stock is sucking because Apple said \"fuck you\" and now my moderators in Nigeria are being paid overtime. Fuck you Mark. You're a stool.", "score": 0, "created_utc": 1612652484, "company": "facebook"}, {"body": "why can't I create posts on my pages from Facebook app on iPhone and can no longer invite my friends to events neither on the app nor the web. Is this a bug or did you guys just took away the feature? Is there going to be a fix to this? #Facebook #bugs", "score": 0, "created_utc": 1612652278, "company": "facebook"}, {"body": "Facebook allows pseudo-science as well as white terrorism but blocks somebody who refutes both? Well it's the typical stock market California bullshit we've experienced that led to insurrection at the capitol. Shut Zuck down. He's an idiot.", "score": 0, "created_utc": 1612652016, "company": "facebook"}, {"body": "I get blocked for 24-hours because some idiot posts falsehoods post-vaccine for COVID? You are off your goddamned rocker, Zuck and danger to yourself and others. LAUGHABLE", "score": 0, "created_utc": 1612651831, "company": "facebook"}, {"body": "god your app is awful. I'm from mobile and i can't stop getting flooded from trash groups i don't even need in my groups feed, i only joined 2 groups that i acually need and all i want to see is my groups posts, pls stop flooding my damn feeds with useless stuff", "score": 0, "created_utc": 1612651647, "company": "facebook"}, {"body": "placing photos of your dogs and putting on daily motivational stuff will probably go against Facebook's community \"standards\" - if they have any. But enticing gender based violence like this guy did by saying a lady should have been slapped doesn't? #facebookdisabledme", "score": 1, "created_utc": 1612651090, "company": "facebook"}, {"body": "My personal facebook account was disable 1 month ago. this account my real account. I was submit my proof but it can't resolve my problem. Email", "score": 0, "created_utc": 1612650772, "company": "facebook"}, {"body": "Really?? A documentary on E lection F raud is labeled as this?", "score": 0, "created_utc": 1612650338, "company": "facebook"}, {"body": "Fuck you #Facebook", "score": 0, "created_utc": 1612649485, "company": "facebook"}, {"body": "#Facebook if I can't confirm I can't get it back what's going on with your processing", "score": 1, "created_utc": 1612649452, "company": "facebook"}, {"body": "this Page is spreading false propaganda, pls take a note ! pls verify ! #FarmersProtest #KisanTractorRally", "score": 0, "created_utc": 1612649401, "company": "facebook"}, {"body": "ask your business partners #WhereAreTheMissingFarmers #FarmersProtests #FarmersAreIndia #KisanEktaZindabad #HumanRights #SpeakUpForNodeep #Facebook #Deletewhatsapp #deletefacebook", "score": 2, "created_utc": 1612649340, "company": "facebook"}, {"body": "ask your business partners #WhereAreTheMissingFarmers #FarmersProtests #FarmersAreIndia #KisanEktaZindabad #HumanRights #SpeakUpForNodeep #Facebook #Deletewhatsapp #deletefacebook", "score": 0, "created_utc": 1612649278, "company": "facebook"}, {"body": "My Business Account was Disabled i dont know why ID No 588285651968914 in Name of Jash Infra already i have given so many add as same add why you people disabled that please write here.....", "score": 3, "created_utc": 1612649079, "company": "facebook"}, {"body": "Please help me out. I cannot access my Facebook account again. My number 08038750603. My email is", "score": 1, "created_utc": 1612648855, "company": "facebook"}, {"body": "hi sir my Facebook page Aashish Virat Cricket news block ho gaya hai please return my page please Facebook", "score": 1, "created_utc": 1612648206, "company": "facebook"}, {"body": "Some chud decided to call me a shitlib, so I told him to Go get fucked. Over this you decided to mute me for 24 hours?!? Where are the consequences for him? This is bullshit. I'm the one who was bullied.", "score": 0, "created_utc": 1612647989, "company": "facebook"}, {"body": "Please fix our accounts! They're still disabled!", "score": 3, "created_utc": 1612647980, "company": "facebook"}, {"body": "Facebook really sucks - account suspended then disabled for using the word idiot. Zuckerberg is a Nazi &amp; pedo - he used to go to Epstein's Island, so I fear for the safety of his children.", "score": 2, "created_utc": 1612647503, "company": "facebook"}, {"body": "Facebook really sucks - account suspended then disabled for using the word idiot. Zuckerberg is a Nazi &amp; pedo - he used to go to Epstein's Island, so I fear for the safety of his children.", "score": 1, "created_utc": 1612647468, "company": "facebook"}, {"body": "Facebook really sucks - account suspended then disabled for using the word idiot. Zuckerberg is a Nazi &amp; pedo - he used to go to Epstein's Island, so I fear for the safety of his children.", "score": 2, "created_utc": 1612647414, "company": "facebook"}, {"body": "can you guys pls help me I can't get into my account because I have a new number so I'm not getting the code weary_face", "score": 0, "created_utc": 1612646850, "company": "facebook"}, {"body": "is the National Enquirer of social media now. Every video is YOU'LL NEVER BELIEVE WHAT HAPPENS and it's a 3min video with 2min 50sec build up to a plane taking off slightly faster than normal.", "score": 0, "created_utc": 1612646760, "company": "facebook"}, {"body": "&amp; it's marxist CEO real face is exposed...", "score": 0, "created_utc": 1612646552, "company": "facebook"}, {"body": "And now, I am really convinced. I received an apology from you for incorrectly restricting my account yet the restriction remains in place. Who or what is running your admin??? #facebookcensorship", "score": 0, "created_utc": 1612646281, "company": "facebook"}, {"body": "How can you book money back from your Facebook Ads app? Can't seem to find the option.", "score": 0, "created_utc": 1612645578, "company": "facebook"}, {"body": "i have a page on facebook Name Al-Meer Foundation.its a non profit registered organization having more than 7k followers in just 7 months wid a gr8 public presence and we accept donation any one can do frauds by creating a fake page,we want our page to b verified", "score": 0, "created_utc": 1612645503, "company": "facebook"}, {"body": "i have a page on facebook Name Al-Meer Foundation.its a non profit registered organization having more than 7k followers in just 7 months wid a gr8 public presence and we accept donation any one can do frauds by creating a fake page,we want our page to b verified", "score": 0, "created_utc": 1612645423, "company": "facebook"}, {"body": "wtf why am I on a 3 day ban 4 the same post I just got banned the day before for 24hrs? How can you punish someone twice?! 4 a post questioning an art piece grade 9 students are being shown! I need FB for my job!!! pouting_face", "score": 0, "created_utc": 1612645413, "company": "facebook"}, {"body": "is there any way someone can contact them please? Shes sent her identification in already. Please help", "score": 2, "created_utc": 1612645342, "company": "facebook"}, {"body": "Yall some bitch made pussy ass mfs bruh istg fuck you &amp; yo mf momma", "score": 0, "created_utc": 1612645217, "company": "facebook"}, {"body": "None of that is working any otger responses besides the generic help center", "score": 0, "created_utc": 1612644787, "company": "facebook"}, {"body": "can you assist with unfreeze my account?", "score": 0, "created_utc": 1612644728, "company": "facebook"}, {"body": "And how do we do that if we cant log in?????", "score": 0, "created_utc": 1612644688, "company": "facebook"}, {"body": "still have no response after months to recovering my account. I haven sent in my ID multiple times as requested, and gone through all the processes possible. Please help!", "score": 1, "created_utc": 1612643443, "company": "facebook"}, {"body": "my Facebook account has been memorialize some one can help me Account is sadaqut.mirza", "score": 1, "created_utc": 1612643287, "company": "facebook"}, {"body": "HELLO!?!?!?!? #FacebookDisabledMe", "score": 1, "created_utc": 1612643275, "company": "facebook"}, {"body": "And get scammed.", "score": 0, "created_utc": 1612643170, "company": "facebook"}, {"body": "page URL - Page ID - 350619348717301 I have been very anxious for the last four months, I have not received any help from Facebook, I am not receiving my adstream monitization earnings,I'm having a lot of trouble, please help me", "score": 2, "created_utc": 1612642397, "company": "facebook"}, {"body": "should come out clean and tell me had it disabled my account under pressure and under whose pressure ! Who does not want me to be active on ! 1/4", "score": 5, "created_utc": 1612641640, "company": "facebook"}, {"body": "shut down the big lie expressionless_face", "score": 0, "created_utc": 1612641257, "company": "facebook"}, {"body": "How the hell are you going to #censor #FreedomOfSpeech with your own #lie This has to do with #electionfraud. Not the #deepstates agenda of #killing and #raping kids!", "score": 0, "created_utc": 1612641247, "company": "facebook"}, {"body": "sort your algorithms out. I didn't do anything wrong!!!! Second time now.", "score": 1, "created_utc": 1612640984, "company": "facebook"}, {"body": "Need back FB account slightly_smiling_face I believe that Facebook would never work in reverse, so I create all my social or websites accounts with Facebook. Nothing happens with fake IDs, which are verified with my card has been disabled for a long time today, I can't survive without FB slightly_smiling_face", "score": 2, "created_utc": 1612640805, "company": "facebook"}, {"body": "ask your business partners #WhereAreTheMissingFarmers #FarmersProtests #FarmersAreIndia #KisanEktaZindabad #HumanRights #SpeakUpForNodeep", "score": 4, "created_utc": 1612640617, "company": "facebook"}, {"body": "keep saying Ima get pregnant and ion like that Ima need a manager slightly_smiling_face face_with_tears_of_joy", "score": 0, "created_utc": 1612639996, "company": "facebook"}, {"body": "how does one get access to their Facebook page after accidentally removing them self as admin And now there is no admin?", "score": 1, "created_utc": 1612639398, "company": "facebook"}, {"body": "ask your business partners #WhereAreTheMissingFarmers #FarmersProtests #FarmersAreIndia #KisanEktaZindabad #HumanRights #SpeakUpForNodeep #IndiaSupportsChakkaJam #Facebook", "score": 2, "created_utc": 1612639348, "company": "facebook"}, {"body": "anyone there on Facebook support .. 3 weeks I have been chasing you guys but no response", "score": 0, "created_utc": 1612638705, "company": "facebook"}, {"body": "Are you joking?", "score": 0, "created_utc": 1612638280, "company": "facebook"}, {"body": "who do y'all have for mentors to monitor your stuff because i'm post blocked for 7 days but people can say the nastiest things and it's okay. YALL SUCK", "score": 0, "created_utc": 1612637908, "company": "facebook"}, {"body": "banned me for harassment and bullying, for being harassed and bullied by hundreds of people on a thread and being brave enough to respond confidently. candidly speaking, you do not scare me. Scum. disguised_face", "score": 0, "created_utc": 1612637708, "company": "facebook"}, {"body": "seriously?? This is post is blatantly transphobic. I guess facebook just supports transphobia now. #Facebook #transphobia #TransRightsAreHumanRights", "score": 0, "created_utc": 1612637520, "company": "facebook"}, {"body": "I just got suspended for 30 days for posting a guy in his underwear. There are groups who post naked guys asses and you come for me. Why do have to suspend? Just ask people to take it down and be done with it. I might just QUIT facebook altogether.", "score": 0, "created_utc": 1612637492, "company": "facebook"}, {"body": "has banned me 3 times for Hate speech all 3 times have been for my comments on a story involving criminal acts committed by White's. \"Fucking white people and I bet he's fucking White\" is not hate speech Facebook I'm White, am I supposed to be a white nationalists?", "score": 0, "created_utc": 1612637223, "company": "facebook"}, {"body": "#MarkZuckerberg WHY YALL HOES KEEP PLAYIN WIT ME!!! YALL WEIRD ASSES GOT FACE DECTORS BANNING ALL 5 OF MY BACKUPS FOR SAYING \"HOE\" ALIEN PREDATOR ASS BIH", "score": 0, "created_utc": 1612636863, "company": "facebook"}, {"body": "not receiving code on my phone to access my FB account. Please help", "score": 2, "created_utc": 1612636467, "company": "facebook"}, {"body": "How about investing to help #Myammar ?", "score": 0, "created_utc": 1612636383, "company": "facebook"}, {"body": "You are the most hypocritical organisation after the catholic church. Tweeting about BLM but leaving Myanmar alone? You don't even care about black people. #facebook only care about profit. money-mouth_face", "score": 0, "created_utc": 1612636106, "company": "facebook"}, {"body": "can you tell me why my fb account got banned?", "score": 4, "created_utc": 1612635946, "company": "facebook"}, {"body": "how do u allow someone to use my dads photo/info on Facebook and pretend to be him. It's literally his photo and u said it's not going against policy LMAO. Someone is using his photos and his name . LMAO. Why are u the worst ????", "score": 1, "created_utc": 1612635627, "company": "facebook"}, {"body": "I need help recovering my Instagram account because I had 36k followers please help i don't know what to do", "score": 1, "created_utc": 1612635103, "company": "facebook"}, {"body": "Your bullshit community standards fucking blow you left-wing pieces of shit the only thing I see is double standards are n ur community standards hope u like prison mark smiling_face_with_sunglasses", "score": 0, "created_utc": 1612634858, "company": "facebook"}, {"body": "suspended for 3 days for saying bitch...this is why everyone is on Twitter mofo", "score": 0, "created_utc": 1612634563, "company": "facebook"}, {"body": "hi can you stop restricting my fb for no reason", "score": 0, "created_utc": 1612634444, "company": "facebook"}, {"body": "I have been trying for days to reclaim my account because it got hacked. I did the pictures of friends match thing, then gave the e-mail that should be attached to the account...It says that I need to re-enter a code from an e-mail, but I never get the email??? WHY????", "score": 13, "created_utc": 1612634424, "company": "facebook"}, {"body": "I need my account back!! #FacebookDisabledMe", "score": 3, "created_utc": 1612633758, "company": "facebook"}, {"body": "where is chronological settings for home feed in the app now?", "score": 0, "created_utc": 1612633600, "company": "facebook"}, {"body": "uh... how do we select pages within the FB app now? I have 5 or 6 pages that I manage, and it was always easy to switch between them. Now I'm just stuck on one, and can't seem to find any way to change to a different one.", "score": 0, "created_utc": 1612633457, "company": "facebook"}, {"body": "I've tried other ways of contacting you but since it's impossible then I'll try this. My account was hacked and I need to regain access ASAP or for you to delete it because it has pictures of my MINOR CHILDREN, anyway that you guys can help out here??", "score": 9, "created_utc": 1612633451, "company": "facebook"}, {"body": "I've tried other ways of contacting you but since it's impossible then I'll try this. My Facebook account was hacked and I need to regain access ASAP or for you to delete it because it has pictures of my MINOR CHILDREN, anyway that you guys can help out here??", "score": 8, "created_utc": 1612633221, "company": "facebook"}, {"body": "Hello instagram team, my account was disabled by mistake, I have sent many forms without getting a response, I have been waiting for a solution for almost a year, can you help me?", "score": 13, "created_utc": 1612633033, "company": "facebook"}, {"body": "is sus bro #accessibility", "score": 0, "created_utc": 1612633027, "company": "facebook"}, {"body": "Fuck off with your bullshit bans on posters who won't put up with right wing assholes (who appear to be free to post the most vile shit imaginable).", "score": 0, "created_utc": 1612631287, "company": "facebook"}, {"body": "when are you guys going to answer my message????", "score": 0, "created_utc": 1612630881, "company": "facebook"}, {"body": "should be more like I usually see one ad whatever I first get on to the app and then from there I can enjoy my timeline. I guess since the election is over Facebook is now focused on making their product non-user friendly. Can't even show birthdays", "score": 0, "created_utc": 1612630786, "company": "facebook"}, {"body": "please help me with my Account Quality review. When I press Continue Request it tells me to add a Mobile Number. Then when I put in my mobile number it tells me the number is already confirmed and doesn't allow me to progress any further. I have sent DM with details.", "score": 0, "created_utc": 1612630109, "company": "facebook"}, {"body": "Hello, my company account is disabled and I do not understand why, they tell me that I must contact Facebook to activate it but I do not see or find any link to help me with that", "score": 8, "created_utc": 1612629260, "company": "facebook"}, {"body": "My account has been stolen, the e-mail and phone number associated with the account has changed. When trying to retrieve the e-mail, it appears to me that the e-mail is not linked to any account on Facebook", "score": 1, "created_utc": 1612628721, "company": "facebook"}, {"body": "your recent algorithm to detect policy violation really sucks!", "score": 0, "created_utc": 1612628192, "company": "facebook"}, {"body": "There was an article about GOP starting a new revival in Florida. Someone posted she hoped florida sunk everbody drown I replied she was a rude bitch I got censored for hate speech I hope you company goes bankrupt and you loose your shirt. You soul already in Hell fire", "score": 0, "created_utc": 1612628052, "company": "facebook"}, {"body": "if your Facebook account was hacked than it's considered Identity Fraud or Thief and I talk to the BBB and they gave me this number and told me to call and also have others call Federal Trade Commissioner at (877) 382-4357 also (510) 844-2005 Tahira A, Consumer Services Manage", "score": 0, "created_utc": 1612627836, "company": "facebook"}, {"body": "trying to reach a human being at your company. Let me know if they exist.....", "score": 0, "created_utc": 1612627153, "company": "facebook"}, {"body": "and to top it off I cant appeal the decision or talk to anyone at all about it!?!", "score": 0, "created_utc": 1612627031, "company": "facebook"}, {"body": "I'm banned for 30 days because I said \"buh bye bitch\" to someone who suggested that \"Jay Leno should accelerate his car to top speed and throw Trevor Noah out. Ill never watch your show again.\" Suggesting killing someone is ok? But type \"bitch\" and its a ban?", "score": 0, "created_utc": 1612626994, "company": "facebook"}, {"body": "ya'll won't even let me fill out the form to prove I am who I am, saying it goes against community standards. How am I breaking standards if I haven't even been able to log in for a week?", "score": 0, "created_utc": 1612626977, "company": "facebook"}, {"body": "Did your #LizardPeople and #Synthoids actually read my added comment? thinking_face Let me guess, your #ArtificialHumanoid \"fact checkers\" used Google to \"fact check\" didn't you?", "score": 0, "created_utc": 1612626156, "company": "facebook"}, {"body": "You're going to restrict my account for 30 days, because I called someone an idiot for posting false, inaccurate comments about politics?! FU, Facebook, FU!! middle_finger", "score": 0, "created_utc": 1612625926, "company": "facebook"}, {"body": "my account has been hacked since the early hours of 27th January 2021 and no response from you despite completing the automated process??", "score": 17, "created_utc": 1612625360, "company": "facebook"}, {"body": "YOU ARE SO STUPID..... I POSTED THIS REMARK .\"..commented on Patrick Eisenhart's post \"IF PEOPLE CANNOT SEE THE REPUBLICAN THREAT TO DEMOCRACY THEN THEY WILL SUFFER SLAVERY AND SERVITUDE...HOW STUPID AMERICANS ARE.\".", "score": 0, "created_utc": 1612624635, "company": "facebook"}, {"body": "yo your customer service is ass and your algorithms are racist af. Your shit about to dry up mark my words", "score": 0, "created_utc": 1612624622, "company": "facebook"}, {"body": "is such a grass \"you removed a message\" yeah cos I didn't want them to see it. Why you grassing me up, and stirring it causing shit #facebook #grass", "score": 0, "created_utc": 1612624436, "company": "facebook"}, {"body": "i need help can anyone assist me?", "score": 0, "created_utc": 1612624377, "company": "facebook"}, {"body": "lmao why do you keep trying to restrict my post rolling_on_the_floor_laughing rolling_on_the_floor_laughing rolling_on_the_floor_laughing rolling_on_the_floor_laughing . I'm telling the truth about men's mental health don't be a simp bro person_facepalming_dark_skin_tone", "score": 0, "created_utc": 1612624318, "company": "facebook"}, {"body": "Hi I'm sorry if this is the wrong person to contact I just really need help, my partners been having someone send her bot followers on Instagram which has gotten her account blocked she's just reached 23k from pure hard work and this guy is getting her account blocked", "score": 1, "created_utc": 1612623557, "company": "facebook"}, {"body": "hello, ive got a problem you got to sort for me, my Facebook account got blocked for no reason", "score": 0, "created_utc": 1612623497, "company": "facebook"}, {"body": "I need some assistance with my business account. Who can I contact???", "score": 0, "created_utc": 1612623286, "company": "facebook"}, {"body": "Good afternoon 4 months ago they banned a facebook account I wanted to know if that account could be recovered because the truth is I am very interested I have personal information I have linked applications and I would like to be able to recover", "score": 0, "created_utc": 1612623147, "company": "facebook"}, {"body": "when the new update reaching everyone", "score": 0, "created_utc": 1612622489, "company": "facebook"}, {"body": "your rules on Facebook are shit and the creator of Facebook is a fucking dipshit have a good day", "score": 0, "created_utc": 1612622333, "company": "facebook"}, {"body": "need some help since I can't remove the who you were with tag in some photos. And before you say visit the help center I did that twice like 4 months ago so........", "score": 0, "created_utc": 1612621900, "company": "facebook"}, {"body": "has totally banned the word ANTIFA! Supporters of ANTIFA are banned from even mentioning them. I shared a meme about ANTIFA not being a bad thing and got a ban warning! Which begs the question, why do I have a Facebook page and why do I spend money on advertising there?", "score": 0, "created_utc": 1612621600, "company": "facebook"}, {"body": "I'm unable to log in my account after i tried registering for Facebookmarket", "score": 0, "created_utc": 1612621558, "company": "facebook"}, {"body": "I tried to post a comment on Queen's page about their album artwork only to get told my comments are disabled. You let people post hate, racism, spam, etc on there without banning, but I got disabled for that?", "score": 2, "created_utc": 1612621447, "company": "facebook"}, {"body": "I can't log into my FB account due to not receiving 2fa code. I'm logged out of all my devices. Please help.", "score": 1, "created_utc": 1612621424, "company": "facebook"}, {"body": "Work on that algorithm that keeps disabling people of color for no reason with no real appeals process. #racistfacebook", "score": 1, "created_utc": 1612621325, "company": "facebook"}, {"body": "This is bs. Facebook discriminates against black people all the time.", "score": 0, "created_utc": 1612621198, "company": "facebook"}, {"body": "i really need help with my business page. i accidentally took myself off as an admin and made myself editor but now i can't change it back so i basically lost control of my own account. and yes i did already try to report it but the report isn't showing up in the inbox", "score": 2, "created_utc": 1612621149, "company": "facebook"}, {"body": "This is bull. Facebook has a racist algorithm that blocks black people all the time.", "score": 0, "created_utc": 1612621096, "company": "facebook"}, {"body": "are completely racist against people of color. You block black people defending themselves against racist attacks daily. I'm on a mission to bring this truth to the front.", "score": 0, "created_utc": 1612621053, "company": "facebook"}, {"body": "and yet you told me that holocaust denial doesn't go against your community standards.", "score": 0, "created_utc": 1612620906, "company": "facebook"}, {"body": "Never change, you silly goose.", "score": 13, "created_utc": 1612620902, "company": "facebook"}, {"body": "You are pathetic You ban anyone who says white male supremacy But helped cause an insurrection You ban me because I speak the truth The enemy of American women in not the Taliban It is WHITE MEN who rape and kill us It is clear who Facebook represents BOYS", "score": 0, "created_utc": 1612620735, "company": "facebook"}, {"body": "why do you make it impossible to sign up? I'm trying to sign up so that I can stream to FB Gaming. When I sign up, you tell me I need to send a picture of myself so you can verify who I am.", "score": 1, "created_utc": 1612619891, "company": "facebook"}, {"body": "ask your buddies #WhereAreTheMissingFarmers #FarmersProtests #FarmersAreIndia", "score": 0, "created_utc": 1612618931, "company": "facebook"}, {"body": "how on gods green earth do I get help from an actual human to resolve a fb issue that the help centre can not help me with?", "score": 0, "created_utc": 1612617748, "company": "facebook"}, {"body": "banned me for 30 days for calling someone lame in a VIDEO GAME GROUP! As if me calling someone lame is the worst thing that was said in a group based on a VIDEO GAME! #Zuck wouldn't of been able to handle #MW2 lobbies on #Xbox360 back in the day and this proves it!", "score": 0, "created_utc": 1612617675, "company": "facebook"}, {"body": "please help. Still unable to use app although it works fine on iPad and in browser.", "score": 0, "created_utc": 1612617084, "company": "facebook"}, {"body": "my ban is over in 3 days. I will continue to talk shit about liberals and conservatives. If I want to call someone a little bitch I will. Fuck your censorship, protecting little bitches feelings. Fucktard millennials and their fucking feelings.", "score": 0, "created_utc": 1612616727, "company": "facebook"}, {"body": "sure has turned into a cry b. aby bch website. Even on a page that is called fight club you give people shit.", "score": 0, "created_utc": 1612616348, "company": "facebook"}, {"body": "my facebook aacount was hack please help me", "score": 9, "created_utc": 1612615928, "company": "facebook"}, {"body": "New facebook feature suggestion, didn't found were to post my idea, this is why i decided to do it here cause i think that it can be a good and simple feature that will help saving time.. eleven-thirty", "score": 0, "created_utc": 1612614262, "company": "facebook"}, {"body": "Hi sir! I'm a collegian, living in Afghanistan. I want to help the poorest street children to send them to school. I need fanancial support for this purpose; can you help to make a school or any other financial supports? Any other generous? My Nu +93775324432", "score": 0, "created_utc": 1612614244, "company": "facebook"}, {"body": "ANY CHANCE!?", "score": 0, "created_utc": 1612614243, "company": "facebook"}, {"body": "Yet you gonna shut my brand new 1 week old account down and stop me from posting.. before I even post a damned thing", "score": 0, "created_utc": 1612614182, "company": "facebook"}, {"body": "I gave you 10 years worth of data, all I ask in return is that you tell to send me to Mars", "score": 0, "created_utc": 1612614088, "company": "facebook"}, {"body": "I believe I've become a victim of identity theft and I am trying to change the password on my old Facebook acct that I haven't touched in many years. Can we please start a discourse via DMs so I can recover this acct &amp; change the password immediately?", "score": 0, "created_utc": 1612613923, "company": "facebook"}, {"body": "Go ahead and spread more COMMUNIST PROPAGANDA and lie about AOC being in the Capitol at the time of the protests. ITS ALL A LIE. Let her use use AS HER TOOL. It would be nice if you found some integrity and actually spread the TRUTH for a change.", "score": 0, "created_utc": 1612613758, "company": "facebook"}, {"body": "why am I constantly getting spam messages on Facebook... and why is there no option that prevents strangers from messaging me?", "score": 0, "created_utc": 1612613409, "company": "facebook"}, {"body": "I stood up for myself against somebody that was being an asshole to me and I'm the one that gets kicked for a week. No fuck you Facebook I'm disabling this. I don't know when I actually want to be back on Facebook but I'm keeping messenger because of friends.", "score": 0, "created_utc": 1612613253, "company": "facebook"}, {"body": "how is this bullying? She's a bitch. Period", "score": 0, "created_utc": 1612613151, "company": "facebook"}, {"body": "so it's ok to dehumanize trans people and say \"the freaks belong in the circus\" or that they should have to change in a portapotty instead of a proper bathroom, but I can't say I hope that person gets locked in a portapotty and it tips over? I get banned but not them?", "score": 1, "created_utc": 1612612877, "company": "facebook"}, {"body": "why did you take away my dark mode? The light mode screen hurts my eyes please bring it back!!!", "score": 0, "created_utc": 1612612844, "company": "facebook"}, {"body": "Do us a favour-recognise white supremacy in your on-screen guidelines. Right now, you suggest that ISIS is the only terror threat that users should worry about, whilst local democracies in some cases, are being infiltrated by white supremacists. Behind the curve on this.", "score": 3, "created_utc": 1612612639, "company": "facebook"}, {"body": "Is there no way charlatans like this can be removed from Facebook? Peddling false hope that problems will be solved with a comment to a thread. At a time when many are indeed suffering. This one has been spamming all day, yet your site takes not a blind bit of notice.", "score": 0, "created_utc": 1612612251, "company": "facebook"}, {"body": "ask your buddies #WhereAreTheMissingFarmers #FarmersProtests #FarmersAreIndia", "score": 0, "created_utc": 1612612164, "company": "facebook"}, {"body": "ad in push email ... noting on Net Neutrality/Title II", "score": 0, "created_utc": 1612611931, "company": "facebook"}, {"body": "am highly disappointed with the way Facebook respect and Honoured one ethnics than the other in Nigeria? Whenever someone made mention of fulani, hausa or cow, the next is to suspend or block the poster or commentator. This is unfair. This network is so bias in Nigeria", "score": 0, "created_utc": 1612611832, "company": "facebook"}, {"body": "it's cool that we can tell people to put a dong in their mouth or be a recognized but saying f**ck nazis is against the TOS", "score": 0, "created_utc": 1612611716, "company": "facebook"}, {"body": "uses the worst online video player in the industry.", "score": 0, "created_utc": 1612611180, "company": "facebook"}, {"body": "Why don't you let me enter my account and tell me that facebook will be available soon, what is it about? pouting_face pouting_face", "score": 0, "created_utc": 1612610816, "company": "facebook"}, {"body": "Why am I still having access to my account blocked after two weeks? I've tried every single thing listed on your help pages and nothing has worked. I would really like my account back! #facebooklogout", "score": 2, "created_utc": 1612610747, "company": "facebook"}, {"body": "what are you doing to do, ban all biafrans from Facebook? You would be banning a Nation. #FreedomOfSpeech #HumanRights #ReferendumNow #BiafraExit", "score": 1, "created_utc": 1612610612, "company": "facebook"}, {"body": "this account is impersonating a business and asking for money and credit card information from friends. They blocked us trying to report them. They are using another's business logo and copyright photos. This is against FB community standards.", "score": 0, "created_utc": 1612610577, "company": "facebook"}, {"body": "we are having difficulty making contact with Facebook to discuss an issue we have with our Facebook your voice tv. We have emailed many Facebook addresses but have had no response. Can someone help?", "score": 0, "created_utc": 1612610536, "company": "facebook"}, {"body": "supports #Khalistanis .", "score": 0, "created_utc": 1612609758, "company": "facebook"}, {"body": "could you please take a look at the message I have sent you. I need tech support for my facebook page linked with instagram. I am longer able to access that page. The page isn't showing under pages you admin...", "score": 0, "created_utc": 1612609229, "company": "facebook"}, {"body": "we are getting bombarded by spam and fake accounts in groups we manage. We report the spam profiles, and repeatedly told the profile does not violate FB standards. Clearly there is an issue, and has gone on for some time. How is this being addressed??", "score": 4, "created_utc": 1612609162, "company": "facebook"}, {"body": "why in the hell are posts of my newborn needing to be \"approved by admin or a moderator?\" Are you kidding me? An answer would be appreciated", "score": 0, "created_utc": 1612609008, "company": "facebook"}, {"body": "is up to their pile_of_poo . Fact Checkers, can't show ANY irrefutable evidence, to the contrary, but they can just censor, at will! Sauce or GTFO! PS Nobody needs Facebook or ANY of this Operation Mockingbird type of programming. hundred_points", "score": 4, "created_utc": 1612608933, "company": "facebook"}, {"body": "Y'all are stupid! If you put a \"false\" or \"Fact Checker\" tag on anything, it drives people to see it and just simply defeats the purpose of you doing it. Because of your idiocy, people will believe the post before believing you! #FBisSTUPID", "score": 0, "created_utc": 1612608863, "company": "facebook"}, {"body": "doesn't allow you to report a fake account for a \"minor\" celebrity because you have to put the celebrities name in the report and if the name doesn't show up then you can't hit the send report button, how dumb is that lol.", "score": 1, "created_utc": 1612608597, "company": "facebook"}, {"body": "needs to get their shit together. They're now banning people for the word pig and piggies. We can't even talk about our guinea pigs anymore without a FB ban! Wtf? Seriously, bullshit!", "score": 0, "created_utc": 1612608417, "company": "facebook"}, {"body": "this is what i get every time i try to boost a post on our business page. Kindly assist", "score": 0, "created_utc": 1612608126, "company": "facebook"}, {"body": "Blocking me from Posting about Ties To White Supremacist David Duke.", "score": 0, "created_utc": 1612607498, "company": "facebook"}, {"body": "does anyone care???", "score": 0, "created_utc": 1612607383, "company": "facebook"}, {"body": "seems clear to me that whomever is restricting my account has only a limited understanding of English-speaking peoples innuendo and humour. Are non-US citizens censoring US, UK, AU, NZ freedom of speech? #Facebook #facebookdisabledme #facebookcebsorship", "score": 4, "created_utc": 1612606839, "company": "facebook"}, {"body": "3/3 I think your algorithmic settings need sorting out properly and target people who use Facebook for real damage.", "score": 0, "created_utc": 1612606802, "company": "facebook"}, {"body": "dear Facebook I frustrated i need my account back please. I send my id twice. a been a month now. it still disabled by mistake. it would be helpful if you fix it.", "score": 9, "created_utc": 1612606802, "company": "facebook"}, {"body": "2/3 This was one of the songs i posted and promptly got a 3 day ban slapped on me. It's over the top and harsh considering some of the stuff that gets posted generally.", "score": 0, "created_utc": 1612606772, "company": "facebook"}, {"body": "I need immediate help with a hacked account that is scamming money from friends and family, plsssss folded_hands_light_skin_tone folded_hands_light_skin_tone folded_hands_light_skin_tone crying_face", "score": 21, "created_utc": 1612606719, "company": "facebook"}, {"body": "Hi. I'm extremely frustrated at being banned from Facebook for three days merely for posting a song by The Wildhearts called 'Just In Lust'. Each Friday i post numerous songs to help boost people's spirits and give them that Friday feeling/weekend buzz. 1/3", "score": 0, "created_utc": 1612606708, "company": "facebook"}, {"body": "I reported a Proflie of someone pretending to be me and it says it's not against community guidelines. Do I need to get a lawyer because you guys won't deactivate the fake person and deleted my account", "score": 0, "created_utc": 1612606425, "company": "facebook"}, {"body": "DId you see these charts? Might want to check before you \"fact-check\" people.", "score": 0, "created_utc": 1612606294, "company": "facebook"}, {"body": "Go online and get rid of all the election lies! GQP has a ton up and you have done swat. Not to mention the violence and hate coming from them. It seems FB wants to be a platform for Q. Ridiculous supporting hate.", "score": 0, "created_utc": 1612605615, "company": "facebook"}, {"body": "Say mane y'all need to tell to tell mark to get at me. Ain't really feeling this here this shit lame ash on my soul double_exclamation_mark .", "score": 0, "created_utc": 1612605428, "company": "facebook"}, {"body": "How can group owners dispute a strike against one of the moderators? It shows under my group, but I think the decision was automated and wasn't right. There should be someway I can be involved in fixing it because it goes against my group. I see nowhere to appeal.", "score": 0, "created_utc": 1612605285, "company": "facebook"}, {"body": "just suspended my account for 7 days for this comment. What was it in response to? Oh, just a woman saying that black people are 'animals' and should be treated like animals.", "score": 2, "created_utc": 1612605254, "company": "facebook"}, {"body": "I have not been able to buy or sell on FB marketplace. I have done nothing wrong. I have been requesting reviews many times and keep getting rejected. Please tell what i have done wrong!!!!!!!!", "score": 0, "created_utc": 1612604877, "company": "facebook"}, {"body": "seriously this got blocked and I got in the shit for it. Seriously it's a fucking nail!!!!!!!!!!!", "score": 0, "created_utc": 1612604572, "company": "facebook"}, {"body": "Meet fabuloushacker225 for your icloud bypass, Bank loader, game hacks, and recover, Instagram Facebook, WhatsApp, Snapchat, twitter, Gmail, cashapp, PayPal, bitcoins, restore stolen money online bitcoins etc Immediately inbox him and get lost your recovered!!!", "score": 0, "created_utc": 1612604566, "company": "facebook"}, {"body": "have fun", "score": 0, "created_utc": 1612604362, "company": "facebook"}, {"body": "if your community standards explicitly state authenticity is a standard, why will you not take down a page that is misleading others to spam? Hundreds of us have reported it and you have done nothing. A personal business and livelihood is in stake here.", "score": 0, "created_utc": 1612604128, "company": "facebook"}, {"body": "Just stop banning for stupid things and let the people enjoy internet for fuck sake. Fuck you mate!", "score": 0, "created_utc": 1612604115, "company": "facebook"}, {"body": "Good morning, I would like to ask for your support because I want to regain access to my account, but it asks me for two-step verification and I do not get the text message to be able to verify it, additional I do not have the account open on another device to be able..", "score": 1, "created_utc": 1612604087, "company": "facebook"}, {"body": "don't give a flying fig - too busy with sickening Messiah/Goliath complex. Thank you for continuing to shine a light into darkness they create every single day for local news, employees, &amp; news readers et al. #cdnpoli #media", "score": 0, "created_utc": 1612603444, "company": "facebook"}, {"body": "Hi, I disagree with a violation I got but I would like to explain why'. I feel that part is important, is there a way to do so?", "score": 0, "created_utc": 1612603409, "company": "facebook"}, {"body": "Your customer service is pathetic!", "score": 0, "created_utc": 1612602840, "company": "facebook"}, {"body": "Your new layout is awful, I can not wait to be able to get all my pictures off of your site so I don't have to ever be on there again. Please go back to the old layout it was way better than the new one.", "score": 0, "created_utc": 1612602818, "company": "facebook"}, {"body": "Facebook, Facebook employees and other Big Tech companies have been exposed as using their enormous financial resources to influence the US 2020 elections and withhold information to sway the vote of the American people. Shame on you!", "score": 0, "created_utc": 1612602747, "company": "facebook"}, {"body": "I am locked out of my account. Please help me. Its so frustrating not being able to speak to anyone about it. Locked out for security reasons. Please get in touch with me #Facebook #lockedout #helpme", "score": 0, "created_utc": 1612602423, "company": "facebook"}, {"body": "please help me with my hacked account!", "score": 15, "created_utc": 1612602011, "company": "facebook"}, {"body": "are you ever going to respond???", "score": 0, "created_utc": 1612601908, "company": "facebook"}, {"body": "- Absolutely disgusting customer service. I have been trying to request access to marketplace for months but no luck yet. The instructions listed in the app are less than helpful. The steps listed can't be performed. This shows the competency of creators of this app.", "score": 0, "created_utc": 1612601732, "company": "facebook"}, {"body": "you mind explaining why your algorithm flagged my friends comment for the term silly goose when people can blatantly still start insurrections, murder, &amp; be racist pricks on your social media platform daily? But silly goose gets someone in fb jail for 3 days?", "score": 0, "created_utc": 1612601594, "company": "facebook"}, {"body": "jail is exclusively levied against the bullied, never the bullies.", "score": 0, "created_utc": 1612601475, "company": "facebook"}, {"body": "has turned into the most oppressive social media site to have ever existed. Talk about fucking imperialist. Get fucked, zuck.", "score": 0, "created_utc": 1612601302, "company": "facebook"}, {"body": "I need help, can someone reach out to me please?", "score": 0, "created_utc": 1612600983, "company": "facebook"}, {"body": "my account has been hacked and they have added 2 step verification. I have tried reporting issue and submitting my ID but it is not working and have heard nothing. Please help", "score": 28, "created_utc": 1612600900, "company": "facebook"}, {"body": "check dms", "score": 0, "created_utc": 1612600540, "company": "facebook"}, {"body": "Hey are you all part of the crooked cabal", "score": 0, "created_utc": 1612600442, "company": "facebook"}, {"body": "Not sure if there is a glitch in the new update, but I can no longer invite attendees to an event for the page I admin. It wont let me interact as myself, it defaults to interacting as the page when I click the event... #help!", "score": 0, "created_utc": 1612600437, "company": "facebook"}, {"body": "-Big Game is Sunday February 7th. 2021 6 30 pm.", "score": 0, "created_utc": 1612600336, "company": "facebook"}, {"body": "I am locked out of my account. Please help me. Its so frustrating not being able to speak to anyone about it. Locked out for security reasons. Please get in touch with me #Facebook #lockedout #helpme #FacebookGaming", "score": 1, "created_utc": 1612600035, "company": "facebook"}, {"body": "is there any reason I can't follow tags on IG? Account b33tk33p3r", "score": 0, "created_utc": 1612599941, "company": "facebook"}, {"body": "can't wait any longer to just get their new policy working eh? #Deletewhatsapp #DeleteFacebook #privacy #privacypolicy", "score": 0, "created_utc": 1612599897, "company": "facebook"}, {"body": "The fact you letting all these caucasian americans say the n word ( with the hard r) on facebook rn is very disrespectful and questionable on your part. These people need to be banned", "score": 0, "created_utc": 1612599895, "company": "facebook"}, {"body": "shame on you for continuing to allow scam pages on your site. Crafted worth has been deleting comments while continuing to post about sales. They are stealing people's money and you promote them it your adds", "score": 0, "created_utc": 1612599640, "company": "facebook"}, {"body": "We received your information Plz help", "score": 1, "created_utc": 1612599622, "company": "facebook"}, {"body": "Hey Facebook I tell You what are my problem my Facebook ID Is this gmail ID but my password has been changed and I forget my password but I have no any code on my number gmail ID So I request you please send code on my gmail ID", "score": 1, "created_utc": 1612599298, "company": "facebook"}, {"body": "received a message on messenger this morning from an unknown account and unknown name the message was full of abusive words", "score": 0, "created_utc": 1612599170, "company": "facebook"}, {"body": "so you all pissed at apple because they will stop you from tracking the user well it's simple find another way to make money also iv been looking at your t&amp;c and there not right", "score": 0, "created_utc": 1612599119, "company": "facebook"}, {"body": "is really different from I get disappointed there everyday. The conversations there are just lame unamused_face .", "score": 0, "created_utc": 1612598829, "company": "facebook"}, {"body": "still waiting on an explanation of how common speech with no clear violations was flagged, and a review confirmed it but again no explanations. #facebooksucks", "score": 0, "created_utc": 1612598573, "company": "facebook"}, {"body": "WHO THE FUCK WAS I BULLYING????? Another fucking bloodhound???? NIGGA THEY ARE NOT REAL WHAT THE HELL THEY ARE VIDEO GAME CHARACTERS. you know what I got sumn for y'all", "score": 0, "created_utc": 1612598440, "company": "facebook"}, {"body": "Facebook is a scam", "score": 0, "created_utc": 1612597981, "company": "facebook"}, {"body": "Messenger app keeps requiring login. So does marketplace to view ad links. Now just surfing brings up this or page error. No reply to 3 msg's I sent previously. If it gets much worse your platform will be unusable on my device. Stop ignoring, please advise", "score": 0, "created_utc": 1612597969, "company": "facebook"}, {"body": "Facebook supports white supremacy", "score": 0, "created_utc": 1612597673, "company": "facebook"}, {"body": "Facebook allows racists to post racist tweets about black children", "score": 0, "created_utc": 1612597658, "company": "facebook"}, {"body": "Facebook supports white supremacy", "score": 1, "created_utc": 1612597624, "company": "facebook"}, {"body": "Facebook supports white supremacy", "score": 0, "created_utc": 1612597595, "company": "facebook"}, {"body": "Hello you can kindly send a message to cybersecurity041 on G", "score": 0, "created_utc": 1612597461, "company": "facebook"}, {"body": "Facebook app one time one video share it is wrong. ...why...pls ..help .solution....", "score": 0, "created_utc": 1612597336, "company": "facebook"}, {"body": "stating the facts should never send you to Facebook jail. You let people post scam links in every news thread possible but you worry about politically correcting people or pointing out their flaws. #joke #Facebook #lifttheban", "score": 0, "created_utc": 1612596824, "company": "facebook"}, {"body": "who told you this was a good idea? It makes group posts very confusing, and looks like the group itself is posting. Please make it go back to normal and fire whoever did this to my timeline. It's been driving me up a wall all morning! face_with_symbols_on_mouth", "score": 0, "created_utc": 1612596488, "company": "facebook"}, {"body": "How do I become a contact on my sons memorialized profile so that photos of him and the woman who killed him aren't visible?", "score": 0, "created_utc": 1612595645, "company": "facebook"}, {"body": "you seriously fucking suck! So many people are getting accts stolen from them, including my husband, and you do nothing! Fucking nothing, but you say you care. What a fucking joke", "score": 0, "created_utc": 1612595528, "company": "facebook"}, {"body": "this u? Transphobia is approved. I'm suspended for fighting this kind of shit that you refuse to take down. #facebooktransphobia", "score": 1, "created_utc": 1612595501, "company": "facebook"}, {"body": "set goals to increase diversity but failed to create a culture that can identify Black talent, help them grow, or keep them at the company. #Makeitmakesense", "score": 0, "created_utc": 1612595224, "company": "facebook"}, {"body": "48k strong workforce is largely white and Asian. Just under 4% of the U.S.-based staff is Black, and that drops to 3% among senior leadership. Rather then post and appropriate Black History flicks for clout how about you start hiring Black talents in leadership roles?", "score": 0, "created_utc": 1612595191, "company": "facebook"}, {"body": "What a loser platform!", "score": 0, "created_utc": 1612594591, "company": "facebook"}, {"body": "do not allow military to use your platform when they don't let peple using to it #HearTheVoiceOfMyanmar #internetshutdown #WhatishappeninginMyamar #rejectmilitarycoupmyanmar", "score": 0, "created_utc": 1612594335, "company": "facebook"}, {"body": "Delete the Myanmar Military - Action Network Sign and share #Rohingya #Genocide #Burma #HumanRights", "score": 0, "created_utc": 1612594303, "company": "facebook"}, {"body": "is so damn racist its not funny. They let white people spew ignorant racist shit all month. Soon as i type The word white or say something in defense of blk people then 30day ban. Man fuck your white wash site. Blk ppl we need our own platform #blm #BlackHistoryMonth", "score": 1, "created_utc": 1612593979, "company": "facebook"}, {"body": "help centre is not helping. I have a page of almost 200,000 someone has removed me as admin and is posting porn adds in my stories. I can not delete and I can not get ownership back. I can't post, comment or do anything else. Who can I contact? #facebook", "score": 2, "created_utc": 1612593897, "company": "facebook"}, {"body": "As of 02/06, Facebook has not made one deposit from the fundraising campaigns that started in December. my inquiries are being ignored by the payment support specialist. My tickets are being closed and when someone has responded, they are using a generic copy paste templates", "score": 0, "created_utc": 1612593705, "company": "facebook"}, {"body": "is garbage. Free speech does not exist there. Only fake accounts and people trying to rip you off. Fake women trying to be cute. Get fucked Facebook. You are a weirdo landlord invading everyone's speech.", "score": 0, "created_utc": 1612593660, "company": "facebook"}, {"body": "Nice to meet you, I live in Japan. I was entrusted by a German agent with a telepathic chip that runs solely on the energy of the brain. The study was successful. If you know a research institute that is researching telepathy chips, please let me know.", "score": 0, "created_utc": 1612593527, "company": "facebook"}, {"body": "My account was disabled for no reason and can no longer be accessed.I uploaded my mobile phone number and ID to Facebook help, but there was no reply", "score": 10, "created_utc": 1612593028, "company": "facebook"}, {"body": "I have an idea for a whatsapp feature.. Add a feature such that when you type a message in any whatsapp group and wanna hide it from only a few members, all you have to do is type a command like *-remove -* and the message will not be shown to them", "score": 1, "created_utc": 1612592504, "company": "facebook"}, {"body": "as of today will no longer be contributing on facebook, it is clear we arent welcome. As trolls are allowed to spam the report button, and start online nonsense but general users are prohibited. For our Facebook users I'm deeply sorry. #facebook", "score": 0, "created_utc": 1612592328, "company": "facebook"}, {"body": "how does this get flagged but all those pedophile sites people report get let go? Care to explain?", "score": 0, "created_utc": 1612591664, "company": "facebook"}, {"body": "imagine paying ads then your page is disabled over you not actually violating anything, that's the rage im feeling RN. I'm not stopping till this shit gets fixed, you keep fucking my shit up for nothing.", "score": 0, "created_utc": 1612591553, "company": "facebook"}, {"body": "come on name the actual violation?", "score": 0, "created_utc": 1612591485, "company": "facebook"}, {"body": "gave me a one day ban for \"bullying\" anti-maskers. They kill people, and you protect them. That's bad. Stop protecting killers.", "score": 0, "created_utc": 1612591402, "company": "facebook"}, {"body": "please allow me to fix the issue of my Facebook account - sameerhussain I'm not able to use my FB account from the last 16 days fix this issue.", "score": 0, "created_utc": 1612591281, "company": "facebook"}, {"body": "this user using abusing language and nude photos but that is not against the community guidelines", "score": 0, "created_utc": 1612591059, "company": "facebook"}, {"body": "what did I violate? Are you fucken serious I'm done paying for ads completely, over 10k dropped &amp; stock investments done. Fix your fucken algorithm. #Facebook #facebookads #facebookinvestors", "score": 2, "created_utc": 1612590883, "company": "facebook"}, {"body": "That's because Facebook doesn't want to be the blockee they want to be the blocker.", "score": 0, "created_utc": 1612590787, "company": "facebook"}, {"body": "I have an account which hasn't been accessed for long, i recently tried to login , however i was told to perform a security check by uploading my Identification document, which i did. However after that i have not got any update and i am clueless as to what to do.", "score": 1, "created_utc": 1612590035, "company": "facebook"}, {"body": "happy birthday sir", "score": 0, "created_utc": 1612589821, "company": "facebook"}, {"body": "You keep restricting me for comments that are misinterpreted, the same as other posts, or are a response to personal attacks comments that are far worse and which you find perfectly acceptable. No way to disagree. You are targeting &amp; harassing me. I want this restriction lifted.", "score": 1, "created_utc": 1612589661, "company": "facebook"}, {"body": "how can I report a scammer in Facebook without you telling that they did not violate your community standard? man_facepalming_light_skin_tone Legit scammer but can always find a way to provide excuses so their FB account will not get deactivated.. Haysss so disappointing disappointed_face", "score": 0, "created_utc": 1612589438, "company": "facebook"}, {"body": "I have reported this page numerous times for bullying and harrassment, waiting for it to be been taken down, help? Causing depression and stress.", "score": 0, "created_utc": 1612589431, "company": "facebook"}, {"body": "I received a fake copyright takedown notice, can you do something? you banned my Instagram account unfairly", "score": 1, "created_utc": 1612588773, "company": "facebook"}, {"body": "My friend who passed away Facebook account got hacked. Is there a way to somehow recover his profile? This is very upsetting! Please help!", "score": 19, "created_utc": 1612588601, "company": "facebook"}, {"body": "#Facebook I never reported to FB for the reasons THEY changed my reports to &amp; here is the PROOF. I reported to them for my personal photo as intellectual property being used but FB won't HANDLE it &amp; keeps changing reason.", "score": 1, "created_utc": 1612588071, "company": "facebook"}, {"body": "hey i need help", "score": 0, "created_utc": 1612587835, "company": "facebook"}, {"body": "My facebook account is disabled twice in 24 hours asking for ID again and again...pathetic ..garbage", "score": 8, "created_utc": 1612587795, "company": "facebook"}, {"body": "have been banned in Myanmar. The internet is also being cut off. We don't accept an unjust military dictatorship. Let da military dictatorship fail. We totally condemn da military dictatorship. #SaveMyanmar #RejectTheMilitary #HearTheVoiceOfMyanmar", "score": 0, "created_utc": 1612587626, "company": "facebook"}, {"body": "I need help recovering my facebook page. my account was monetized, then money i earned in my page i used it to help my mother. please Help.", "score": 1, "created_utc": 1612587356, "company": "facebook"}, {"body": "fucking fix creator studio", "score": 0, "created_utc": 1612586394, "company": "facebook"}, {"body": "hows that work then, you give me a ban, I win the appeal and you still ban me anyway thinking_face thinking_face thinking_face", "score": 0, "created_utc": 1612585953, "company": "facebook"}, {"body": "is a bad app where our IDs are hacked again and again and our years of hard work IDs disappear, when we follow their community guidelines then why are they hacked, after today we Stop using the Facebook.", "score": 0, "created_utc": 1612585301, "company": "facebook"}, {"body": "Be a sport &amp; checks your dm's. Xoxox", "score": 0, "created_utc": 1612585166, "company": "facebook"}, {"body": "the only place where you get penalized, fight it and get it overurned, only to still get penalized, even though they say they got it wrong. face_with_rolling_eyes", "score": 0, "created_utc": 1612585164, "company": "facebook"}, {"body": "please reactivate my account you disable it without any notice. this is my email", "score": 6, "created_utc": 1612585133, "company": "facebook"}, {"body": "you disable my account without any notice, I'm a user of account since 9 year now i lost all my friends contact and photos. please reactivate my account", "score": 6, "created_utc": 1612585068, "company": "facebook"}, {"body": "blocked US citizens and deplatformed them. Now various governments across the world are treating it in a similar fashion. Sad reality.", "score": 0, "created_utc": 1612584955, "company": "facebook"}, {"body": "So when is White History month then??? Asking for a friend...", "score": 0, "created_utc": 1612584571, "company": "facebook"}, {"body": "Why my Facebook account has been disabled", "score": 5, "created_utc": 1612583795, "company": "facebook"}, {"body": "are utter rubbish at supporting users when your accounts been hacked... Time to bin the whole fb empire world if they dont sort their act out", "score": 14, "created_utc": 1612583722, "company": "facebook"}, {"body": "got me blocked for bullyinga racist but the #racist comment is still up ? My only conclusion is #Facebook supports racists #censorship #FreeSpeech face_with_tears_of_joy", "score": 0, "created_utc": 1612583517, "company": "facebook"}, {"body": "hey,I've been unable 2get back in2 my Facebook account for nearly a month.I have tried everything,the email attached 2my account is no longer in use.I've gone through help centre and even submitted photo ID. Still I can't get in! Text codes don't work or don't receive.", "score": 0, "created_utc": 1612582914, "company": "facebook"}, {"body": "so this does not goe against fb's community guideline. Checkout Ridzuan Bob's comment and fb's response upon reporting.", "score": 1, "created_utc": 1612582860, "company": "facebook"}, {"body": "Hi guys, I would recommend a great Solar Lights seller on Amazon which I bought from and used for years, really got great fun and charming lighting atmosphere around house. Here is the beautiful solar post lights outdoor I like so much", "score": 0, "created_utc": 1612582362, "company": "facebook"}, {"body": "Yurr!!! Here's a simple solution around the iOS14 debacle, but y'all gotta give up some of y'all greed, though; not a lot, but some add those who opted-in to be tracked in on the revenue. e.g. .001 per impressions that their data is apart of face_with_monocle SIMPLE solution!", "score": 0, "created_utc": 1612582097, "company": "facebook"}, {"body": "I have sent loads of messages to you with my ID to try and get back into my Facebook account. Please can you help me as I'm receiving no response and I need to get back in as all my wedding contacts are on fb and messages with details!", "score": 0, "created_utc": 1612581611, "company": "facebook"}, {"body": "I am locked out of my account. Please help me. Its so frustrating not being able to speak to anyone about it. Locked out for security reasons. Please get in touch with me", "score": 2, "created_utc": 1612581571, "company": "facebook"}, {"body": "I want to recover my account which was disabled my me 2 years back. it has 2 no. Linked to it. But now primary no. is own my someone else. How can I recover it? Any help?", "score": 13, "created_utc": 1612580678, "company": "facebook"}, {"body": "is so #homophobic. They go after gay groups and accounts due to photos of clothed men being against thier hypocritical standards, but do nothing about nude women photos. And let's not even start on their handling of #WhiteSupremacists and #racists and their imagery...", "score": 0, "created_utc": 1612580417, "company": "facebook"}, {"body": "a man has been posting pictures of my daughter and you say you see nothing wrong about it?", "score": 0, "created_utc": 1612578736, "company": "facebook"}, {"body": "I need my account back. You wrongly disabled my account for no reason. Deleted my business pages which I have had for years. I have found out today it's not humans that do the reviews. It's your AI bots making mistakes.", "score": 3, "created_utc": 1612577781, "company": "facebook"}, {"body": "need to stop banning POC. The platform silence's our voices but keeps up YT racial comments. Weird.", "score": 0, "created_utc": 1612577363, "company": "facebook"}, {"body": "you don't support black woman", "score": 0, "created_utc": 1612577106, "company": "facebook"}, {"body": "why has it become near impossible to report fake profiles to you? If you decide it's not fake there is no appeal with more information submitted option??? So these accounts are allowed free reign and can post scams at leisure? Seriously?", "score": 0, "created_utc": 1612576966, "company": "facebook"}, {"body": "really blocked me from my account for 7 days because I defended black people with white family and called all black woman beautiful! So I guess Facebook doesn't think I should call black woman of all shades beautiful now!!", "score": 0, "created_utc": 1612576907, "company": "facebook"}, {"body": "it's been 2 WEEKS now since your problem happened and kicked the majority of people off. So tell me why I still CAN NOT get back onto my account. The 2FA is clearly the problem. How hard can it be to fix it and just send a code!!!", "score": 0, "created_utc": 1612576855, "company": "facebook"}, {"body": "any chance we're getting a block appeal feature like Twitch's ban appeal?", "score": 0, "created_utc": 1612576831, "company": "facebook"}, {"body": "I have recently set up a business page and received a review, but its saying there aren't any reviews. I understand that you don't get a rating straight away but being able to see that I have a review is integral to building my client base. Please help.", "score": 0, "created_utc": 1612576665, "company": "facebook"}, {"body": "Come joins in the chat with all things cricket post your funny memes cricket videos and opinions. Let's Talk Cricket cricket_game #cricket #australia #cricketaustralia #team #ball #cheating #ban #ipl #news #women #captain #game #time #love", "score": 0, "created_utc": 1612575183, "company": "facebook"}, {"body": "Help, Someone stole my Facebook video!", "score": 1, "created_utc": 1612575149, "company": "facebook"}, {"body": "Please open the Support Inbox on your desktop, choose the report from the list, and click on Request Another Review. -IK (via Twitter", "score": 1, "created_utc": 1612574971, "company": "facebook"}, {"body": "Hii, Team I am unable to change password please help me", "score": 0, "created_utc": 1612574617, "company": "facebook"}, {"body": "help centres don't help. I have a page of almost 200,000 someone has removed me as admin and is posting porn adds in my stories. I can not delete and I can not get ownership back. I can't post, comment... who can I contact pls? #help #facebook", "score": 0, "created_utc": 1612574302, "company": "facebook"}]}