{"data": [{"body": "Shantanu NarayenFundamental change is still upon us. Disruption across technology, as well as how you do business is how companies will thrive and economies will survive. #ETCEORoundtable", "score": 0, "created_utc": 1612840378, "company": "adobe"}, {"body": "Shantanu Narayen The future of work is going to be more hybrid and remote, the future of healthcare is going to have a deeper technology component to it. #ETCEORoundtable", "score": 0, "created_utc": 1612840347, "company": "adobe"}, {"body": "CEO Shantanu Narayen I believe digital changes everything. How you're entertained, how you learn, education is going to change, healthcare... the genie is not going to go back into the bottle even after the vaccine emerges. #ETCEORoundtable", "score": 0, "created_utc": 1612840321, "company": "adobe"}, {"body": "Why does your stupid software keep kicking me out and logging me off? I have to keep signing in to my account. Incredible annoying.", "score": 1, "created_utc": 1612835646, "company": "adobe"}, {"body": "Can always trust Adobe to crash and cost you hours of work smiling_face Love y'all", "score": 0, "created_utc": 1612831940, "company": "adobe"}, {"body": "and are my two favorite resources. The picture you see was created by those three apps.", "score": 1, "created_utc": 1612830265, "company": "adobe"}, {"body": "adobe programs literally wont stop logging me out and is counting my computer as 3 different computers logged in, even though im just logged in on one machine. plz help -)", "score": 1, "created_utc": 1612825943, "company": "adobe"}, {"body": "The Gemini picture was boring and plain. I'd appreciate something like the Aquarius one with aliens and pens on it like above. Please, and thank you lol", "score": 0, "created_utc": 1612818759, "company": "adobe"}, {"body": "Shoot me one with the spinning wheel. Thanks", "score": 0, "created_utc": 1612817737, "company": "adobe"}, {"body": "why isn't creative cloud for linux? it's good enough people will buy it.", "score": 0, "created_utc": 1612814028, "company": "adobe"}, {"body": "Can you explain what the highlighted phrase in this font description in means? Thank you.", "score": 0, "created_utc": 1612808995, "company": "adobe"}, {"body": "Why 2020? What about 2021?", "score": 0, "created_utc": 1612807237, "company": "adobe"}, {"body": "If you are interested in 3d animation animations and modelling, subscribe for cool beginner and intermediate tutorials", "score": 0, "created_utc": 1612798242, "company": "adobe"}, {"body": "why is the software that I pay for so shitty??? I've used like three unique computers and none of this is worth it", "score": 1, "created_utc": 1612796570, "company": "adobe"}, {"body": "The WORST product plan ever! Not only I was never told my Stock plan switched to an annual plan, but if I cancel, I have to PAY 60$, PLUS lose the 74 assets I ALREADY paid for!!! Honestly, you should be ashamed!", "score": 1, "created_utc": 1612792979, "company": "adobe"}, {"body": "Imagine people admitting on social media to stealing your software.", "score": 0, "created_utc": 1612792294, "company": "adobe"}, {"body": "I am having difficulties cancelling my subscription. I need my subscription cancelled please.i do not want the service anymore. I need my subscription cancelled", "score": 1, "created_utc": 1612788296, "company": "adobe"}, {"body": "I need my subscription cancelled please. I need my subscription cancelled please. I need my subscription cancelled please", "score": 0, "created_utc": 1612788234, "company": "adobe"}, {"body": "i have had it with this big tech cancel culture trying to tell me i can't fuck up an arby's logo inside of my own computer", "score": 0, "created_utc": 1612788043, "company": "adobe"}, {"body": "Signing in from Turkey, the country where currency is devaluated so much and adobe products are expensive compared to other countries. In UK an individual can purchase it with only 19.9 while we have to pay 132tl Long story short, I want a discount please.", "score": 0, "created_utc": 1612786345, "company": "adobe"}, {"body": "How I feel when I have the Glyphs panel opened with a 1000+ glyph font.", "score": 0, "created_utc": 1612786129, "company": "adobe"}, {"body": "is joining Vanity Fair to support and celebrate diverse voices in creativity. Introducing Vanity Fair's awards issue cover star, a beloved icon whose canon lives on.", "score": 0, "created_utc": 1612785567, "company": "adobe"}, {"body": "is joining Vanity Fair to support and celebrate diverse voices in creativity. Introducing Vanity Fair's awards issue cover star, a beloved icon whose canon lives on.", "score": 0, "created_utc": 1612785500, "company": "adobe"}, {"body": "are looking to talk to users about color grading workflows in Premiere Pro ... give them a shout if you're up for it.", "score": 0, "created_utc": 1612782741, "company": "adobe"}, {"body": "Dear diary I stole this diary from adobe, now I have all the power", "score": 0, "created_utc": 1612782454, "company": "adobe"}, {"body": "Ditch that McAfee bullshit you package with your acrobat reader - I don't want it, no body wants it, and you shouldn't need the money for whatever that deal brings in.", "score": 1, "created_utc": 1612780533, "company": "adobe"}, {"body": "change up your customer service, these remote workers are trash &amp; slow", "score": 1, "created_utc": 1612778731, "company": "adobe"}, {"body": "why are you ruining my love story with Photoshop 2021 looks like my backyard right now... Full of bugs!", "score": 0, "created_utc": 1612775892, "company": "adobe"}, {"body": "the struggle is real eyes", "score": 1, "created_utc": 1612775854, "company": "adobe"}, {"body": "wtf are you doing?", "score": 0, "created_utc": 1612775802, "company": "adobe"}, {"body": "This is what lets you name your layers. NAME YOUR LAYERS! face_with_monocle", "score": 0, "created_utc": 1612775665, "company": "adobe"}, {"body": "OMG, everyone is meme-ing The Weeknd. slightly_smiling_face", "score": 0, "created_utc": 1612775596, "company": "adobe"}, {"body": "CEO has built a legacy in #tech by being one of the longest-tenured CEOs in the valley. He's done it by embracing opportunities for growth and taking good care of his employees along the way. #leadership", "score": 1, "created_utc": 1612774505, "company": "adobe"}, {"body": "How in the world do you get a hold of anyone? I'm trying to talk or chat with an actual person about a three month trial that I cannot access. But of course I can't find any way to contact anyone. person_shrugging_light_skin_tone", "score": 1, "created_utc": 1612769351, "company": "adobe"}, {"body": "what's up with fantastic fold? Dieline says no problems but then refreshes to start folding page.", "score": 0, "created_utc": 1612769072, "company": "adobe"}, {"body": "More than a year without a fix to the problem of the disappearing brush cursor on Photoshop. Will we ever get a fix for that? Or was the \"subscription model will allow us to fix things much faster than before\" just a gimmick to make more money?", "score": 1, "created_utc": 1612767385, "company": "adobe"}, {"body": "Worst experience ever with ePubs and DRM. Sad to see that piracy has a long life ahead because of your lack of understanding and knowledge!", "score": 0, "created_utc": 1612765845, "company": "adobe"}, {"body": "new #ebook, produced in partnership with discusses how to Become an Experience-Led Business with an Agile CX Tech Stack. Read the ebook, here", "score": 1, "created_utc": 1612764619, "company": "adobe"}, {"body": "you have the worst customer service in the entire world! I wish you had competitors!", "score": 1, "created_utc": 1612759064, "company": "adobe"}, {"body": "needs to get onboard with Linux, is still a bit of a tragedy in install department (on Debian-based), and was a surprise there was nothing going on in that dept. Otherwise, game as strong as ever, and making strides!", "score": 0, "created_utc": 1612749976, "company": "adobe"}, {"body": "pls gimme acrobat i need 4 school", "score": 0, "created_utc": 1612745706, "company": "adobe"}, {"body": "I am having trouble with changing one of my Illustrator images to black&amp;white. It is coming off with a peachy pink hue instead of gray. Export as - Grayscale.. any tips? Never happened before", "score": 1, "created_utc": 1612734686, "company": "adobe"}, {"body": "I will suck your dick if you let me edit this video", "score": 0, "created_utc": 1612730517, "company": "adobe"}, {"body": "i tried to repair, uninstall, still can't fix this problem", "score": 1, "created_utc": 1612729544, "company": "adobe"}, {"body": "for those who wish to subscribe to your blooming solutions should watch out not to fall in your trap/ fraud. Customers must watch out and read their bank statement! #fraud #adope #regulators", "score": 1, "created_utc": 1612726577, "company": "adobe"}, {"body": "Blocking advertiser as a protest against Twitter censorship.", "score": 0, "created_utc": 1612712209, "company": "adobe"}, {"body": "yes, I am making a big move with my viral marketing campaign. I really believe that The Federal Express Corporation has the discipline to get involved with me in a viral marketing campaign that will invent the FedEx Manufacturing Division", "score": 1, "created_utc": 1612710765, "company": "adobe"}, {"body": "#4HROS is going to be a mobile operating system that has a strict adherence to business ready for business protocol with its flagship devices including \"Clipboards\" that are tablets designed to capture writing from paper placed on top of the tablet to be built by", "score": 0, "created_utc": 1612710293, "company": "adobe"}, {"body": "ADOBE needs to get down with the underground with and wave the 4HROS flag so the competition knows that commitments are being made ... tweeted because I want to be thorough FedEx is probably not down with the underground they are very above board so think different!", "score": 0, "created_utc": 1612709984, "company": "adobe"}, {"body": "when are you guys gonna add a basic, ABSOLUTELY SIMPLE SPELL CHECK software in Premiere Pro!? #premierepro #adobeaddspellcheck", "score": 1, "created_utc": 1612704601, "company": "adobe"}, {"body": "I want to cancel DC plan. Unable to find where to online other than suggestion to use Twitter. Please advise or send link I can follow. Thanks", "score": 0, "created_utc": 1612699875, "company": "adobe"}, {"body": "can we fix the icon's measure? #GraphicDesigner #CC21 #adobe", "score": 0, "created_utc": 1612693772, "company": "adobe"}, {"body": "#Color is Number One TO attract #Influencers amd #Customers", "score": 0, "created_utc": 1612692559, "company": "adobe"}, {"body": "give me your software for free im sick and tired of torrents pls im so poor", "score": 0, "created_utc": 1612684873, "company": "adobe"}, {"body": "now has early cancellation fee?? That's disgusting!", "score": 2, "created_utc": 1612683384, "company": "adobe"}, {"body": "running socks on ! We are paying for your awful services!", "score": 0, "created_utc": 1612673118, "company": "adobe"}, {"body": "What about improving an existing #YouTuber channel ? a website can help I guess", "score": 0, "created_utc": 1612667012, "company": "adobe"}, {"body": "bring your flash player back. I am having so much issues. (", "score": 1, "created_utc": 1612666949, "company": "adobe"}, {"body": "you're absolute cunts x", "score": 0, "created_utc": 1612666186, "company": "adobe"}, {"body": "Nice software 8hours just to get this", "score": 0, "created_utc": 1612660591, "company": "adobe"}, {"body": "8hours wasted on this fucking dumb software", "score": 0, "created_utc": 1612660493, "company": "adobe"}, {"body": "why is this the Lightroom icon like this? Are ya'll purposely trying to drive me crazy?", "score": 0, "created_utc": 1612628030, "company": "adobe"}, {"body": "how the hell do I export a gif", "score": 2, "created_utc": 1612627426, "company": "adobe"}, {"body": "She has a strong visual identity. Dope work as always.", "score": 0, "created_utc": 1612625767, "company": "adobe"}, {"body": "support is so trash, i've been on this shit for like a fucking hour just trying to get your bullshit early cancellation fee removed", "score": 1, "created_utc": 1612621728, "company": "adobe"}, {"body": "Stephanie I told you I was serious about having you recognized for your help. I did the survey but just in case the jokers with no phone number missed it... This shout out is for you! #Amazing #CustomerService I wish everyone had a #stephanie definitely.", "score": 2, "created_utc": 1612613713, "company": "adobe"}, {"body": "2021 Digital Trends Report shows how #marketing and IT leaders will focus on the customer as a human being, their employees as integral assets and the digital customer experience as the main drivers of growth in 2021. Learn more", "score": 0, "created_utc": 1612603442, "company": "adobe"}, {"body": "THE FUCK AM I SUPPOSED TO DO NOW, I CANT UNINSTALL MY APPS/CLOUD NOR CAN I USE THEM", "score": 1, "created_utc": 1612591835, "company": "adobe"}, {"body": "This has just blown my mind!! exploding_head", "score": 0, "created_utc": 1612583025, "company": "adobe"}, {"body": "Either way Lightroom is now too expensive for most amateurs. Subscription model might be profitable but it's not for me", "score": 0, "created_utc": 1612574990, "company": "adobe"}, {"body": "so nobody really gets healed with the healing brush either", "score": 3, "created_utc": 1612572934, "company": "adobe"}, {"body": "No but you're breaking my wallet", "score": 2, "created_utc": 1612569329, "company": "adobe"}, {"body": "What is a darkroom anyway", "score": 2, "created_utc": 1612567634, "company": "adobe"}, {"body": "Let's get something on your Adobe Finance records Get your #GirlScoutCookies Here", "score": 0, "created_utc": 1612567282, "company": "adobe"}, {"body": "#DogecoinToTheMoon $doge Keep that up", "score": 0, "created_utc": 1612567263, "company": "adobe"}, {"body": "Such a great thing", "score": 0, "created_utc": 1612558842, "company": "adobe"}, {"body": "ok never mind, i'd actually like to congratulate him on such a well made autosave feature! really great stuff! I love Fresco so so so much!", "score": 0, "created_utc": 1612549531, "company": "adobe"}, {"body": "please bring back flash player removing it was a dumb choice we like to see the old flash games we played as children and the fact that you are removing access to them is making this year worse than it already is i would really like to access childhood but i cant", "score": 0, "created_utc": 1612548491, "company": "adobe"}, {"body": "I got a render or setting problem with adobe premire When the video is rendered i can clearly see the white colour is a bit off then the original video.I have this problem quite a long time The first screen shot on the left screen is playback resolution right is rendered.", "score": 3, "created_utc": 1612543827, "company": "adobe"}, {"body": "one more reason I've quit using Adobe products", "score": 0, "created_utc": 1612542150, "company": "adobe"}, {"body": "Uh.... uh.... UHHH.... am I dumb for not knowing this?!", "score": 1, "created_utc": 1612539973, "company": "adobe"}, {"body": "destroying Flash Player with the end of life thing is the retarded decision now", "score": 0, "created_utc": 1612539846, "company": "adobe"}, {"body": "please tell me there is a way to export IOS Photoshop Mix app projects into other Adobe apps all at once? I have hundreds of old projects on IOS Photoshop Mix, individually going through them all and uploading them to the cloud would be a huge headache.", "score": 0, "created_utc": 1612537822, "company": "adobe"}, {"body": "fuck u for getting rid of flash games", "score": 0, "created_utc": 1612536139, "company": "adobe"}, {"body": "No, I've not forgotten something in my basket! The email said 60% off the Photography plan, but the price was the same as normal, so I didn't buy.", "score": 0, "created_utc": 1612533326, "company": "adobe"}, {"body": "Fantastic work! Discover and share the process! Capture -&gt; Illustrator -&gt; After Effects or Capture -&gt; Illustrator -&gt; Photoshop", "score": 0, "created_utc": 1612531885, "company": "adobe"}, {"body": "Knock! Knock!", "score": 0, "created_utc": 1612530835, "company": "adobe"}, {"body": "in my not-so-relevant opinion, this entire conversation deserves a pulitzer", "score": 7, "created_utc": 1612529684, "company": "adobe"}, {"body": "The name Adobe used to stand for quality. Now it stands for money-grubbing greed. I'm sick to death of the constantly changing interfaces and new features NOBODY asked for. I would put CS5 up against any of these newer updates. Utter rubbish. You should be ashamed.", "score": 0, "created_utc": 1612529242, "company": "adobe"}, {"body": "'Paste Remembers Layers' is the most bullshit function and I have to turn THAT off every time I have to restart your garbage software. All of the 'defaults' you think people want -- people don't want. I don't want to preview my transformations. Just do it.", "score": 0, "created_utc": 1612529173, "company": "adobe"}, {"body": "As a professional graphic designer of 13 years, I just want to say -- FUCK YOU. I can't believe how terribly, horribly broken CC is compared to past iterations of your products. Every time Illustrator closes I have to set my preferences again?", "score": 1, "created_utc": 1612529096, "company": "adobe"}, {"body": "yeah yeah ha ha now go back to the dark room and fix your fucking excuse of software", "score": 0, "created_utc": 1612527762, "company": "adobe"}, {"body": "sucks so hard", "score": 0, "created_utc": 1612527716, "company": "adobe"}, {"body": "I am trying to reach an online support agent but It's been impossible, chat says chats are closed. How can I get support from a person? I have an issue with my subscription plan.", "score": 1, "created_utc": 1612527694, "company": "adobe"}, {"body": "This is an adorable thread and i'm here for it. But I have to ask, is having a convo with herself here?", "score": 14, "created_utc": 1612523633, "company": "adobe"}, {"body": "We literally are Lightroom and this is news to us", "score": 155, "created_utc": 1612522270, "company": "adobe"}, {"body": "your stupid ipc broker can go fornicate itself with a sharp rock. It keeps popping up saying it's not starting correctly and interfering with my laptop functionality. Tell me how to correct situation or tell me how you're going to give me a REFUND!!", "score": 1, "created_utc": 1612521826, "company": "adobe"}, {"body": "Wait until you find out who uses Illustrator...", "score": 70, "created_utc": 1612520986, "company": "adobe"}, {"body": "what is the adobe ipc broker? It keeps popping up saying unable to start correctly? What do I need to do?", "score": 0, "created_utc": 1612520883, "company": "adobe"}, {"body": "ratio rolling_on_the_floor_laughing", "score": 28, "created_utc": 1612520442, "company": "adobe"}, {"body": "why was I charged 33.10 for Adobe systems??? I have NEVER purchased anything from Adobe", "score": 1, "created_utc": 1612518984, "company": "adobe"}, {"body": "Your online portal is a clusterf***!", "score": 0, "created_utc": 1612517372, "company": "adobe"}, {"body": "- is it true that you just raised the student price of Creative Cloud by 50% during a pandemic, when students are cut off from their on-campus labs?", "score": 2, "created_utc": 1612516209, "company": "adobe"}, {"body": "I've updated to PS 2021 on my MacBook (I'm running Mojave) and now it's running slow as hell again. Scratch disks are linked to my external hard drive. Any tips? Memory usage is 85%.", "score": 1, "created_utc": 1612512750, "company": "adobe"}, {"body": "where's ur hardware, or are u waiting for to put a 30% tax on ur ass when appstore becomes compulsory on macs, u think u different from epic shey.", "score": 0, "created_utc": 1612511886, "company": "adobe"}, {"body": "you would make my life so much easier if you let me select multiple layers in Illustrator instead of just highlighting them loudly_crying_face", "score": 2, "created_utc": 1612510845, "company": "adobe"}, {"body": "So proud of this team, and for bringing this story to the front!!!", "score": 0, "created_utc": 1612506587, "company": "adobe"}, {"body": "It sucks that so many companies bought into flash and Adobe couldn't secure it. Putting a bullet in it didn't help. Can't admin 30% of my network and infrastructure now. Well done, Adobe! [NOT!]", "score": 0, "created_utc": 1612501805, "company": "adobe"}, {"body": "Hi, do you guys have any plans to make direct purchases for Adobe CC available for Caribbean designers and producers?", "score": 0, "created_utc": 1612499046, "company": "adobe"}, {"body": "Hello. Is it time yet to finally implement Freehand's circle segment option into Illustrator, where you could just open a circle from a segment point, and drag to a desired size? or even 's pie chart option? Segments are so difficult in AI.", "score": 0, "created_utc": 1612491697, "company": "adobe"}, {"body": "Acrobat offers multiple free useful tools for PDFs on the Web", "score": 0, "created_utc": 1612473155, "company": "adobe"}, {"body": "But does it run on Linux?", "score": 0, "created_utc": 1612466023, "company": "adobe"}, {"body": "You guys are missing the AI train. Why can't I search \"dog\" in photoshop and have an AI select the dog in the picture?", "score": 3, "created_utc": 1612465290, "company": "adobe"}, {"body": "Pls when will you choose the winners... I've been waiting downcast_face_with_sweat pleading_face", "score": 0, "created_utc": 1612461232, "company": "adobe"}, {"body": "inspires me to STREAM DEFENCELESS AND BUY WALLS ON ITUNES", "score": 0, "created_utc": 1612455312, "company": "adobe"}, {"body": "stop lagging please", "score": 0, "created_utc": 1612454862, "company": "adobe"}, {"body": "where can i get the w-9 format updated to 2021, i'v calling support for weeks and none can solve it, finnance will block payments to you if i don't get very soon #helpmeadobe", "score": 0, "created_utc": 1612452559, "company": "adobe"}, {"body": "WHY YOU GOTTA MAKE ALL THE COMMANDS FOR ALL THE DIFFERENT APPS DIFFERENT sincerely, a v tired graphic designer who has used at least 4 adobe programs every day for the last 6 years and usually at the same time p.s. my brain HURTS", "score": 0, "created_utc": 1612448016, "company": "adobe"}, {"body": "Hey Adobe - can you give us local drive apps, like we always had - that don't take forever to contact the cloud and slow down workflow!?", "score": 0, "created_utc": 1612447738, "company": "adobe"}, {"body": "I'll take 10 years at this price. May be worth looking into the advertising for some of the errors here", "score": 0, "created_utc": 1612447558, "company": "adobe"}, {"body": "im working on something for 6 hours and i cant render it bc ae is crashing every time i open the project pleaseeee helppp meee", "score": 2, "created_utc": 1612444731, "company": "adobe"}, {"body": "if you want the absolute worst customer experience keep using products.horrible support", "score": 0, "created_utc": 1612443720, "company": "adobe"}, {"body": "Your guilt trips for people canceling their plans on you are pathetic and manipulative. You should stop that and just let people cancel as they see fit and stop manipulating people to buy your crap.", "score": 0, "created_utc": 1612439314, "company": "adobe"}, {"body": "My lovely creative father!", "score": 0, "created_utc": 1612430668, "company": "adobe"}, {"body": "market value increased twelvefold in just 8 years after starting its digital transformation process, now it's helping others do the same Read this interview with Douglas Montalvao, Director General of Adobe MX #MexicoBusinessNews #MexicoBusiness", "score": 0, "created_utc": 1612429201, "company": "adobe"}, {"body": "BRING BACK FLASH NOW OR I'LL BLOW YOUR HEADQUARTERS UP", "score": 0, "created_utc": 1612427543, "company": "adobe"}, {"body": "seriously WHAT is up with the lag in photoshop this past month? I have a shit to do. My iMac is two years old babe it's not me it's you", "score": 1, "created_utc": 1612427414, "company": "adobe"}, {"body": "Can you explain the UX decisions behind \"hold shift\" to resize keeping scale in Illustrator &amp; \"hold shift\" to resize omitting scale in Photoshop? The CC Suite used to be an example I used of great UX systems. #uxpainpoints", "score": 3, "created_utc": 1612425482, "company": "adobe"}, {"body": "\"immediately uninstall Flash Player to help protect their systems\" \"good news is you will certainly still be able to use LiteracyPlanet! Flash can be re-enabled\" man_facepalming", "score": 1, "created_utc": 1612420655, "company": "adobe"}, {"body": "please for the sake of my sanity include a spellchecking tool on illustrator. Please facilitate my stupidity loudly_crying_face", "score": 1, "created_utc": 1612418524, "company": "adobe"}, {"body": "Any update on a stable build of XD for Windows?", "score": 0, "created_utc": 1612418252, "company": "adobe"}, {"body": "why do I need to pay 10 euros more for the 'Creative Cloud - all apps' membership in Belgium than in France?", "score": 0, "created_utc": 1612414818, "company": "adobe"}, {"body": "When will you actually fix the problem with Photoshop randomly freezing when working on images whilst zoomed!?! I'm bored of it. It's been happening for as long as I can remember.", "score": 1, "created_utc": 1612412529, "company": "adobe"}, {"body": "a bunch of robbing bastards.", "score": 0, "created_utc": 1612409876, "company": "adobe"}, {"body": "is already publishing new tools and integration for Magento to offer personalization to customers. #MM21IN", "score": 8, "created_utc": 1612398420, "company": "adobe"}, {"body": "Because they can't do it otherwise?", "score": 0, "created_utc": 1612391571, "company": "adobe"}, {"body": "No promotion on twhitler block", "score": 0, "created_utc": 1612390129, "company": "adobe"}, {"body": "When is the Photoshop Export glitch going to be fixed? Just had to reset all my preferences for the second time in two months. NOT ACCEPTABLE.", "score": 1, "created_utc": 1612388454, "company": "adobe"}, {"body": "why I am getting this on my pro and after effect? It just shows the loading screen", "score": 2, "created_utc": 1612363163, "company": "adobe"}, {"body": "you all have the worse most ineffective customer support ever! It is literally sickening", "score": 1, "created_utc": 1612361668, "company": "adobe"}, {"body": "YOU SUCK", "score": 0, "created_utc": 1612358277, "company": "adobe"}, {"body": "enabled modern fonts development via CLI with afdko tool. That's pretty awesome to be able to compile fonts by builder command. The example font source", "score": 0, "created_utc": 1612355358, "company": "adobe"}, {"body": "just let me photoshop in peace", "score": 0, "created_utc": 1612343821, "company": "adobe"}, {"body": "The game is rigged - It's Time for a Change. We the people are speaking w one voice one purpose - we are taking back our financial destiny &amp; will stand for what's right. Join The Movement. Power to the People. Our Coin Our Time. Do Only Good Everyday. #Dogecoin", "score": 2, "created_utc": 1612343109, "company": "adobe"}, {"body": "perfectly captures the essence of 2021 in #creativetrends...be sure to check out the handheld footage/UGC combo as well as the audio trends!", "score": 0, "created_utc": 1612339218, "company": "adobe"}, {"body": "do you have a press kit with all of your app icons? Thinking about making a sticker kit for people to stylize their animoji's laptops.", "score": 2, "created_utc": 1612334098, "company": "adobe"}, {"body": "more incompetence on your part. Do you want to get paid or not? Your billing doesn't work on the #chrome web browser - really?!", "score": 1, "created_utc": 1612333706, "company": "adobe"}, {"body": "XD I have three images nested as Components. When I click \"edit in PS\" on one of them, it launches PS and I can edit as usual. If I want to open another one in PS, nothing happens. Normal images work fine. Only restarting XD helps. Is there sth I can do to make it work?", "score": 0, "created_utc": 1612321539, "company": "adobe"}, {"body": "acrobat's liquid mode for reading pdf on small screen is just fire fire fire fire fire fire", "score": 1, "created_utc": 1612321131, "company": "adobe"}, {"body": "bitch why the fuck cant i render with h264 anymore ???? why the fuck like whyb the actual fuck ??? where am i supposed to render other than with that fatass media encoder ???", "score": 2, "created_utc": 1612307601, "company": "adobe"}, {"body": "You killed bin weevils disappointed_face loudly_crying_face loudly_crying_face", "score": 0, "created_utc": 1612294591, "company": "adobe"}, {"body": "can i have free editing software plz", "score": 2, "created_utc": 1612277724, "company": "adobe"}, {"body": "the changes you made in the latest version of Adobe are far from intuitive. Please change it back to the way it was!", "score": 0, "created_utc": 1612275944, "company": "adobe"}, {"body": "Hello, thanks for responding. Acrobat is not installed on this system.", "score": 1, "created_utc": 1612275753, "company": "adobe"}, {"body": "said my artwork was amazing. Don't speak to me peasants loudly_crying_face", "score": 4, "created_utc": 1612274887, "company": "adobe"}, {"body": "This website is offering unbelievable cheap pricing on adobe products is it legit?", "score": 1, "created_utc": 1612268953, "company": "adobe"}, {"body": "the fact i pay 60 euros a MONTH to have an app crash on me twice in a day... adobe more like a robbery.", "score": 1, "created_utc": 1612266663, "company": "adobe"}, {"body": "I have a request. Every time I preview in Premiere Pro, I have to press [L] key to double speed. That action is tedious. I want to set it to double speed from the beginning. Is there a setting to make preview twice as fast from the beginning? If not, please update. Thx", "score": 1, "created_utc": 1612264242, "company": "adobe"}, {"body": "will tune in  from his native country  lol", "score": 0, "created_utc": 1612260456, "company": "adobe"}, {"body": "I do not know what you have done to your software but it will not load and I cannot get any work done. I've been fighting acrobat DC for months. Will you please fix your glitchy software so we can open a file in a timely manner.", "score": 1, "created_utc": 1612258474, "company": "adobe"}, {"body": "just released a major update for #PremierePro &amp; #AfterEffects. Interested in learning what's new? Check it out! #BeBop #ThinkBeBop #videoediting #film #vfx #colorcorrection #wfh #remotework", "score": 0, "created_utc": 1612256840, "company": "adobe"}, {"body": "I can't update or reinstall my Premiere Pro? Everything else can i update but not the program i really need now.... (Premiere pro) Are the servers down? How can i fix this?", "score": 1, "created_utc": 1612255656, "company": "adobe"}, {"body": "Go. Away. I'm working. Stop it. Just stop it.", "score": 1, "created_utc": 1612247848, "company": "adobe"}, {"body": "pure shit from your customer service mate.", "score": 0, "created_utc": 1612241867, "company": "adobe"}, {"body": "I've just wasted an entire morning thanks to Camera Raw totally freezing my iMac every time I start to edit a raw file. I've updated PS twice in as May days and still the same. What's going on?", "score": 0, "created_utc": 1612839833, "company": "adobe"}, {"body": "Layer mask..and erase.!", "score": 0, "created_utc": 1612839614, "company": "adobe"}, {"body": "There you go", "score": 0, "created_utc": 1612833525, "company": "adobe"}, {"body": "MONDAY BLUES", "score": 0, "created_utc": 1612832908, "company": "adobe"}, {"body": "not allowing me to draw a line in Pixels anymore is just complete bullshit. Why did you change this There are so many things that this blocks me from doing and has made my life harder! #photoshop #linetool #pixels", "score": 1, "created_utc": 1612829819, "company": "adobe"}, {"body": "Mask them off and pretend they never existed relieved_face", "score": 2, "created_utc": 1612829221, "company": "adobe"}, {"body": "Lots of blue smiling_face_with_smiling_eyes", "score": 0, "created_utc": 1612828210, "company": "adobe"}, {"body": "With an extra touch to it", "score": 0, "created_utc": 1612823563, "company": "adobe"}, {"body": "Dope", "score": 0, "created_utc": 1612823547, "company": "adobe"}, {"body": "can I have one of your dad hats I keep seeing people get in PR packages? pleading_face", "score": 12, "created_utc": 1612823084, "company": "adobe"}, {"body": "Yess!!!", "score": 0, "created_utc": 1612818076, "company": "adobe"}, {"body": "Blue is love blue_heart blue_heart", "score": 1, "created_utc": 1612817689, "company": "adobe"}, {"body": "Blue Blue blue_heart", "score": 1, "created_utc": 1612816173, "company": "adobe"}, {"body": "So when y'all gonna be on Linux so I can start using you again face_with_tears_of_joy", "score": 0, "created_utc": 1612815591, "company": "adobe"}, {"body": "how does a teacher that teaches this software get cool swag like this for my classroom? My kids would flip.", "score": 0, "created_utc": 1612808815, "company": "adobe"}, {"body": "Obviously the clone stamp", "score": 0, "created_utc": 1612808607, "company": "adobe"}, {"body": "it's a blue world.", "score": 5, "created_utc": 1612807200, "company": "adobe"}, {"body": "Do you want any Line art service ,please knock Link . #TentacionesDBT3 #gfvip #TEAMWANG #AddAWordRuinALoveSong #TheBachelorABC # #illustration #onelineart #linedrawing #lineart #minimallineart #LINK #Linux #PepsiHalftime #POTUS", "score": 0, "created_utc": 1612806174, "company": "adobe"}, {"body": "Literally my favorite color!", "score": 0, "created_utc": 1612803829, "company": "adobe"}, {"body": "aye can the design team get in on this sweet swag smiling_face", "score": 1, "created_utc": 1612798724, "company": "adobe"}, {"body": "Has kept me sane during this pandemic. Thank you.", "score": 0, "created_utc": 1612798540, "company": "adobe"}, {"body": "eyes (Yes, please grinning_face_with_sweat )", "score": 1, "created_utc": 1612796767, "company": "adobe"}, {"body": "come on... sending swag ...guess you lost my address upside-down_face", "score": 0, "created_utc": 1612795487, "company": "adobe"}, {"body": "What does it take to get some swag like a mask or cup?", "score": 0, "created_utc": 1612794945, "company": "adobe"}, {"body": "A bit of blue here", "score": 2, "created_utc": 1612792772, "company": "adobe"}, {"body": "When is it brown day so I can go crazy with coffee colours woozy_face", "score": 0, "created_utc": 1612789509, "company": "adobe"}, {"body": "We support this. (via Twitter", "score": 0, "created_utc": 1612789462, "company": "adobe"}, {"body": "some Monday blues blue_circle", "score": 1, "created_utc": 1612787265, "company": "adobe"}, {"body": "It's because you guys sent me a temporary tattoo of it for the 30 year anniversary and I just loved the way it looked!!", "score": 0, "created_utc": 1612786894, "company": "adobe"}, {"body": "Can we add a little red to that blue?", "score": 3, "created_utc": 1612786392, "company": "adobe"}, {"body": "ur a bitch and the worst thing to happen to me i just want u to know that .", "score": 0, "created_utc": 1612786117, "company": "adobe"}, {"body": "you could say the last one is... feeling blue", "score": 2, "created_utc": 1612785774, "company": "adobe"}, {"body": "Bluer than blue! blue_heart", "score": 5, "created_utc": 1612785393, "company": "adobe"}, {"body": "Wassoap? blue_heart soap winking_face_with_tongue", "score": 2, "created_utc": 1612785188, "company": "adobe"}, {"body": "Blue lover blue_heart", "score": 0, "created_utc": 1612784939, "company": "adobe"}, {"body": "Actually, blue is my favorite color", "score": 0, "created_utc": 1612784258, "company": "adobe"}, {"body": "Brush tool.", "score": 0, "created_utc": 1612784029, "company": "adobe"}, {"body": "keeps telling me my scratch disks are full", "score": 0, "created_utc": 1612783194, "company": "adobe"}, {"body": "We're so glad you're here! (via Twitter", "score": 0, "created_utc": 1612782278, "company": "adobe"}, {"body": "Some blues", "score": 75, "created_utc": 1612781518, "company": "adobe"}, {"body": "I got this.", "score": 5, "created_utc": 1612780818, "company": "adobe"}, {"body": "Blues", "score": 53, "created_utc": 1612780599, "company": "adobe"}, {"body": "Icey Blues", "score": 2, "created_utc": 1612779976, "company": "adobe"}, {"body": "Lots of blues", "score": 13, "created_utc": 1612779597, "company": "adobe"}, {"body": "mountain monday blues", "score": 4, "created_utc": 1612779492, "company": "adobe"}, {"body": "Sunrise over the Atlantic today blue_heart", "score": 6, "created_utc": 1612778262, "company": "adobe"}, {"body": "Wishing for warm blue skies", "score": 6, "created_utc": 1612778134, "company": "adobe"}, {"body": "Mine too", "score": 1, "created_utc": 1612777619, "company": "adobe"}, {"body": "In the winter, no less snowflake blue_heart", "score": 6, "created_utc": 1612777022, "company": "adobe"}, {"body": "Here's a few blue hues for you", "score": 18, "created_utc": 1612776882, "company": "adobe"}, {"body": "Blue Hour, my favourite time of the day to shoot blue_heart", "score": 7, "created_utc": 1612776762, "company": "adobe"}, {"body": "Monday Blues! blue_heart Here's an art poster I did )", "score": 4, "created_utc": 1612776664, "company": "adobe"}, {"body": "large_blue_diamond Feeling blue large_blue_diamond", "score": 4, "created_utc": 1612776450, "company": "adobe"}, {"body": "Sad Blues exist crying_face crying_face", "score": 8, "created_utc": 1612776380, "company": "adobe"}, {"body": "HERE I AM! I AM HERE", "score": 6, "created_utc": 1612776351, "company": "adobe"}, {"body": "For me it's grey and red and ready for a #FalconAndWinterSoldier full show release", "score": 2, "created_utc": 1612776206, "company": "adobe"}, {"body": "I like blue", "score": 2, "created_utc": 1612775722, "company": "adobe"}, {"body": "Always a favorite", "score": 15, "created_utc": 1612775706, "company": "adobe"}, {"body": "Blue tones from #Iceland", "score": 5, "created_utc": 1612775515, "company": "adobe"}, {"body": "How White Sands NM feels about it", "score": 5, "created_utc": 1612775497, "company": "adobe"}, {"body": "blue_heart My favorite color blue_heart", "score": 2, "created_utc": 1612775435, "company": "adobe"}, {"body": "I love blue gem_stone", "score": 11, "created_utc": 1612775419, "company": "adobe"}, {"body": "Love me some Big Blue high_voltage", "score": 17, "created_utc": 1612775375, "company": "adobe"}, {"body": "Let's rock this Monday!", "score": 7, "created_utc": 1612775298, "company": "adobe"}, {"body": "My favorite color is blue aswell. Coincidence? Think not", "score": 15, "created_utc": 1612775262, "company": "adobe"}, {"body": "My Fav color blue_heart smiling_face_with_hearts", "score": 1, "created_utc": 1612775187, "company": "adobe"}, {"body": "Blue &amp; Purple purple_heart blue_heart", "score": 0, "created_utc": 1612775135, "company": "adobe"}, {"body": "Color prompt Monday blues blue_heart (via Twitter", "score": 0, "created_utc": 1612775068, "company": "adobe"}, {"body": "More alt posters at and smiling_face_with_smiling_eyes", "score": 1, "created_utc": 1612775042, "company": "adobe"}, {"body": "Electric Blues", "score": 3, "created_utc": 1612775024, "company": "adobe"}, {"body": "Someone say blue? cloud", "score": 6, "created_utc": 1612774988, "company": "adobe"}, {"body": "My favorite color forever and ever! blue_heart", "score": 10, "created_utc": 1612774910, "company": "adobe"}, {"body": "End the war. Is it jif or gif ?", "score": 0, "created_utc": 1612770703, "company": "adobe"}, {"body": "How can I find Adobe Photoshop Crack?", "score": 0, "created_utc": 1612760827, "company": "adobe"}, {"body": "Clone stamp tool. Biiisshh face_with_tears_of_joy face_with_tears_of_joy face_with_tears_of_joy", "score": 2, "created_utc": 1612752645, "company": "adobe"}, {"body": "The \"close application\" button.", "score": 3, "created_utc": 1612752282, "company": "adobe"}, {"body": "is the most non user friendly program I have ever used. The most basic of edits is easier to acomplish using MS Paint. What a trainwreck.", "score": 0, "created_utc": 1612745667, "company": "adobe"}, {"body": "So me face_with_tears_of_joy face_with_tears_of_joy face_with_tears_of_joy face_with_tears_of_joy face_with_tears_of_joy face_with_tears_of_joy", "score": 1, "created_utc": 1612743212, "company": "adobe"}, {"body": "Not Camera Raw, you guys keep making it worse. Pls Stop.", "score": 0, "created_utc": 1612733370, "company": "adobe"}, {"body": "A pen tool", "score": 0, "created_utc": 1612721420, "company": "adobe"}, {"body": "Normally I'd say but if you can't open a photo to edit, it won't be in my toolbox. Considering that I pay an expensive premium for PsExpress, should I delete an app I once considered essential? #adobe #adobepsExpress #iPhone", "score": 0, "created_utc": 1612709254, "company": "adobe"}, {"body": "my new video please have a look red_heart bouquet", "score": 0, "created_utc": 1612692176, "company": "adobe"}, {"body": "can you guys fix this? both path and link (\"more info\") don't work... folded_hands_medium-light_skin_tone", "score": 0, "created_utc": 1612691802, "company": "adobe"}, {"body": "I've used your software every day for 15+ years. This latest release is by far the worst. It's a steaming pile of shit  extremely buggy, excruciatingly laggy, and kernel panics galore. How can software used by so many people regularly be such utter trash!!!!!!!!!!", "score": 0, "created_utc": 1612691629, "company": "adobe"}, {"body": "Great tutorial", "score": 0, "created_utc": 1612687235, "company": "adobe"}, {"body": "Brush for sure!!!!!!!!!! writing_hand face_with_tears_of_joy", "score": 0, "created_utc": 1612683566, "company": "adobe"}, {"body": "Zoom tool, so I can zoom out opponents until look 1 pixel", "score": 0, "created_utc": 1612681843, "company": "adobe"}, {"body": "The brush tool?!!!", "score": 0, "created_utc": 1612676117, "company": "adobe"}, {"body": "Big enough RAM size would be the best choice", "score": 0, "created_utc": 1612674086, "company": "adobe"}, {"body": "Light level adjustment tool", "score": 0, "created_utc": 1612670845, "company": "adobe"}, {"body": "please help her", "score": 0, "created_utc": 1612650187, "company": "adobe"}, {"body": "I'm definitely going dodge tool, I'm just going to keep evading to safety. Also as a passive ability I get to brighten everyone's day.", "score": 0, "created_utc": 1612649776, "company": "adobe"}, {"body": "A computer", "score": 0, "created_utc": 1612649174, "company": "adobe"}, {"body": "i have CANCELED my membership months ago WHY am i still charged", "score": 0, "created_utc": 1612645210, "company": "adobe"}, {"body": "I'm bout to liquify some shi.", "score": 0, "created_utc": 1612640412, "company": "adobe"}, {"body": "should have an automatic save , just lost a file because an image was about to scale a layer almost 1500% by accident lol", "score": 0, "created_utc": 1612638980, "company": "adobe"}, {"body": "Magic Eraser Tool. Everyone is gone (Thanos Snaps Fingers)", "score": 0, "created_utc": 1612636087, "company": "adobe"}, {"body": "I would choose Unmesh as my ultimate Photoshop weapon", "score": 0, "created_utc": 1612635896, "company": "adobe"}, {"body": "Any of the selection tools", "score": 0, "created_utc": 1612628581, "company": "adobe"}, {"body": "Smudge, with the right brushes it's beyond magic!", "score": 0, "created_utc": 1612619722, "company": "adobe"}, {"body": "Brush/blend tool anyday.", "score": 0, "created_utc": 1612609722, "company": "adobe"}, {"body": "Content aware fill so that I can hide myself", "score": 0, "created_utc": 1612605709, "company": "adobe"}, {"body": "top 5 laptops for photo shop ??", "score": 0, "created_utc": 1612601507, "company": "adobe"}, {"body": "Brushes....lots of brushes", "score": 0, "created_utc": 1612601138, "company": "adobe"}, {"body": "Selection tool", "score": 0, "created_utc": 1612600432, "company": "adobe"}, {"body": "Dodge and Burn Dodge all attacks and Burn everything in sight fire fire fire", "score": 0, "created_utc": 1612598297, "company": "adobe"}, {"body": "magnetic lasso because why not I don't know if it's useful or not.", "score": 2, "created_utc": 1612596025, "company": "adobe"}, {"body": "Laso tool + CTRL X", "score": 0, "created_utc": 1612594174, "company": "adobe"}, {"body": "A dedicated GPU and 16GB+ RAM.", "score": 1, "created_utc": 1612593301, "company": "adobe"}, {"body": "Brush tool!", "score": 0, "created_utc": 1612592737, "company": "adobe"}, {"body": "I'd take all of the duplicate JPGs I have because we currently can't save over a file without creating a copy of it man_shrugging_light_skin_tone #pleasefix", "score": 0, "created_utc": 1612591460, "company": "adobe"}, {"body": "I'm bringing the slice tool!", "score": 0, "created_utc": 1612590543, "company": "adobe"}, {"body": "Photoshop and Illustrator Yeah it is.", "score": 0, "created_utc": 1612590407, "company": "adobe"}, {"body": "s Select Subject feature has never been more upsetting to me than I was just noticing. This is very great feature! (Note I've been using it for 10 years. grinning_face_with_smiling_eyes )", "score": 0, "created_utc": 1612589941, "company": "adobe"}, {"body": "My trusty pen pen and tablet! #photoshop #retouching #professional", "score": 0, "created_utc": 1612589220, "company": "adobe"}, {"body": "Magic wand tool )", "score": 0, "created_utc": 1612589105, "company": "adobe"}, {"body": "Magic wand tool and content aware fill so i can make them dissapear", "score": 0, "created_utc": 1612588949, "company": "adobe"}, {"body": "Pen tool", "score": 0, "created_utc": 1612586077, "company": "adobe"}, {"body": "Clone stamp!! I want to deceive my opposition full_moon_face", "score": 0, "created_utc": 1612585184, "company": "adobe"}, {"body": "Tools that PS didn't have", "score": 0, "created_utc": 1612584805, "company": "adobe"}, {"body": "The move tool person_cartwheeling", "score": 0, "created_utc": 1612582610, "company": "adobe"}, {"body": "clone stamp to clone myself", "score": 1, "created_utc": 1612582399, "company": "adobe"}, {"body": "Brush", "score": 0, "created_utc": 1612578768, "company": "adobe"}, {"body": "pen tool so i can cut yo add outta existence", "score": 0, "created_utc": 1612577994, "company": "adobe"}, {"body": "my mouse", "score": 0, "created_utc": 1612576403, "company": "adobe"}, {"body": "Color mixer brush", "score": 1, "created_utc": 1612573849, "company": "adobe"}, {"body": "magic wand", "score": 0, "created_utc": 1612572559, "company": "adobe"}, {"body": "the cursor one so i can drag opponents off screen", "score": 1, "created_utc": 1612570373, "company": "adobe"}, {"body": "google drive so i can share my work!", "score": 0, "created_utc": 1612570309, "company": "adobe"}, {"body": "brush", "score": 0, "created_utc": 1612569932, "company": "adobe"}, {"body": "the lass-hoe", "score": 0, "created_utc": 1612567910, "company": "adobe"}, {"body": "I'll crop them out then bam they gone", "score": 0, "created_utc": 1612566850, "company": "adobe"}, {"body": "Probably like a machine gun or something I dunno", "score": 0, "created_utc": 1612565712, "company": "adobe"}, {"body": "um i cry about it cux photoshop is hard", "score": 0, "created_utc": 1612564758, "company": "adobe"}, {"body": "the pen tool", "score": 0, "created_utc": 1612564621, "company": "adobe"}, {"body": "Have Photoshop fix and Photoshop mix apps been deleted from App Store?", "score": 1, "created_utc": 1612564379, "company": "adobe"}, {"body": "The blur tool", "score": 0, "created_utc": 1612562740, "company": "adobe"}, {"body": "layer mask", "score": 0, "created_utc": 1612562054, "company": "adobe"}, {"body": "I'll use Quick mask tool and mask the opponent out", "score": 0, "created_utc": 1612561268, "company": "adobe"}, {"body": "I'm masking myself to appear  invisible hundred_points", "score": 0, "created_utc": 1612561141, "company": "adobe"}, {"body": "C R O P I N G tool", "score": 0, "created_utc": 1612560771, "company": "adobe"}, {"body": "text tool idk why tho", "score": 0, "created_utc": 1612560534, "company": "adobe"}, {"body": "100% the Lasso tool", "score": 0, "created_utc": 1612559544, "company": "adobe"}, {"body": "the pen tool cuz i can draw myself women", "score": 0, "created_utc": 1612559507, "company": "adobe"}, {"body": "Actually, a Sword, in order to kill opponents.", "score": 1, "created_utc": 1612557848, "company": "adobe"}, {"body": "By Short lessons &amp; weekly exercises", "score": 0, "created_utc": 1612556749, "company": "adobe"}, {"body": "Dodge tool, miss me with that mess", "score": 0, "created_utc": 1612556359, "company": "adobe"}, {"body": "The masking tool flexed_biceps_medium-dark_skin_tone", "score": 0, "created_utc": 1612555822, "company": "adobe"}, {"body": "The pen is mightier than the sword.", "score": 12, "created_utc": 1612555491, "company": "adobe"}, {"body": "Pen is the best", "score": 0, "created_utc": 1612555290, "company": "adobe"}, {"body": "The lasso tool all the way. It is such a powerful tool. I use it in almost every project.", "score": 0, "created_utc": 1612555112, "company": "adobe"}, {"body": "Content aware fill!", "score": 0, "created_utc": 1612554112, "company": "adobe"}, {"body": "\"Blending Options\"", "score": 1, "created_utc": 1612553844, "company": "adobe"}, {"body": "I'm bringing Adobe Sensei to do the job for me!", "score": 0, "created_utc": 1612553275, "company": "adobe"}, {"body": "Lasso all the wayyyyy", "score": 0, "created_utc": 1612553233, "company": "adobe"}, {"body": "The one and only..the pen tool.. smiling_face_with_sunglasses smiling_face_with_sunglasses smiling_face_with_sunglasses", "score": 0, "created_utc": 1612553024, "company": "adobe"}, {"body": "Brush pen tool lazo eraser", "score": 0, "created_utc": 1612552806, "company": "adobe"}, {"body": "Colour Balance. Balance is the key to everything winking_face", "score": 1, "created_utc": 1612552570, "company": "adobe"}, {"body": "Brush paintbrush", "score": 0, "created_utc": 1612552269, "company": "adobe"}, {"body": "Crop and crop face_with_tears_of_joy face_with_tears_of_joy", "score": 0, "created_utc": 1612551846, "company": "adobe"}, {"body": "Figma", "score": 2, "created_utc": 1612551780, "company": "adobe"}, {"body": "Blending tool, whenever anyone's coming to beat me i'll make me screen then i'll become invisible or other type face_with_tears_of_joy face_with_tears_of_joy", "score": 0, "created_utc": 1612551445, "company": "adobe"}, {"body": "Pentool", "score": 0, "created_utc": 1612551341, "company": "adobe"}, {"body": "Brush, so i can create the best one", "score": 0, "created_utc": 1612550528, "company": "adobe"}, {"body": "content-aware fill", "score": 0, "created_utc": 1612550101, "company": "adobe"}, {"body": "My clone stamp Gemini infinity", "score": 0, "created_utc": 1612549632, "company": "adobe"}, {"body": "Krita, because I hate monthly fees.", "score": 1, "created_utc": 1612549555, "company": "adobe"}, {"body": "&lt;alt&gt;-&lt;F4&gt; I always run from battles.", "score": 0, "created_utc": 1612548541, "company": "adobe"}, {"body": "Uhm, what is this?", "score": 0, "created_utc": 1612547982, "company": "adobe"}, {"body": "I'll be cloning myself", "score": 5, "created_utc": 1612547331, "company": "adobe"}, {"body": "Dodge Tool! Nothing will touch us.", "score": 0, "created_utc": 1612546751, "company": "adobe"}, {"body": "Shift + F5 grinning_squinting_face", "score": 0, "created_utc": 1612546736, "company": "adobe"}, {"body": "brush", "score": 0, "created_utc": 1612545476, "company": "adobe"}, {"body": "hand tool, i gonna smash u face_with_tears_of_joy", "score": 3, "created_utc": 1612544908, "company": "adobe"}, {"body": "The move tool... all these other people are forgetting that they can't use the wand or lasso and move something without it ;)", "score": 0, "created_utc": 1612544172, "company": "adobe"}, {"body": "AI hair thickener", "score": 0, "created_utc": 1612542733, "company": "adobe"}, {"body": "somehow i messed up my settings and now I can't invert a quick mask. Help.", "score": 0, "created_utc": 1612542246, "company": "adobe"}, {"body": "Read client mind tool", "score": 0, "created_utc": 1612540772, "company": "adobe"}, {"body": "uhh this is a hard one I'm thinking a squirrel", "score": 0, "created_utc": 1612540295, "company": "adobe"}, {"body": "deez nuts", "score": 1, "created_utc": 1612540276, "company": "adobe"}, {"body": "Lasso tool", "score": 0, "created_utc": 1612540121, "company": "adobe"}, {"body": "Liquify, it makes everything gooder.", "score": 0, "created_utc": 1612538095, "company": "adobe"}, {"body": "Quick Select!", "score": 0, "created_utc": 1612537261, "company": "adobe"}, {"body": "Easy. Mask me up and I am...getting out of there without notice! ;)", "score": 0, "created_utc": 1612537177, "company": "adobe"}, {"body": "Pen tool, everyone knows that if you can master the pen tool you aren't to be messed with", "score": 1, "created_utc": 1612536930, "company": "adobe"}, {"body": "Clone stamp tool", "score": 0, "created_utc": 1612536180, "company": "adobe"}, {"body": "Clone tool for clone wars!", "score": 0, "created_utc": 1612535791, "company": "adobe"}, {"body": "had been so slow the past week, I don't know what to do. I actually broke down today because I can't figure out what's wrong with it. I just want to finish my project man woozy_face", "score": 2, "created_utc": 1612535765, "company": "adobe"}, {"body": "The Pen (Tool) is mightier than the sword.", "score": 0, "created_utc": 1612535659, "company": "adobe"}, {"body": "Robin Williams belt", "score": 0, "created_utc": 1612535402, "company": "adobe"}, {"body": "Blend tool everyday", "score": 0, "created_utc": 1612535236, "company": "adobe"}, {"body": "The art history brush. I'd bore them to death.", "score": 0, "created_utc": 1612534903, "company": "adobe"}, {"body": "I will go straight away for the pen tool", "score": 0, "created_utc": 1612534554, "company": "adobe"}, {"body": "Keyboard. Maybe a mouse too.", "score": 0, "created_utc": 1612534388, "company": "adobe"}, {"body": "A locked layer smiling_face_with_sunglasses", "score": 0, "created_utc": 1612533849, "company": "adobe"}, {"body": "y'all mfs rlly charged me to cancel a subscription...", "score": 1, "created_utc": 1612533550, "company": "adobe"}, {"body": "If only one, Paintbrush I'd choose masks, but if I can't have layers, its not useful lol", "score": 1, "created_utc": 1612533054, "company": "adobe"}, {"body": "Pen tool as always", "score": 0, "created_utc": 1612532380, "company": "adobe"}, {"body": "Masks! Now I am here, now I am not!", "score": 1, "created_utc": 1612532138, "company": "adobe"}, {"body": "Easy ,Clone Stamp Tool! Then I can clone the other tools in and boom now I have all the tools...WIN", "score": 7, "created_utc": 1612531902, "company": "adobe"}, {"body": "The eraser tool. No mercy!", "score": 3, "created_utc": 1612531598, "company": "adobe"}, {"body": "I'm a pussy so I'll use the dodge tool", "score": 3, "created_utc": 1612531590, "company": "adobe"}, {"body": "Hello! I am a freelancer and have a new gig on Fiverr. Do you want to try it? Check out my Gig on Fiverr add or remove people or objects #photoshop #adobe #adobephotoshop #freelance #freelancer #Fiverr #fiverrbuyer #FiverrGig #fiverrgigpromotion", "score": 4, "created_utc": 1612531299, "company": "adobe"}, {"body": "Brush tool ))", "score": 0, "created_utc": 1612530621, "company": "adobe"}, {"body": "Dodge", "score": 0, "created_utc": 1612530539, "company": "adobe"}, {"body": "The pen tool.... kinda like a sword lol", "score": 2, "created_utc": 1612530113, "company": "adobe"}, {"body": "Pen tool", "score": 1, "created_utc": 1612529439, "company": "adobe"}, {"body": "I'm going pen tool all day. In the end, it comes down to precise selections and no one is touching me w/ the pen tool. Who want it!?", "score": 1, "created_utc": 1612529093, "company": "adobe"}, {"body": "A Reddit account with karma.", "score": 0, "created_utc": 1612528961, "company": "adobe"}, {"body": "A mace. And some mace. And a pair of trained lemurs. (I've never done one.)", "score": 0, "created_utc": 1612528760, "company": "adobe"}, {"body": "Burn, dodge, mask, cut, magnetic lasso, stamp", "score": 0, "created_utc": 1612528441, "company": "adobe"}, {"body": "None because it will crash before it loads.", "score": 1, "created_utc": 1612527814, "company": "adobe"}, {"body": "Backspace", "score": 1, "created_utc": 1612527764, "company": "adobe"}, {"body": "B R U S H", "score": 1, "created_utc": 1612527100, "company": "adobe"}, {"body": "I'll pick the magic wand tool, so I can sparkles Avadra Kedavra sparkles my opponent.", "score": 1, "created_utc": 1612526971, "company": "adobe"}, {"body": "Pen tool", "score": 0, "created_utc": 1612526958, "company": "adobe"}, {"body": "Clone Stamp. The winner gonna have to settle for a Tie. Lmaaaoooo", "score": 0, "created_utc": 1612526767, "company": "adobe"}, {"body": "LAYER MASK", "score": 1, "created_utc": 1612526528, "company": "adobe"}, {"body": "Ctrl+T always the best friends", "score": 0, "created_utc": 1612526526, "company": "adobe"}, {"body": "Pen tool", "score": 0, "created_utc": 1612526474, "company": "adobe"}, {"body": "Affinity!", "score": 0, "created_utc": 1612526312, "company": "adobe"}, {"body": "My hands", "score": 0, "created_utc": 1612525762, "company": "adobe"}, {"body": "tool", "score": 0, "created_utc": 1612525667, "company": "adobe"}, {"body": "My mouse?", "score": 0, "created_utc": 1612525547, "company": "adobe"}, {"body": "Clip Studio", "score": 0, "created_utc": 1612525118, "company": "adobe"}, {"body": "Magic wand and polygonal lasso tool, no cap", "score": 2, "created_utc": 1612525071, "company": "adobe"}, {"body": "Pen tool", "score": 0, "created_utc": 1612524873, "company": "adobe"}, {"body": "Brush and layers mask! I am unstoppable! Key commands here I come!", "score": 0, "created_utc": 1612524790, "company": "adobe"}, {"body": "Brush tool , i can draw whatever i want and it comes to life", "score": 4, "created_utc": 1612524604, "company": "adobe"}, {"body": "Uh uh uh", "score": 0, "created_utc": 1612524525, "company": "adobe"}, {"body": "Liquify paintbrush", "score": 1, "created_utc": 1612524505, "company": "adobe"}, {"body": "Pen tool smiling_face_with_smiling_eyes", "score": 0, "created_utc": 1612524298, "company": "adobe"}, {"body": "Healing Brush", "score": 0, "created_utc": 1612524244, "company": "adobe"}, {"body": "Noise to make the opponent disoriented", "score": 1, "created_utc": 1612523739, "company": "adobe"}, {"body": "Hands down the Magic Wand! Let me feel my Wizard Fantasy Realness!", "score": 3, "created_utc": 1612523532, "company": "adobe"}, {"body": "magic wand", "score": 1, "created_utc": 1612523492, "company": "adobe"}, {"body": "The quick selection tool", "score": 0, "created_utc": 1612523411, "company": "adobe"}, {"body": "Gradient with pen tool", "score": 4, "created_utc": 1612523255, "company": "adobe"}, {"body": "Mask Tool!", "score": 0, "created_utc": 1612523246, "company": "adobe"}, {"body": "Eraser, begone impudent sorcerer.", "score": 0, "created_utc": 1612523117, "company": "adobe"}, {"body": "Layers mask! That's huge for me!", "score": 0, "created_utc": 1612522844, "company": "adobe"}, {"body": "The lasso tool. Yeehaw", "score": 0, "created_utc": 1612522808, "company": "adobe"}, {"body": "Better grab Google. I know nothing.", "score": 1, "created_utc": 1612522642, "company": "adobe"}, {"body": "Spot healing brush to wipe away the negative vibes. relieved_face victory_hand", "score": 0, "created_utc": 1612522445, "company": "adobe"}, {"body": "Transform", "score": 0, "created_utc": 1612522395, "company": "adobe"}, {"body": "Brush Tool", "score": 0, "created_utc": 1612522266, "company": "adobe"}, {"body": "Pen Tool", "score": 1, "created_utc": 1612522212, "company": "adobe"}, {"body": "Brush Tool face_with_tears_of_joy", "score": 0, "created_utc": 1612522061, "company": "adobe"}, {"body": "Pen Tool! Baba", "score": 5, "created_utc": 1612521932, "company": "adobe"}, {"body": "Lasso tool smiling_face_with_smiling_eyes", "score": 0, "created_utc": 1612521921, "company": "adobe"}, {"body": "With this.", "score": 0, "created_utc": 1612521786, "company": "adobe"}, {"body": "Content aware.", "score": 0, "created_utc": 1612521717, "company": "adobe"}, {"body": "Animation", "score": 0, "created_utc": 1612521675, "company": "adobe"}, {"body": "Clone stamp tool! We're readyyy", "score": 0, "created_utc": 1612521571, "company": "adobe"}, {"body": "Brush tool, then I'd call illustrator for backup", "score": 0, "created_utc": 1612521408, "company": "adobe"}, {"body": "Knowledge", "score": 0, "created_utc": 1612521323, "company": "adobe"}, {"body": "&amp; are throwing it down!!! fire", "score": 1, "created_utc": 1612521236, "company": "adobe"}, {"body": "Someone who knows photoshop", "score": 0, "created_utc": 1612521182, "company": "adobe"}, {"body": "With Lasso and brush tool, I'm good to conquer. smiling_face_with_sunglasses", "score": 0, "created_utc": 1612520773, "company": "adobe"}, {"body": "smudge", "score": 0, "created_utc": 1612520713, "company": "adobe"}, {"body": "Content-Aware Fill, I can cover up my tracks shushing_face", "score": 3, "created_utc": 1612520695, "company": "adobe"}, {"body": "Affinity photo.", "score": 0, "created_utc": 1612520632, "company": "adobe"}, {"body": "Layer mask", "score": 0, "created_utc": 1612520457, "company": "adobe"}, {"body": "Pen tool, I'm paintin' bitches &amp; niggas respectfully", "score": 0, "created_utc": 1612520210, "company": "adobe"}, {"body": "I add a layer MASK to myself (safety first). Then I grab the quick selection tool and extract the enemy from the battle frame.", "score": 16, "created_utc": 1612520188, "company": "adobe"}, {"body": "The eraser tool.", "score": 1, "created_utc": 1612520016, "company": "adobe"}, {"body": "Pen tool!", "score": 0, "created_utc": 1612519993, "company": "adobe"}, {"body": "Pen Tool", "score": 9, "created_utc": 1612519860, "company": "adobe"}, {"body": "Your gonna be definitely erased", "score": 4, "created_utc": 1612519790, "company": "adobe"}, {"body": "Blur grinning_squinting_face", "score": 1, "created_utc": 1612519753, "company": "adobe"}, {"body": "Lasso tool is my weapon of choice. man_artist_dark_skin_tone artist_palette paintbrush", "score": 3, "created_utc": 1612519588, "company": "adobe"}, {"body": "Text tool to debate my opponents nerd_face", "score": 0, "created_utc": 1612519516, "company": "adobe"}, {"body": "Hi Trevor, are you running Photoshop in emulation mode or using the latest version of macOS BigSur? Also, which exact version of Photoshop are you using? (latest is 21.1.1) FYI, I can also reproduce this issue at my end &amp; d", "score": 0, "created_utc": 1612519466, "company": "adobe"}, {"body": "Now the battle really starts. (via Twitter", "score": 1, "created_utc": 1612519464, "company": "adobe"}, {"body": "I'm a wizard with the MAGIC WAND man_mage", "score": 2, "created_utc": 1612519325, "company": "adobe"}, {"body": "Force quit. *click* I will do them like Thanos did half the universe", "score": 1, "created_utc": 1612519272, "company": "adobe"}, {"body": "the Adobe antipiracy notice face_with_rolling_eyes", "score": 0, "created_utc": 1612519215, "company": "adobe"}, {"body": "Magic wand", "score": 1, "created_utc": 1612519171, "company": "adobe"}, {"body": "Affinity designer", "score": 1, "created_utc": 1612519079, "company": "adobe"}, {"body": "Slice tool face_with_tears_of_joy so that I can cut into pieces", "score": 0, "created_utc": 1612519068, "company": "adobe"}, {"body": "Lasso tool I will accurately select all of you then transform you until you're each about 2 pixels tall", "score": 7, "created_utc": 1612519053, "company": "adobe"}, {"body": "shift f5 honestly", "score": 0, "created_utc": 1612519017, "company": "adobe"}, {"body": "Dodge.", "score": 0, "created_utc": 1612518979, "company": "adobe"}, {"body": "Clone stamp and make more of me", "score": 0, "created_utc": 1612518936, "company": "adobe"}, {"body": "Clone stamp", "score": 0, "created_utc": 1612518747, "company": "adobe"}, {"body": "I would definitely say a cintiq!", "score": 0, "created_utc": 1612518660, "company": "adobe"}, {"body": "Polygonal lasso tool", "score": 2, "created_utc": 1612518657, "company": "adobe"}, {"body": "The lasso tool for some wild west cowboy action cowboy_hat_face", "score": 2, "created_utc": 1612518422, "company": "adobe"}, {"body": "uh oh", "score": 1, "created_utc": 1612518382, "company": "adobe"}, {"body": "Polygonal Lasso! Giddy up!", "score": 0, "created_utc": 1612518364, "company": "adobe"}, {"body": "Hi AK, I'm running Photoshop 22.1.1 on macOS Big Sur 11.2 (not emulated as far as I know?) and the misalignment has appeared for several months and product/OS updates now. Thanks for reaching out!", "score": 1, "created_utc": 1612518364, "company": "adobe"}, {"body": "Magic wand!", "score": 0, "created_utc": 1612518251, "company": "adobe"}, {"body": "Or...you could grab a whole marketing team to battle for you &gt;&gt; like us smiling_face_with_smiling_eyes #allegraimage360 #AllegraMarketing #tricitiestn", "score": 2, "created_utc": 1612518248, "company": "adobe"}, {"body": "LIQUIFY", "score": 0, "created_utc": 1612518243, "company": "adobe"}, {"body": "Magic wand", "score": 0, "created_utc": 1612518199, "company": "adobe"}, {"body": "Curves", "score": 0, "created_utc": 1612518143, "company": "adobe"}, {"body": "The line tool set to pixel; oh wait, that's no longer available in the newest version. That's why I deleted the newest build and went back a version. BTW, I started with Photoshop 5. Taught college Photoshop classes for over decade. Disappointed.", "score": 0, "created_utc": 1612518135, "company": "adobe"}, {"body": "Photoshop itself is the best tool as a creator, it never feels like a battle, but a discovery.", "score": 2, "created_utc": 1612518051, "company": "adobe"}, {"body": "ExtendScript Tool Kit", "score": 0, "created_utc": 1612517980, "company": "adobe"}, {"body": "Band-Aid", "score": 0, "created_utc": 1612517940, "company": "adobe"}, {"body": "Magic Wand tool! high_voltage #FTW", "score": 3, "created_utc": 1612517918, "company": "adobe"}, {"body": "content aware", "score": 0, "created_utc": 1612517903, "company": "adobe"}, {"body": "The hand tool so I can just fill everyone's mouth", "score": 2, "created_utc": 1612517902, "company": "adobe"}, {"body": "Layers + all it's settings", "score": 0, "created_utc": 1612517884, "company": "adobe"}, {"body": "Brush Tool", "score": 0, "created_utc": 1612517883, "company": "adobe"}, {"body": "Brush tool", "score": 0, "created_utc": 1612517881, "company": "adobe"}, {"body": "Brush tool", "score": 0, "created_utc": 1612517711, "company": "adobe"}, {"body": "Pen Tool.", "score": 0, "created_utc": 1612517637, "company": "adobe"}, {"body": "Lasso Tool one way", "score": 0, "created_utc": 1612517543, "company": "adobe"}, {"body": "Magic Wand tool! Ill make them fools disappear if they try to step to me! ayyy lmfao!", "score": 2, "created_utc": 1612517453, "company": "adobe"}, {"body": "Crop", "score": 1, "created_utc": 1612517441, "company": "adobe"}, {"body": "Smart objects OK_hand_medium-light_skin_tone", "score": 0, "created_utc": 1612517379, "company": "adobe"}, {"body": "A comedically large box of tic-tacs", "score": 2, "created_utc": 1612517341, "company": "adobe"}, {"body": "layer masks", "score": 0, "created_utc": 1612517329, "company": "adobe"}, {"body": "Content aware fill", "score": 6, "created_utc": 1612517306, "company": "adobe"}, {"body": "I pick maths.", "score": 0, "created_utc": 1612517304, "company": "adobe"}, {"body": "Pen tool", "score": 0, "created_utc": 1612517298, "company": "adobe"}, {"body": "Quick selection tool", "score": 0, "created_utc": 1612517273, "company": "adobe"}, {"body": "Blendy Finger. Because Blendy Finger.", "score": 0, "created_utc": 1612517210, "company": "adobe"}, {"body": "Heal brush so I can't die", "score": 2, "created_utc": 1612517201, "company": "adobe"}, {"body": "I will choke someone to death using the holy Lasso tool", "score": 1, "created_utc": 1612517198, "company": "adobe"}, {"body": "Dodge &amp; burn baby", "score": 1, "created_utc": 1612517145, "company": "adobe"}, {"body": "brush", "score": 2, "created_utc": 1612517107, "company": "adobe"}, {"body": "Pen tool!", "score": 0, "created_utc": 1612517095, "company": "adobe"}, {"body": "brush tool!! i can draw whatever i want, and import brushes as well brush aRMYYYYYYYYY", "score": 4, "created_utc": 1612517050, "company": "adobe"}, {"body": "lasso tool", "score": 0, "created_utc": 1612517015, "company": "adobe"}, {"body": "liquify smiling_face_with_horns", "score": 17, "created_utc": 1612516952, "company": "adobe"}, {"body": "Layer Mask! flexed_biceps flexed_biceps flexed_biceps", "score": 1, "created_utc": 1612516932, "company": "adobe"}, {"body": "Brush tool", "score": 0, "created_utc": 1612516922, "company": "adobe"}, {"body": "The Move tool.", "score": 0, "created_utc": 1612516905, "company": "adobe"}, {"body": "Layer mask", "score": 0, "created_utc": 1612516891, "company": "adobe"}, {"body": "Lightroom", "score": 1, "created_utc": 1612516883, "company": "adobe"}, {"body": "definitely an eraser so i can get rid of all the competition", "score": 2, "created_utc": 1612516867, "company": "adobe"}, {"body": "PURPLE GRADIENT PURPLE GRADIENT", "score": 14, "created_utc": 1612516856, "company": "adobe"}, {"body": "Weed", "score": 0, "created_utc": 1612516802, "company": "adobe"}, {"body": "The X on the top right side... nobody can use anything if the program is closed", "score": 0, "created_utc": 1612516772, "company": "adobe"}, {"body": "Pen tool", "score": 0, "created_utc": 1612516762, "company": "adobe"}, {"body": "the move tool XD", "score": 0, "created_utc": 1612516735, "company": "adobe"}, {"body": "Blurr tool so that nobody can see me while I kill them", "score": 0, "created_utc": 1612516734, "company": "adobe"}, {"body": "Polygon Selection Tool! The possibilities are endless", "score": 2, "created_utc": 1612516730, "company": "adobe"}, {"body": "Easy.", "score": 3, "created_utc": 1612516664, "company": "adobe"}, {"body": "Object select is here to play", "score": 0, "created_utc": 1612516654, "company": "adobe"}, {"body": "pen tool", "score": 1, "created_utc": 1612516630, "company": "adobe"}, {"body": "It's all about the refine edge and layers!!", "score": 0, "created_utc": 1612516588, "company": "adobe"}, {"body": "Patch.", "score": 0, "created_utc": 1612516490, "company": "adobe"}, {"body": "Brush!", "score": 0, "created_utc": 1612516477, "company": "adobe"}, {"body": "the spot healing brush", "score": 0, "created_utc": 1612516455, "company": "adobe"}, {"body": "Pen tool yessir", "score": 1, "created_utc": 1612516447, "company": "adobe"}, {"body": "Any of them would work really, then you can swarm them with all the bugs.", "score": 0, "created_utc": 1612516431, "company": "adobe"}, {"body": "Clone tool!", "score": 0, "created_utc": 1612516397, "company": "adobe"}, {"body": "Crop tools is for me", "score": 0, "created_utc": 1612516368, "company": "adobe"}, {"body": "Magic wand tool. I can literally do anything with that in a battle face_with_tears_of_joy", "score": 4, "created_utc": 1612516323, "company": "adobe"}, {"body": "Pen tool, takes some time but gets the best results! water_wave", "score": 2, "created_utc": 1612516312, "company": "adobe"}, {"body": "The Burn Tool! Burn baby fire burn.", "score": 23, "created_utc": 1612516287, "company": "adobe"}, {"body": "LIQUIFY!!!", "score": 1, "created_utc": 1612516284, "company": "adobe"}, {"body": "Ctrl+S tools", "score": 3, "created_utc": 1612516254, "company": "adobe"}, {"body": "Eraser of course. With this tool I can erase everything I want.", "score": 4, "created_utc": 1612516251, "company": "adobe"}, {"body": "lasso tool flushed_face", "score": 3, "created_utc": 1612516232, "company": "adobe"}, {"body": "Pen Tool and Brush Tool partying_face", "score": 2, "created_utc": 1612516225, "company": "adobe"}, {"body": "Mask tool thumbs_up", "score": 0, "created_utc": 1612516216, "company": "adobe"}, {"body": "i'll stab a bitch with the pen tool", "score": 0, "created_utc": 1612516213, "company": "adobe"}, {"body": "MASK!!!", "score": 1, "created_utc": 1612516193, "company": "adobe"}, {"body": "Pen tool, always", "score": 2, "created_utc": 1612516158, "company": "adobe"}, {"body": "camera raw filter", "score": 0, "created_utc": 1612516137, "company": "adobe"}, {"body": "Warp tool", "score": 2, "created_utc": 1612516111, "company": "adobe"}, {"body": "Lasso tool is not to be underestimated! Just going to select and delete !", "score": 10, "created_utc": 1612516086, "company": "adobe"}, {"body": "Move tool", "score": 0, "created_utc": 1612516067, "company": "adobe"}, {"body": "Clone stamp tool with a puppy reference on hand to change all my enemies into puppies, and then", "score": 34, "created_utc": 1612516021, "company": "adobe"}, {"body": "Most often I think I use selection tools. So, yeah...I'm going with Lasso. So I can tie up my opponent ha haaaa", "score": 2, "created_utc": 1612515964, "company": "adobe"}, {"body": "Magnetic lasso tool rolling_on_the_floor_laughing", "score": 4, "created_utc": 1612515960, "company": "adobe"}, {"body": "The airbrush tool . With pepper spray grinning_squinting_face", "score": 3, "created_utc": 1612515944, "company": "adobe"}, {"body": "No doubt.", "score": 7, "created_utc": 1612515917, "company": "adobe"}, {"body": "Layer mask or Pen tool...versatile", "score": 2, "created_utc": 1612515912, "company": "adobe"}, {"body": "Magic wand tool, make my opponent disappear face_with_tears_of_joy", "score": 15, "created_utc": 1612515911, "company": "adobe"}, {"body": "pen tool. time consuming but gets the best results", "score": 1, "created_utc": 1612515907, "company": "adobe"}, {"body": "Clone stamp #AttackOfTheClones heh smirking_face", "score": 1, "created_utc": 1612515904, "company": "adobe"}, {"body": "GIMP", "score": 0, "created_utc": 1612515903, "company": "adobe"}, {"body": "Clip studio paint", "score": 6, "created_utc": 1612515903, "company": "adobe"}, {"body": "I will end you all with the clone stamp.", "score": 0, "created_utc": 1612515900, "company": "adobe"}, {"body": "Surprised that no one has mentioned the Magic Wand", "score": 20, "created_utc": 1612515897, "company": "adobe"}, {"body": "Magic wand all day every day", "score": 1, "created_utc": 1612515891, "company": "adobe"}, {"body": "Hand tools only", "score": 0, "created_utc": 1612515880, "company": "adobe"}, {"body": "patch tool", "score": 0, "created_utc": 1612515866, "company": "adobe"}, {"body": "You're stepping into a Photoshop battle, which tool do you equip yourself with? (via Twitter", "score": 0, "created_utc": 1612515857, "company": "adobe"}, {"body": "I'm masking up", "score": 1, "created_utc": 1612515838, "company": "adobe"}, {"body": "Pen tool", "score": 0, "created_utc": 1612515831, "company": "adobe"}, {"body": "My brushes", "score": 1, "created_utc": 1612515800, "company": "adobe"}, {"body": "Imma just drag an image over whatever the other person does, I win.", "score": 2, "created_utc": 1612515794, "company": "adobe"}, {"body": "Clone tool", "score": 0, "created_utc": 1612515793, "company": "adobe"}, {"body": "Brush tool. You can get a lot of mileage out of that one simple tool.", "score": 5, "created_utc": 1612515761, "company": "adobe"}, {"body": "The pen tool!", "score": 0, "created_utc": 1612515745, "company": "adobe"}, {"body": "Pen Tool pen", "score": 1, "created_utc": 1612515735, "company": "adobe"}, {"body": "Pen tool.", "score": 0, "created_utc": 1612515735, "company": "adobe"}, {"body": "patch tool", "score": 0, "created_utc": 1612515721, "company": "adobe"}, {"body": "Paint tool, whatever happens is now gone", "score": 1, "created_utc": 1612515704, "company": "adobe"}, {"body": "Duh. The Lasso.", "score": 2, "created_utc": 1612515700, "company": "adobe"}, {"body": "Definitely layer masks, so I can erase them and bring them back if I feel like it face_with_tears_of_joy", "score": 30, "created_utc": 1612515695, "company": "adobe"}, {"body": "pen tool, I'll just trap them that way", "score": 3, "created_utc": 1612515695, "company": "adobe"}, {"body": "Crop tool easy to control hard to master smiling_face_with_sunglasses", "score": 5, "created_utc": 1612515684, "company": "adobe"}, {"body": "Pen tool !!!", "score": 0, "created_utc": 1612515682, "company": "adobe"}, {"body": "Clone tool", "score": 2, "created_utc": 1612515681, "company": "adobe"}, {"body": "The brush", "score": 1, "created_utc": 1612515674, "company": "adobe"}, {"body": "ummm brush?", "score": 0, "created_utc": 1612515668, "company": "adobe"}, {"body": "Pen tool", "score": 0, "created_utc": 1612515665, "company": "adobe"}, {"body": "Pen tool", "score": 0, "created_utc": 1612515654, "company": "adobe"}, {"body": "Pen tool", "score": 0, "created_utc": 1612515652, "company": "adobe"}, {"body": "Eraser because I can just erase everyone and then win?....", "score": 15, "created_utc": 1612515651, "company": "adobe"}, {"body": "selection tool", "score": 1, "created_utc": 1612515648, "company": "adobe"}, {"body": "the lasso", "score": 2, "created_utc": 1612515623, "company": "adobe"}, {"body": "beaming_face_with_smiling_eyes beaming_face_with_smiling_eyes the person in charge of this account is really doing an amazing job OK_hand", "score": 0, "created_utc": 1612499711, "company": "adobe"}, {"body": "The world needs to know what is happening in Myanmar. We are now facing Politics Problems in Myanmar Myanmar_(Burma) Myanmar_(Burma) Myanmar_(Burma) Please help us guys . We need Democracy. #HearTheVoiceOfMyanmar #WeNeedDemocracy", "score": 0, "created_utc": 1612490227, "company": "adobe"}, {"body": "Attempted to reach, failed. . . pensive_face pensive_face", "score": 0, "created_utc": 1612470489, "company": "adobe"}, {"body": "I need help I can not open any of my files in photoshop. It keeps saying u do not have permission to open the file. It does it to all my files including psd files. I do not know what else to help please.", "score": 0, "created_utc": 1612468440, "company": "adobe"}, {"body": "Even that sky can be replaced with a single click face_with_tears_of_joy #photoshop", "score": 2, "created_utc": 1612468154, "company": "adobe"}, {"body": "can you make is so that when you \"save for web\" and hit enter, it DOESNT select the entire filename with extension? Just a small thing that would make a huge difference.", "score": 0, "created_utc": 1612457860, "company": "adobe"}, {"body": "hit the and let's work and promote ourselves together LET US MAKE YOU MORE BEAUTIFUL AND CREATE AN FX ON YOU", "score": 0, "created_utc": 1612455752, "company": "adobe"}, {"body": "Please fix the text not highlighting bug. It seems 3 months ago your engineers were aware of and working on the problem. Now, it's happening to me.", "score": 0, "created_utc": 1612452822, "company": "adobe"}, {"body": "Can't imagine doing my editing without it thumbs_up Steep learning curve at the beginning, but it more than pays off once u know how to use it and have ur workflow figured out. Like the new improvements for the Selection Tools and Select Sky rocks sign_of_the_horns", "score": 0, "created_utc": 1612451626, "company": "adobe"}, {"body": "on my iPad Pro, and I can't find the sharpen tool. The internet is telling me it doesn't exist for ipad, but I can't believe that to be true. Tell me it isn't so!", "score": 0, "created_utc": 1612446159, "company": "adobe"}, {"body": "make this go viral eyes eyes", "score": 2, "created_utc": 1612439487, "company": "adobe"}, {"body": "is there a \"suggest feature\" place in Photoshop like in ...I need a button that will LOCK swatches in my swatch pallet #AdobePhotoshop #coloring", "score": 0, "created_utc": 1612436608, "company": "adobe"}, {"body": "is there a way to export all IOS Photoshop Mix projects simultaneously? Going through them all and individually sending them to the cloud would take a long time.", "score": 0, "created_utc": 1612436232, "company": "adobe"}, {"body": "Niceee", "score": 0, "created_utc": 1612435354, "company": "adobe"}, {"body": "No limit with photoshop", "score": 5, "created_utc": 1612434403, "company": "adobe"}, {"body": "Sky's the limit. (via Twitter", "score": 0, "created_utc": 1612433051, "company": "adobe"}, {"body": "Yep but make sure you don't find any giant kids beaming_face_with_smiling_eyes grinning_face_with_sweat fearful_face", "score": 1, "created_utc": 1612432417, "company": "adobe"}, {"body": "1, 2, 3...handy techniques for using Masks in Photoshop from Photoshop, and Lightroom Evangelist. Want more tutorials? Subscribe to our YouTube channel (via Twitter", "score": 1, "created_utc": 1612429467, "company": "adobe"}, {"body": "Amazing content fire", "score": 1, "created_utc": 1612429226, "company": "adobe"}, {"body": "Why can't I overwrite an image when saving out a file? This is insane.", "score": 0, "created_utc": 1612427367, "company": "adobe"}, {"body": "based", "score": 0, "created_utc": 1612418821, "company": "adobe"}, {"body": "Can you please fix the COULD NOT SAVE BECAUSE OF A PROGRAM ERROR issue that's in 22.1.1?!? It's crazy the amount of work I'm redoing and losing because of this. #photoshop", "score": 1, "created_utc": 1612416128, "company": "adobe"}, {"body": "will photoshop one day recognise FITs files? It would make a lot easier and would mean I won't need other software.", "score": 0, "created_utc": 1612409982, "company": "adobe"}, {"body": "hi it's my first time drawing food, and I don't know if I'm doing it right it's a project for school can anyone rate it?", "score": 0, "created_utc": 1612382207, "company": "adobe"}, {"body": "Tooo Gorgeous red_heart red_heart", "score": 0, "created_utc": 1612377947, "company": "adobe"}, {"body": "why does photoshop crash every. single. time. I use the levels feature right now? Incredibly frustrating.", "score": 1, "created_utc": 1612363818, "company": "adobe"}, {"body": "where would I be without you &lt;3", "score": 1, "created_utc": 1612349580, "company": "adobe"}, {"body": "not a great company! They've been taking advantage of me for years!", "score": 0, "created_utc": 1612348548, "company": "adobe"}, {"body": "thats so fye", "score": 0, "created_utc": 1612346875, "company": "adobe"}, {"body": "Tap into your third eye and get a little mystical with our Instagram monthly theme #Ps_Mystical. eye Art by Johnson Gbenga. (via Twitter", "score": 0, "created_utc": 1612346678, "company": "adobe"}, {"body": "This is stunning star-struck", "score": 2, "created_utc": 1612345020, "company": "adobe"}, {"body": "Which eye are we looking at? The little #IronMan or the #WandaVision", "score": 3, "created_utc": 1612344788, "company": "adobe"}, {"body": "Woah... flushed_face", "score": 2, "created_utc": 1612343806, "company": "adobe"}, {"body": "Magnificent style and work! Love the theme!! smiling_face_with_heart-eyes crescent_moon blue_heart", "score": 2, "created_utc": 1612343457, "company": "adobe"}, {"body": "That's stunning!", "score": 1, "created_utc": 1612343142, "company": "adobe"}, {"body": "Please give us back the pixel line tool. I don't know why we needed it removed... if people don't like it on the pixel setting they can... not? I use it quite often, especially when I'm doing something quick and rough.", "score": 0, "created_utc": 1612340714, "company": "adobe"}, {"body": "waiting 15 minutes now to download this expensive app", "score": 0, "created_utc": 1612339541, "company": "adobe"}, {"body": "I've never heard it called analog art' before, only traditional.' Gonna start saying that instead and see how many heads I turn lol", "score": 1, "created_utc": 1612333984, "company": "adobe"}, {"body": "can any one help me to recover numbers on number plate", "score": 0, "created_utc": 1612322439, "company": "adobe"}, {"body": "sooooo, when are the #AppleM1 optimizations making it to prod? It's sssssoooooooooooooo slow.", "score": 1, "created_utc": 1612321170, "company": "adobe"}, {"body": "I think Phil is starting to become a bit to content aware. You might need to do something about that.", "score": 0, "created_utc": 1612296748, "company": "adobe"}, {"body": "xibot.eth", "score": 1, "created_utc": 1612293447, "company": "adobe"}, {"body": "At least no one says make it pop to an analog artist. It is a huge difference", "score": 1, "created_utc": 1612292793, "company": "adobe"}, {"body": "PREACH!!", "score": 0, "created_utc": 1612285993, "company": "adobe"}, {"body": "Agree. Art should not fit into some sort of box. Art can and should be anything that expresses.", "score": 0, "created_utc": 1612279634, "company": "adobe"}, {"body": "Photoshop is no longer the incredible program ever into a wind up...anything useful they removed or charged an extra cost...greedy bastards.", "score": 0, "created_utc": 1612274907, "company": "adobe"}, {"body": "Or worse, the long-held notion that 'digital' means it isn't 'real' or somehow of less value than 'traditional' arts. For me, once they hold the gicle print in their hand they are absolutely thrilled. But until then ...", "score": 0, "created_utc": 1612272609, "company": "adobe"}, {"body": "GIMP is better than you intuitive user interfaces are for COWARDS", "score": 0, "created_utc": 1612271868, "company": "adobe"}, {"body": "Must be an art Twitter thing", "score": 1, "created_utc": 1612268513, "company": "adobe"}, {"body": "We're so proud. (via Twitter", "score": 0, "created_utc": 1612267454, "company": "adobe"}, {"body": "face_with_tears_of_joy Love it! #groundhogday2021 #GroundhogDay #downtownjc", "score": 0, "created_utc": 1612266676, "company": "adobe"}, {"body": "Hey, I'm advertising this Twitter account here for people who needs someone to photoshop their photos, so don't hesitate and follow me ! You'll just have to send me a picture with what you want me to change on it !", "score": 0, "created_utc": 1612266450, "company": "adobe"}, {"body": "good tweet", "score": 3, "created_utc": 1612266420, "company": "adobe"}, {"body": "Whenever I enter competitions that accept both, I always have a subconscious feeling they'll bias towards analog art.", "score": 3, "created_utc": 1612264890, "company": "adobe"}, {"body": "You'd be surprised eyes (via Twitter", "score": 0, "created_utc": 1612263885, "company": "adobe"}, {"body": "Content-Aware Phil saw his shadow today. 6 more weeks of editing. (via Twitter", "score": 0, "created_utc": 1612263882, "company": "adobe"}, {"body": "Right", "score": 0, "created_utc": 1612263644, "company": "adobe"}, {"body": "AI banned from event.", "score": 0, "created_utc": 1612262910, "company": "adobe"}, {"body": "Keep layering in the fun.", "score": 4, "created_utc": 1612261403, "company": "adobe"}, {"body": "Dad? Is that you?", "score": 8, "created_utc": 1612261070, "company": "adobe"}, {"body": "Additional editing work? Cool, just add on 40%.", "score": 0, "created_utc": 1612261053, "company": "adobe"}, {"body": "face_with_tears_of_joy ight this was a good one.", "score": 1, "created_utc": 1612260966, "company": "adobe"}, {"body": "Actually, analog is truer art. Can you imagine if Da Vinci orVan Gogh could not use their paintbrushes because they bought them a few years ago and were not up to current standards.", "score": 3, "created_utc": 1612260874, "company": "adobe"}, {"body": "We make art because we like art.", "score": 0, "created_utc": 1612260705, "company": "adobe"}, {"body": "Definitely used to make art!", "score": 3, "created_utc": 1612259074, "company": "adobe"}, {"body": "Error while saving my file today. I just cannot save it. Does anyone know how to save a file with this error? Help!", "score": 3, "created_utc": 1612258782, "company": "adobe"}, {"body": "I do both", "score": 3, "created_utc": 1612257878, "company": "adobe"}, {"body": "Say it louder for the people in the back! loudspeaker", "score": 3, "created_utc": 1612257835, "company": "adobe"}, {"body": "Was anyone disputing this?", "score": 2, "created_utc": 1612257385, "company": "adobe"}, {"body": "&amp; a true artist is a broke artist?", "score": 0, "created_utc": 1612257028, "company": "adobe"}, {"body": "Some people use photoshop for art. I just use it to troll people on the internet. I feel it's an equally worthwhile cause.", "score": 3, "created_utc": 1612257011, "company": "adobe"}, {"body": "Working on this. It probably wouldn't exist without digital editing software, as I'd do something different in the analog world.", "score": 0, "created_utc": 1612256707, "company": "adobe"}, {"body": "Hey man, Sotheby's was talking shit about your mum the other day.", "score": 0, "created_utc": 1612256672, "company": "adobe"}, {"body": "True even on after effects beaming_face_with_smiling_eyes", "score": 1, "created_utc": 1612256652, "company": "adobe"}, {"body": "Whether your art is digital or analog, it's all art. Don't let anyone tell you otherwise. (via Twitter", "score": 0, "created_utc": 1612256644, "company": "adobe"}, {"body": "Art Teachers have a different opinion", "score": 7, "created_utc": 1612256598, "company": "adobe"}, {"body": "Of course! We should let people whatever they want to do. As long as they don't harm society face_with_tears_of_joy", "score": 3, "created_utc": 1612256579, "company": "adobe"}, {"body": "Of course it is.", "score": 2, "created_utc": 1612256513, "company": "adobe"}, {"body": "Art is art. You're not capping ps folded_hands_medium-dark_skin_tone", "score": 2, "created_utc": 1612256501, "company": "adobe"}, {"body": "Photoshop spitting facts", "score": 3, "created_utc": 1612256481, "company": "adobe"}, {"body": "i wish you'd tell your billing department this", "score": 11, "created_utc": 1612256479, "company": "adobe"}, {"body": "thanks photoshop you always know just what to say", "score": 3, "created_utc": 1612256448, "company": "adobe"}, {"body": "Exactly!!", "score": 3, "created_utc": 1612256423, "company": "adobe"}, {"body": "Please Can you give me a free trial for 1 year smiling_face_with_tear growing_heart", "score": 0, "created_utc": 1612250714, "company": "adobe"}, {"body": "is a great tool for implementing our imagination to show digitally. #iamhimmanshu", "score": 1, "created_utc": 1612250295, "company": "adobe"}, {"body": "I remember this process being done by hand back in the day, there where some talented artists that where really good at this. Times have certainly changed since then.", "score": 0, "created_utc": 1612247759, "company": "adobe"}, {"body": "fuck you", "score": 0, "created_utc": 1612245895, "company": "adobe"}, {"body": ". . Do you want any Line art service ,please knock Link . # #DevletiminYanndaym #RespectLisa # #STOPRACISM # #illustration #onelineart #linedrawing #graphicdesign #Karol #fiverrLady #Dimitrescu #marr", "score": 0, "created_utc": 1612243489, "company": "adobe"}, {"body": "reminder! Tagging the first person on my grinning_face_with_sweat", "score": 0, "created_utc": 1612825034, "company": "adobe"}, {"body": "they've been listening", "score": 2, "created_utc": 1612819624, "company": "adobe"}, {"body": "I just gotta yawning_face woman_gesturing_NO_medium-light_skin_tone woman_raising_hand_medium-light_skin_tone woman_shrugging_medium-light_skin_tone woman_gesturing_OK_medium-light_skin_tone every 30 minutes to an hour in no particular order LOL", "score": 1, "created_utc": 1612818741, "company": "adobe"}, {"body": "hundred_points percent agree! #Photographer #OrangeCountPhotographer #BeachPhotography #Waves #Pier", "score": 0, "created_utc": 1612795545, "company": "adobe"}, {"body": "Frozen water? snowflake -)", "score": 3, "created_utc": 1612793653, "company": "adobe"}, {"body": "Does that count?", "score": 0, "created_utc": 1612792401, "company": "adobe"}, {"body": "Thanks! Just seeing this at mile 2 on the elipticle sweat_droplets", "score": 0, "created_utc": 1612790127, "company": "adobe"}, {"body": "Thank you!!", "score": 1, "created_utc": 1612787401, "company": "adobe"}, {"body": "That's the solution for everything huh...why not compose better.. winking_face", "score": 0, "created_utc": 1612786950, "company": "adobe"}, {"body": "Let's make reflection", "score": 4, "created_utc": 1612786879, "company": "adobe"}, {"body": "Thank you Adobe Photoshop Lightroom", "score": 1, "created_utc": 1612786820, "company": "adobe"}, {"body": "No time", "score": 0, "created_utc": 1612786625, "company": "adobe"}, {"body": "Let's dive in...", "score": 4, "created_utc": 1612786513, "company": "adobe"}, {"body": "look at Adobe out here reminding people to stay hydrated..", "score": 1, "created_utc": 1612786343, "company": "adobe"}, {"body": "I'm sick of working on my visual arts for hours just for it to not save and fucking go back to the raw file. FIX YOUR SHIT.", "score": 0, "created_utc": 1612660064, "company": "adobe"}, {"body": ".What you say??", "score": 0, "created_utc": 1612654194, "company": "adobe"}, {"body": "Something from Christmas! No getting out and about during lockdown", "score": 0, "created_utc": 1612594037, "company": "adobe"}, {"body": "Guys have a look at my profile, I promise you would not be disappointed.", "score": 0, "created_utc": 1612590803, "company": "adobe"}, {"body": "There is no light without darkness", "score": 0, "created_utc": 1612587848, "company": "adobe"}, {"body": "Ok like this smiling_face", "score": 0, "created_utc": 1612584563, "company": "adobe"}, {"body": "those v1 folks knew this day would come", "score": 1, "created_utc": 1612572468, "company": "adobe"}, {"body": "The app is running so slow on my Mac since the upgrade. Other programs are fine. Help?", "score": 1, "created_utc": 1612546170, "company": "adobe"}, {"body": "First, please make Lightroom run three times faster.", "score": 0, "created_utc": 1612543718, "company": "adobe"}, {"body": "idk I don't use lightroom, but probably it'd light a lot of light if it could light light", "score": 0, "created_utc": 1612531482, "company": "adobe"}, {"body": "Infinite light! light_bulb", "score": 0, "created_utc": 1612531401, "company": "adobe"}, {"body": "Will you support JPEG only option in tethering this year?", "score": 0, "created_utc": 1612529283, "company": "adobe"}, {"body": "A lightroom would light no amount of light since a lightroom can't light light.", "score": 0, "created_utc": 1612524285, "company": "adobe"}, {"body": "Achieved. flushed_face", "score": 0, "created_utc": 1612523462, "company": "adobe"}, {"body": "Having spent many years in that darkroom, I've thought that since I learned of Lightroom. I much prefer the light.", "score": 3, "created_utc": 1612522371, "company": "adobe"}, {"body": "How much 'shop would Adobe Photoshop 'shop, if Adobe Photoshop could 'shop 'shop? grinning_squinting_face", "score": 3, "created_utc": 1612522304, "company": "adobe"}, {"body": "y'all need to make the healing brush betterit shouldn't try to put a piece of an arm to correct part of the ground", "score": 0, "created_utc": 1612519432, "company": "adobe"}, {"body": "Hang in there, weekend's here!", "score": 1, "created_utc": 1612519318, "company": "adobe"}, {"body": "Nothing", "score": 0, "created_utc": 1612519000, "company": "adobe"}, {"body": "Can lightroom say hi?", "score": 1, "created_utc": 1612518496, "company": "adobe"}, {"body": "This much", "score": 0, "created_utc": 1612518339, "company": "adobe"}, {"body": "Depends on where your basic sliders are winking_face", "score": 0, "created_utc": 1612517957, "company": "adobe"}, {"body": "3,739 light", "score": 0, "created_utc": 1612517379, "company": "adobe"}, {"body": "Can you help me photoshop something?", "score": 4, "created_utc": 1612517182, "company": "adobe"}, {"body": "All of the darkrooms it has replaced", "score": 0, "created_utc": 1612517046, "company": "adobe"}, {"body": "OK, you do know you are typing right? LOLOLOL Have a great weekend friends", "score": 0, "created_utc": 1612516515, "company": "adobe"}, {"body": "As much light as Lightroom wanted to light if Lightroom could light light", "score": 2, "created_utc": 1612516409, "company": "adobe"}, {"body": "As much as lightroom could light light, if lightroom could light light", "score": 4, "created_utc": 1612516251, "company": "adobe"}, {"body": "How much flash could an Adobe Flash flash if an Adobe Flash could flash Flash?", "score": 2, "created_utc": 1612516241, "company": "adobe"}, {"body": "\"that three times fast\" EZ first try.", "score": 2, "created_utc": 1612516166, "company": "adobe"}, {"body": "Depends. If the world is raw +10, otherwise +5.", "score": 1, "created_utc": 1612516138, "company": "adobe"}, {"body": "how are you, lightroom social media manager?", "score": 24, "created_utc": 1612516076, "company": "adobe"}, {"body": "This is cute but what we really NEED is to permanently add a folder of our choice to the import source options.", "score": 1, "created_utc": 1612515953, "company": "adobe"}, {"body": "I can't answer to that lightly.", "score": 0, "created_utc": 1612515818, "company": "adobe"}, {"body": "try saying that three times fast", "score": 57, "created_utc": 1612515610, "company": "adobe"}, {"body": "What?", "score": 0, "created_utc": 1612498870, "company": "adobe"}, {"body": "Done", "score": 0, "created_utc": 1612477126, "company": "adobe"}, {"body": "thankyou so much for helping us look good (Though It never worked for me) #fridaymorning", "score": 0, "created_utc": 1612474866, "company": "adobe"}, {"body": "I crop dust on the reg pile_of_poo dashing_away", "score": 0, "created_utc": 1612471168, "company": "adobe"}, {"body": "Do you mean crap", "score": 0, "created_utc": 1612468576, "company": "adobe"}, {"body": "any clue why my new preset - that has color grading selected - doesn't actually apply color grading? My color grading only presets work just fine, but not ISO adaptive ones. Fix this please #lightroombug #lightroom #lightroompresets #adobe", "score": 1, "created_utc": 1612465700, "company": "adobe"}, {"body": "The price for adobe photography plan face_savoring_food", "score": 0, "created_utc": 1612455619, "company": "adobe"}, {"body": "Just content aware fill it out?", "score": 0, "created_utc": 1612453101, "company": "adobe"}, {"body": "So far it gotta be this beaut.", "score": 1, "created_utc": 1612448131, "company": "adobe"}, {"body": "have sent you numerous emails and dms about the constant glitches on my account, not one response. Maybe time to look at cancelling my account and seeing what other options are open out there", "score": 0, "created_utc": 1612444982, "company": "adobe"}, {"body": "I do crop lots of photos on daily basis..", "score": 0, "created_utc": 1612442084, "company": "adobe"}, {"body": "Can I also do this with my belly fat, too?", "score": 1, "created_utc": 1612436569, "company": "adobe"}, {"body": "its sad, at least I can replace a sky and mask it well into the shot. How do you feel about mountians? thinking_face", "score": 1, "created_utc": 1612436368, "company": "adobe"}, {"body": "Probably worst advice ever...That and you'll photoshop it later, right?", "score": 0, "created_utc": 1612435833, "company": "adobe"}, {"body": "if i only could crop out last year worried_face", "score": 1, "created_utc": 1612435413, "company": "adobe"}, {"body": "I didn't get your point, explain me first.", "score": 0, "created_utc": 1612435368, "company": "adobe"}, {"body": "Never have that mentality. Try to always take a picture and not crop. winking_face_with_tongue", "score": 0, "created_utc": 1612435076, "company": "adobe"}, {"body": "If I crop then I'll be all alone face_with_tears_of_joy", "score": 0, "created_utc": 1612434098, "company": "adobe"}, {"body": "*goes through photos of me and my ex*", "score": 3, "created_utc": 1612433437, "company": "adobe"}, {"body": "Done. thumbs_up", "score": 18, "created_utc": 1612433291, "company": "adobe"}, {"body": "I cropped 3 times already, should I crop one more time?", "score": 2, "created_utc": 1612433200, "company": "adobe"}, {"body": "It's not trick face_with_tears_of_joy face_with_tears_of_joy face_with_tears_of_joy", "score": 0, "created_utc": 1612433101, "company": "adobe"}, {"body": "mixed messages there, lightroom.", "score": 2, "created_utc": 1612433081, "company": "adobe"}, {"body": "rolling_on_the_floor_laughing fire real composers know the trick", "score": 0, "created_utc": 1612433019, "company": "adobe"}, {"body": "Thats exactly what I dont. Compose it right in the frame.", "score": 1, "created_utc": 1612432964, "company": "adobe"}, {"body": "Cropping is for squares", "score": 4, "created_utc": 1612432944, "company": "adobe"}, {"body": "Don't worry about it, I'll deal with it in post... *in post...*", "score": 9, "created_utc": 1612432943, "company": "adobe"}, {"body": "okkkkkk, but it's my grandma.", "score": 7, "created_utc": 1612432931, "company": "adobe"}, {"body": "Real photos are perfectly composed. grinning_face_with_sweat", "score": 0, "created_utc": 1612432917, "company": "adobe"}, {"body": "As I do with everything in my life", "score": 5, "created_utc": 1612432906, "company": "adobe"}, {"body": "Ooo i love the pink and purple in the sky.", "score": 2, "created_utc": 1612424093, "company": "adobe"}, {"body": "colour management, ICC display profiles ... things that photographers care about ... why don't you care enough about that issue to light a fire under a product manager's arse to get a fix out? 3 and a bit months we are still waiting...", "score": 1, "created_utc": 1612367789, "company": "adobe"}, {"body": "How do I post the link from my LR Discover in this thread?", "score": 0, "created_utc": 1612353167, "company": "adobe"}, {"body": "I'm already on it snowflake smiling_face_with_smiling_eyes", "score": 1, "created_utc": 1612348811, "company": "adobe"}, {"body": "Download these light and airy presets that are perfect for lifestyle and travel photos. In this bundle, you'll receive Lightroom desktop presets, &amp; Lightroom mobile presets Link", "score": 0, "created_utc": 1612329254, "company": "adobe"}, {"body": "Download these light and airy presets that are perfect for lifestyle and travel photos. In this bundle, you'll receive Lightroom desktop presets, &amp; Lightroom mobile presets Link", "score": 0, "created_utc": 1612329234, "company": "adobe"}, {"body": "does Lightroom classic support tethering for the R5 yet ?", "score": 0, "created_utc": 1612322173, "company": "adobe"}, {"body": "The shortcut to pick a photo on iOS is 'P' and on desktop it is 'Z'. Why?", "score": 0, "created_utc": 1612314148, "company": "adobe"}, {"body": "Are you implying one can only process pictures for half the year.", "score": 0, "created_utc": 1612313033, "company": "adobe"}, {"body": "I saw some quail this morning. Does that count?", "score": 0, "created_utc": 1612264224, "company": "adobe"}, {"body": "Why? Winter is awesome for taking pictures! I need some more snow to continue in my series ;-)", "score": 0, "created_utc": 1612260964, "company": "adobe"}, {"body": "Or get out and shoot!", "score": 1, "created_utc": 1612260183, "company": "adobe"}, {"body": "If there were only 6 more weeks of winter guaranteed I would be ecstatic ) Probably 8 weeks out where I live!", "score": 0, "created_utc": 1612260119, "company": "adobe"}, {"body": "20 today in Zaragoza, Spain - winter? thinking_face thinking_face thinking_face", "score": 1, "created_utc": 1612260087, "company": "adobe"}, {"body": "I don't live in Pennsylvania so I'm going to listen out for the news...", "score": 1, "created_utc": 1612259991, "company": "adobe"}, {"body": "WEEE BACK IN BUISSNESSSS 4 MEEEEEEEE", "score": 1, "created_utc": 1612259925, "company": "adobe"}, {"body": "6 more weeks of winter. Back to editing everybody.", "score": 94, "created_utc": 1612259892, "company": "adobe"}, {"body": "are you sure you're Lightroom?", "score": 0, "created_utc": 1612259587, "company": "adobe"}, {"body": "SIX MORE WEEKS OF WINTER?!", "score": 1, "created_utc": 1612259553, "company": "adobe"}, {"body": "coming through with the results!", "score": 0, "created_utc": 1612258970, "company": "adobe"}, {"body": "Why does Lightroom sync services NOT sync keywords? Edit images at main computer fine, but I want to keyword on a laptop in a more relaxed setting via sync, but it cannot. Is this possible? If not, please add it - it's 2021.", "score": 1, "created_utc": 1612257896, "company": "adobe"}, {"body": "#Cleethorpes at Dawn! Taken 01-02-21 what a Beautiful place I live! Shot with Canon 7D and Sigma 17-70mm. Little bit of editting in LR to straighten it up and add some more Glow!!", "score": 0, "created_utc": 1612250101, "company": "adobe"}, {"body": "Only if we could clone-stamp the negativity with positivity along the way of life", "score": 0, "created_utc": 1612239785, "company": "adobe"}, {"body": "Thank you!!!", "score": 0, "created_utc": 1612837624, "company": "adobe"}, {"body": "I wanna learn this!", "score": 0, "created_utc": 1612818764, "company": "adobe"}, {"body": "Hello - this stuff is on the Performance tab, not the File Handling tab.", "score": 1, "created_utc": 1612812392, "company": "adobe"}, {"body": "Thank you guys!", "score": 0, "created_utc": 1612791082, "company": "adobe"}, {"body": "can we update CC to auto-quit if any of these things aren't happening instead of telling us this dumb pop-up? I'm quitting bc I know things are done...", "score": 0, "created_utc": 1612780280, "company": "adobe"}, {"body": "Photoshop is the best! Source images my own...thamk you for viewing )", "score": 0, "created_utc": 1612776110, "company": "adobe"}, {"body": "worst customer service in the history of customer services. I wish I had enough following to make this trend", "score": 0, "created_utc": 1612760778, "company": "adobe"}, {"body": "I have a plan with you but can't sign in which is why I need support, but I can't get support without signing in. Can you please advise on how I can get over the phone support?", "score": 1, "created_utc": 1612759110, "company": "adobe"}, {"body": "So original! Thanks for #MondayMorning motivation!", "score": 0, "created_utc": 1612752836, "company": "adobe"}, {"body": "why are you so EXPENSIVE", "score": 0, "created_utc": 1612701274, "company": "adobe"}, {"body": "Can we get a Photographer/ Videographer Bundle yet? i just want Photoshop, Lightroom and Premiere.", "score": 0, "created_utc": 1612691494, "company": "adobe"}, {"body": "Hi I will creative business logo desgn More info/Order now", "score": 0, "created_utc": 1612636854, "company": "adobe"}, {"body": "Why am I getting charged for a cancelled subscription? Also, why is there no way to remove my credit card information from the account!", "score": 2, "created_utc": 1612626779, "company": "adobe"}, {"body": "Dear CC, lately I have to log in almost every single time I open PS or LR. Up till a point I'm even considering using pirated software instead, just to get rid of the constant login prompts. Any tips on how to avoid this? Thanks!", "score": 1, "created_utc": 1612578884, "company": "adobe"}, {"body": "Empire. Best sequel maybe ever made", "score": 0, "created_utc": 1612558805, "company": "adobe"}, {"body": "Great work!", "score": 0, "created_utc": 1612545066, "company": "adobe"}, {"body": "Dreamweaver has a problem with not registering or saving my edits. It looks like it saves them but when I open them again all my changes are gone. It's been like this forever! Very annoying!", "score": 1, "created_utc": 1612540550, "company": "adobe"}, {"body": "So beautiful designs star-struck", "score": 0, "created_utc": 1612521900, "company": "adobe"}, {"body": "y u update urself everytime i boot the computer up. it's annoying add to the fact i'm poor these updates are really doing in my data plan. pls stahp", "score": 1, "created_utc": 1612516231, "company": "adobe"}, {"body": "Last night was the first time and it happen twice back to back...Running Adobe System on its own 1TB SSD separate from everything else. Nitro 5 laptop and tuff raised_fist_medium-light_skin_tone flexed_biceps_medium-light_skin_tone", "score": 1, "created_utc": 1612515131, "company": "adobe"}, {"body": "beautiful", "score": 0, "created_utc": 1612512485, "company": "adobe"}, {"body": "Is it too late to submit", "score": 0, "created_utc": 1612512294, "company": "adobe"}, {"body": "Way easier to create with Adobe Photoshop and layer masks.", "score": 0, "created_utc": 1612499038, "company": "adobe"}, {"body": "The fox", "score": 1, "created_utc": 1612492938, "company": "adobe"}, {"body": "Please don't kill #MacBookPro . Fan speed is 100%. Finally removed it. folded_hands", "score": 0, "created_utc": 1612479859, "company": "adobe"}, {"body": "This Adobe Creativity is Amazing star-struck red_heart red_heart red_heart", "score": 0, "created_utc": 1612468190, "company": "adobe"}, {"body": "MAKE YOUR PRICES CHEAPER IN 2021! There's a worldwide pandemic affecting peoples income and yall still don't even have grant programs or deals for people that by using your tools are actually trying to create products for income smh...", "score": 0, "created_utc": 1612466224, "company": "adobe"}, {"body": "I'm tensely waiting man_bowing ... I hope you review mine also", "score": 0, "created_utc": 1612461513, "company": "adobe"}, {"body": "I'm amazed at how good you guys are at breaking your own software. I don't think you'll ever be able to top breaking the PS line tool for no reason, but giving us the Super Zoom neural filter and then breaking it 2 updates later is *chef's kiss*", "score": 0, "created_utc": 1612430486, "company": "adobe"}, {"body": "Wow I love the design, hopefully a tutorial about this red_heart", "score": 2, "created_utc": 1612426197, "company": "adobe"}, {"body": "They are too many!! grinning_face_with_sweat person_shrugging", "score": 1, "created_utc": 1612424522, "company": "adobe"}, {"body": "Choo choo mothafaka", "score": 1, "created_utc": 1612414859, "company": "adobe"}, {"body": "Adobe Photoshop and premier pro is love..", "score": 0, "created_utc": 1612401371, "company": "adobe"}, {"body": "How can we make sure it was viewed?", "score": 0, "created_utc": 1612396750, "company": "adobe"}, {"body": "Gorgeous!", "score": 0, "created_utc": 1612384299, "company": "adobe"}, {"body": "Users outside my org need access to my creative cloud library, I send them link, Adobe Stock items they cannot access (tho they're working on my behalf)... ok, I'll just export all the files... THERE'S NO WAY TO EXPORT FILES FROM ADOBE CREATIVE CLOUD LIBRARIES!!!", "score": 1, "created_utc": 1612370883, "company": "adobe"}, {"body": "4th time premiere pro has closed down on me today, count your days smiling_face_with_horns", "score": 0, "created_utc": 1612363967, "company": "adobe"}, {"body": "hey when do you guys an on optimizing for the M1 laptops, would hate to have to switch over to FCP or Resolve", "score": 0, "created_utc": 1612363515, "company": "adobe"}, {"body": "what is fresco????", "score": 0, "created_utc": 1612348467, "company": "adobe"}, {"body": "I'm furious. I've been paying 19 a month and I've only ever used photoshop. I don't even know what those other apps do!", "score": 0, "created_utc": 1612348450, "company": "adobe"}, {"body": "I've been paying 19 a month and I only use photoshop. I've been miss sold the plan!!", "score": 1, "created_utc": 1612348364, "company": "adobe"}, {"body": "going to get penalised for cancelling subscription from this company that over charges most of its clients! THANKS", "score": 0, "created_utc": 1612347827, "company": "adobe"}, {"body": "still waiting for photoshop to install. Wasted quite a bit of my time now", "score": 0, "created_utc": 1612339808, "company": "adobe"}, {"body": "now waiting 10 minutes for a reply. Must be busy", "score": 0, "created_utc": 1612339660, "company": "adobe"}, {"body": "still no photoshop. Its benn 20 minutes now", "score": 0, "created_utc": 1612339580, "company": "adobe"}, {"body": "how do i stop cre3ative cloud taking up space on my laptop. Happy to rent you space on my laptop if that works for you", "score": 0, "created_utc": 1612339502, "company": "adobe"}, {"body": "quick to trake money but slow to provide product", "score": 0, "created_utc": 1612339423, "company": "adobe"}, {"body": "still waiting for photoshop to download!!", "score": 1, "created_utc": 1612339382, "company": "adobe"}, {"body": "at one point I was paying 50 a month to use photoshop. I've paid for this app 10 times over", "score": 0, "created_utc": 1612339344, "company": "adobe"}, {"body": "someone at adobe is getting fat enjoying life while the rest of us suffer through pandemic. I pay 20 a month for privilage of having Creative sweet take uop memory on my laptop. I use this app once or twice every 6 months! Adoibe should be ashamed of stealing", "score": 1, "created_utc": 1612338917, "company": "adobe"}, {"body": "your app is a huge pain!", "score": 1, "created_utc": 1612338770, "company": "adobe"}, {"body": "why is the InDesign logo bigger? thinking_face man_shrugging man_facepalming", "score": 0, "created_utc": 1612316729, "company": "adobe"}, {"body": "I tried a series like this last year using I love the concept of it. It's creepy in a cool way eye cherry_blossom", "score": 2, "created_utc": 1612315142, "company": "adobe"}, {"body": "So good", "score": 0, "created_utc": 1612313731, "company": "adobe"}, {"body": "can you please explain this to me and these weird lines when I move the mouse? tried running on CPU and GPU all drivers updated and using 16gb RAM And still doesn't meet minimum requirements???", "score": 0, "created_utc": 1612280740, "company": "adobe"}, {"body": "I have a request. Every time I preview in Premiere Pro, I have to press [L] key to double speed. That action is tedious. I want to set it to double speed from the beginning. Is there a setting to make preview twice as fast from the beginning? If not, please update", "score": 1, "created_utc": 1612264308, "company": "adobe"}, {"body": "why do I keep getting logged out while I'm actively working??! Wtf", "score": 1, "created_utc": 1612264063, "company": "adobe"}, {"body": "How do I stop this battery hog? I found a 3-year-old thread which is not useful.", "score": 0, "created_utc": 1612260900, "company": "adobe"}, {"body": "You MUST WATCH THIS And order for it Now", "score": 0, "created_utc": 1612259475, "company": "adobe"}, {"body": "if I get the Adobe creative package on a monthly package can I use it on more than one device?", "score": 1, "created_utc": 1612258414, "company": "adobe"}, {"body": "InDesign installed without any hiccups on my new MacBook Pro with Big Sur...I've been using it all day and then BOOM it's crashed 3 times in the past hour. Do I need something else to make it work or am I basically stuffed until you get it up to date?", "score": 1, "created_utc": 1612254822, "company": "adobe"}, {"body": "You're sending me the same email 4 times. FFS.", "score": 0, "created_utc": 1612254280, "company": "adobe"}, {"body": "Replied thumbs_up_light_skin_tone", "score": 0, "created_utc": 1612839138, "company": "adobe"}, {"body": "I'm on Mac OS 10.15.7. Since it hit V25 the stability has gone (has crashed on multiple files and is unusable for what I want to achieve). I work with more complicated vectors (av file size 1GB) and wonder if the dev's are catering to more beginners and forgetting the experts?", "score": 0, "created_utc": 1612839087, "company": "adobe"}, {"body": "im good now my laptop is just shit lol thanks tho thumbs_up", "score": 0, "created_utc": 1612838964, "company": "adobe"}, {"body": "I've done that and that still comes up with missing linked media. And it's now doing it in CC2020 and the new CC version.", "score": 1, "created_utc": 1612838000, "company": "adobe"}, {"body": "I was on 14.9 rolled back to 14.7, 14.5 and below did not work either. I ran in admin mode as well, even moved the save file onto an SSD rather then the HDD to make it work also which is not ideal considering most of the work is moved around on HDD's", "score": 1, "created_utc": 1612836288, "company": "adobe"}, {"body": "It just freezes on the creating copy part when in the project management section. Don't have a video at this current point as I downgraded the edition. And after around 15 minutes it finally completed. The scrubbing however is bad. Freezing non stop.", "score": 1, "created_utc": 1612835144, "company": "adobe"}, {"body": "I'll DM you my contact details. Also, and for some reason it isn't showing in the chat, your team asked for me to send the specs on the device I use primarily so here it is once again", "score": 1, "created_utc": 1612834978, "company": "adobe"}, {"body": "Disabling GPU makes LR super slow but no freezes. Not sure how re-installing could help, but let me try.", "score": 1, "created_utc": 1612833542, "company": "adobe"}, {"body": "Hi Atul  I'm talking about exporting FROM Adobe XD as a layered .psd  something which isn't an option at the moment. I can only export from XD as PNG, SVG, PDF or JPG. Lots of chat on the Adobe forums crying out for Adobe to introduce export to PSD!", "score": 1, "created_utc": 1612832661, "company": "adobe"}, {"body": "Thank", "score": 1, "created_utc": 1612832103, "company": "adobe"}, {"body": "The media is saved on my Desktop on my MacBook Pro, in its own folder. Not ideal is an understatement! At this rate, and after watching YouTube instruction with no success, I may as well delete the project in it's entirety from 2019 CC and start the damn thing again!", "score": 1, "created_utc": 1612831123, "company": "adobe"}, {"body": "oh wow! i didn't know that! man, i feel silly for not checking out that button. thanks for the help NM!", "score": 1, "created_utc": 1612823647, "company": "adobe"}, {"body": "Malware cares x", "score": 0, "created_utc": 1612810411, "company": "adobe"}, {"body": "10.15.7 and 10.1.1 After changing the graphics setting, it works better.", "score": 1, "created_utc": 1612809430, "company": "adobe"}, {"body": "Windows Pro 10.0.19042 Build 19042 - Photoshop 22.1.1 I was working on a 4960x8160px file, with 59 layers &amp; 13 Groups. I was opening 8 JPEG images when PS stopped responding..", "score": 2, "created_utc": 1612808542, "company": "adobe"}, {"body": "Yes. It freezes a lot. Images are pixelating, and sliders are laggy.", "score": 1, "created_utc": 1612806842, "company": "adobe"}, {"body": "Thank you! I actually versioned down and that fixed it, but I am hoping the bug gets solved on the newest update!", "score": 1, "created_utc": 1612805690, "company": "adobe"}, {"body": "yeah fix your shit or make it free", "score": 0, "created_utc": 1612802744, "company": "adobe"}, {"body": "So I still cannot find the other folders by doing the search and have decided opened up the Project in the new Prem Pro and I get this. C'mon folks, this is getting STUPID!!! Why do you make this so damn complicated!?", "score": 1, "created_utc": 1612800206, "company": "adobe"}, {"body": "thank you very much, i've tried these fixes and it doesn't seem to have affected my export at all. there may be a bigger program issue or computer issue on my end.", "score": 1, "created_utc": 1612799588, "company": "adobe"}, {"body": "I've managed to find some of the folders, but there are still 23 that cannot be found. This is total Adobe Obsolescence! If I save a Premiere Pro project into the Creative Cloud I expect I to be able to access it in a newer version of the programme. This is ridiculous", "score": 0, "created_utc": 1612799226, "company": "adobe"}, {"body": "Thanks for answering, but my question is if these data that appear on my mobile ... they are just let's say they do not influence Space on my mobile, when seeing these GB numbers I do not know if they are Real or only virtual in the APP ; Thank", "score": 1, "created_utc": 1612798701, "company": "adobe"}, {"body": "This is happening even after a clean install of Premiere. The application is not allowing me to drag clips to the timeline", "score": 1, "created_utc": 1612798404, "company": "adobe"}, {"body": "I am not as familiar with using photoshop to export a premiere pro mp4 file. do you have information or a guide on how to do that?", "score": 1, "created_utc": 1612796039, "company": "adobe"}, {"body": "It's already been taken care of, I'm surprised yet appreciative that yall responded tho", "score": 1, "created_utc": 1612795385, "company": "adobe"}, {"body": "Thanks! Link", "score": 0, "created_utc": 1612795193, "company": "adobe"}, {"body": "I've had a gradient banding issue with each export I've done. I've tried different settings with no effect in both the 2018 and 2020 versions. the issue is less pronounced in the preview of the video (not by much). the export settings i've tried are all different.", "score": 1, "created_utc": 1612794983, "company": "adobe"}, {"body": "I don't know, because why the hell would I draw with a mouse?! But... instead of trying get me to help you pin it on how about taking an active interest in solving a problem that makes YOUR SOFTWARE USELESS? Talk to THEM, not me. Research. Test. Fix.", "score": 1, "created_utc": 1612794126, "company": "adobe"}, {"body": "Tried doing that multiple times and it still crashes.", "score": 1, "created_utc": 1612793108, "company": "adobe"}, {"body": "Will share a video when next it happens", "score": 1, "created_utc": 1612788794, "company": "adobe"}, {"body": "I need my subscription cancelled please. ASAP. I don't want it anymore and the charges is unwarranted. I want it cancelled please", "score": 0, "created_utc": 1612788575, "company": "adobe"}, {"body": "Once the text isn't highlighting on the art board it also affect the property panel", "score": 1, "created_utc": 1612788549, "company": "adobe"}, {"body": "This getting ANNOYING! This error has been happening since this past May! Thru several revisions of Photoshop and macOS. This has NEVER been fixed.", "score": 1, "created_utc": 1612788303, "company": "adobe"}, {"body": "Could you please stop treating me like an idiot? I work since over 10 years with it...so please dont ask me BS-questions.", "score": 0, "created_utc": 1612787505, "company": "adobe"}, {"body": "Here you are. (DM'd as well.) Streamlabs OBS was the only app I could figure out to remedy this issue with my UMC202HD. I think people on the other end of a Discord/Zoom call can hear me out of both ears on their end.", "score": 1, "created_utc": 1612787190, "company": "adobe"}, {"body": "Hi, thanks for your prompt response. I was able to Restart the program after enabling the anchor points in the prefs. Then I selected \"COMMAND + H\" for select edges and it worked. Thanks.", "score": 1, "created_utc": 1612785968, "company": "adobe"}, {"body": "However... ...as I suspected, launching as root user didn't 'unblock' whatever is stopping me launching as a normal user. I logged out of root, and back in as myself, and still it freezes during the 'adding extensions' part of the launch process.", "score": 0, "created_utc": 1612785833, "company": "adobe"}, {"body": "My team was charged for 13 adobe stock licenses (we don't use adobe stock), but your team cant find that we were ever charged (our bank disagrees). So the question is what information can the bank give you to find those charges and to refund us by the 15th", "score": 1, "created_utc": 1612784916, "company": "adobe"}, {"body": "I have Windows", "score": 1, "created_utc": 1612784368, "company": "adobe"}, {"body": "Thank you so much! -)", "score": 0, "created_utc": 1612782966, "company": "adobe"}, {"body": "I really appreciate this answer. The last updates are the problem. Media pending in all the files and there is no way for me to solve it. I erased the app I downloaded the 14. 5 version and works. But it's late, I'm working on DaVinci.", "score": 1, "created_utc": 1612782922, "company": "adobe"}, {"body": "I have uploaded a video to explain what I mean. There is no difference on how this works in CS6 or in CC2021, but I sincerely think that this should ever work like in Option A, in the video", "score": 2, "created_utc": 1612782343, "company": "adobe"}, {"body": "Did not work. Gave up.", "score": 1, "created_utc": 1612780541, "company": "adobe"}, {"body": "Yeah I want my illustration designs as a plugin for people to use.", "score": 1, "created_utc": 1612779915, "company": "adobe"}, {"body": "I have uploaded it and send via DM", "score": 1, "created_utc": 1612779469, "company": "adobe"}, {"body": "Thanks. I'll try this this evening.", "score": 1, "created_utc": 1612779400, "company": "adobe"}, {"body": "Hey Adobe, every time InDesign gets an update, the next time I launch it, it shows me this stupid video that I can't close. I have to quit and relaunch the app to get rid of it.", "score": 1, "created_utc": 1612777740, "company": "adobe"}, {"body": "I'm a Mac user of over 25 years, but not sure I know how to enable root user, or even what that means. Is it safe?", "score": 1, "created_utc": 1612777194, "company": "adobe"}, {"body": "Yes everything shows on web and is synced to Lightroom CC", "score": 2, "created_utc": 1612774688, "company": "adobe"}, {"body": "Yes, unfortunately it does. I had already done this configuration and also uninstallthe program. But that's still happening.", "score": 1, "created_utc": 1612774448, "company": "adobe"}, {"body": "Ready, it's done!", "score": 1, "created_utc": 1612774004, "company": "adobe"}, {"body": "PS Aha.....LR5 was born with Windows 7 and never existed for XP as an example?", "score": 0, "created_utc": 1612773587, "company": "adobe"}, {"body": "Wow...your excuses get lamer with every answer. Why did you tell me than all this rubish the last time?", "score": 0, "created_utc": 1612773509, "company": "adobe"}, {"body": "Thanks guys but the problem is still there, regards", "score": 1, "created_utc": 1612771840, "company": "adobe"}, {"body": "Apparently my upload issues are fixed, but Lightroom will not sync anything I did in the cloud back to classic. (Flagging, basic edits, crop) This is killing my workflow", "score": 1, "created_utc": 1612771445, "company": "adobe"}, {"body": "Is it really so difficult to read my tweet? \"It is a fresh computer\" means \" it is ANOTHER one\". So how can \"as adviced\" be a competent answer? #lightroom #Adobe", "score": 1, "created_utc": 1612768915, "company": "adobe"}, {"body": "Thank you I will try this and will let you know if I'm still running into issues", "score": 0, "created_utc": 1612768774, "company": "adobe"}, {"body": "Hi, thank you for the fast reply! I'm using ver 22.1.1. I tried to reset the preferences, the tablet and the drivers but nothing is working. The issue seems to be keymapping so maybe there's a way to remap undo to something other than CMD+Z since CMD is triggering the moving tool", "score": 1, "created_utc": 1612767335, "company": "adobe"}, {"body": "I'll give it a shot", "score": 0, "created_utc": 1612767105, "company": "adobe"}, {"body": "Windows 10 &amp; Illustrator V25.1. I was having issues opening a project from my creative cloud. Once I finally got it open &amp; I'm signed in to get a custom color from my library it was giving me the error \"To use Creative Cloud libraries please sign in to Creative Cloud\" then crash", "score": 1, "created_utc": 1612767063, "company": "adobe"}, {"body": "That did the trick. Thanks!", "score": 2, "created_utc": 1612766815, "company": "adobe"}, {"body": "That's been done and I still get crashes", "score": 1, "created_utc": 1612766100, "company": "adobe"}, {"body": "Thanks for persevering with me on this, but alas that has made no difference. (And I tried with bit the Photoshop M1 beta and the normal version.)", "score": 1, "created_utc": 1612765932, "company": "adobe"}, {"body": "Thanks for these! Unfortunately even the help article reveals that only one page of a PDF (or AI file) can be dropped into another AI file as a link at a time. Been trying to learn JavaScript to see what I can do.", "score": 1, "created_utc": 1612764468, "company": "adobe"}, {"body": "Yes I'm still having the problem. I'm at work now so I'll have to try later", "score": 0, "created_utc": 1612763304, "company": "adobe"}, {"body": "I will once I finish my clean up on the shots that have transferred over to photoshop", "score": 0, "created_utc": 1612763227, "company": "adobe"}, {"body": "Can you please read my tweets? I already told you and you dont want to waste your costumers time, do you? #lightroom #adobe", "score": 1, "created_utc": 1612762562, "company": "adobe"}, {"body": "Tried a lot of that already. Reinstalling the previous version stopped the problem. So I think the ball is in y'all's court.", "score": 1, "created_utc": 1612762457, "company": "adobe"}, {"body": "Lightroom Classic V10, PC and yes it happens while editing shots. To whit prevents me from doing anything else until it finally crashes. I've sent multiple reports on this and still no resolution.", "score": 1, "created_utc": 1612762290, "company": "adobe"}, {"body": "It's the same as this bug report - in version 16.1, saving a file = a warning that the file needs repair, I click 'repair' and changes/new file is lost. I reinstalled the previous version and now there's no issue, but I'm wary about updating.", "score": 1, "created_utc": 1612761660, "company": "adobe"}, {"body": "Thanks. I'm downgrading from Big Sur back to Catalina. Big Sur itself offers me nothing substantial at this time so it won't affect me.", "score": 0, "created_utc": 1612759172, "company": "adobe"}, {"body": "Hello, the video driver is updated yes, and the problem has been presented exclusively in , as to the #Photoshop, #illustrator, etc... work normally.", "score": 1, "created_utc": 1612749940, "company": "adobe"}, {"body": "Adobe connect doesn't seem to work on mobile devices anymore. Is there a new version of the app that does?", "score": 1, "created_utc": 1612748486, "company": "adobe"}, {"body": "I tried uninstalling and reinstalling several times, but after looking at online forums, I used the Adobe cleaner tool and removed everything to do with Adobe them reinstalled just the creative cloud a photoshop, then it worked. I'm running on Win10. Cheers.", "score": 1, "created_utc": 1612743832, "company": "adobe"}, {"body": "Thanks for replying. Lag mostly with brush tool. Lines and especially colouring. Running iOS 14.3. No I haven't tried reinstalling yet.", "score": 1, "created_utc": 1612743262, "company": "adobe"}, {"body": "i dont really see how this info is relevant to being appointed vice president of product but ok Osx 11.0.1 Photoshop 22.1", "score": 1, "created_utc": 1612740695, "company": "adobe"}, {"body": "So on the screen, I've clicked locate and it goes through its search but freezes. If I come out of it and don't bother going through link media, the footage is available to play back on my time line but the files all have ? in the Bins.", "score": 1, "created_utc": 1612725970, "company": "adobe"}, {"body": "hi, I have a charge of $21.99 AUD leaving my bank account and I'm unsure why. I have a subscription with you from a separate account, but I can't find where the $21.99 would come from. Please can you help?", "score": 1, "created_utc": 1612721931, "company": "adobe"}, {"body": "Switched the companies plan 2 biz. Rep very attentive until I PAID. Needed 2 \"migrate\" individual user to new. Sent x's email 2 NO ANSWER. Chatting faster-took solid 55 min to add license users onto my account. While on hold for 2 hours...", "score": 1, "created_utc": 1612716582, "company": "adobe"}, {"body": "I found another one that has block fills appearing super wonky. I am sending a link to a zip containing a few pages of the PDF, a video of how it appears in Acrobat, and how it appears correctly in iOS' Files app.", "score": 1, "created_utc": 1612714928, "company": "adobe"}, {"body": "Thank you Adobe very epic", "score": 1, "created_utc": 1612710563, "company": "adobe"}, {"body": "you need to cancel my plan now! You are performing daylight robbery by not allowing your customers too stop a plan. I don't use your software no more as I don't need it!!! I also can not afford to carry on paying the extortionate ammount you're trying to charge. Help", "score": 1, "created_utc": 1612709821, "company": "adobe"}, {"body": "Thanks, I managed to resolve the issue using the link provided )", "score": 1, "created_utc": 1612701128, "company": "adobe"}, {"body": "That's all I need. Thanks.", "score": 1, "created_utc": 1612700335, "company": "adobe"}, {"body": "Hi, PS is prompting me to sign in, I do, and it says successful, but then I'm returned to the Adobe login screen again", "score": 1, "created_utc": 1612697251, "company": "adobe"}, {"body": "I have a question about Premiere Pro and importing image sequence. I want to **chat** with someone, I don't want a page, I've read through the written instructions.", "score": 1, "created_utc": 1612691942, "company": "adobe"}, {"body": "Thank you !", "score": 0, "created_utc": 1612683229, "company": "adobe"}, {"body": "Thanks. This was a few days ago and I'm not having the problem now... Not sure what happened!", "score": 1, "created_utc": 1612682197, "company": "adobe"}, {"body": "I tried everything on this side and its still not working", "score": 0, "created_utc": 1612673384, "company": "adobe"}, {"body": "My XD won't open any of my documents on Mac. It just give me the spinning beach ball forever until I force quit. Any work around for this?", "score": 1, "created_utc": 1612658967, "company": "adobe"}, {"body": "problem with my indesign please take look to the DM loudly_crying_face", "score": 0, "created_utc": 1612658533, "company": "adobe"}, {"body": "While having someone help me on the chat, 137 ipc broker error pop ups happened in between waiting for a response. So many that the cc cleaner link they sent wouldn't work. Absolute trash...", "score": 2, "created_utc": 1612652199, "company": "adobe"}, {"body": "Folks - I've opened up Prem Pro v14.8 and now trying to open up the project I started in Prem Pro 2019 This is what I'm getting. All the media though is still on the MacBook Pro I'm currently using. I don't understand why the CC is doing this? It's like Adobe Obsolescence #poor", "score": 2, "created_utc": 1612631882, "company": "adobe"}, {"body": "It does the same thing on both", "score": 1, "created_utc": 1612631118, "company": "adobe"}, {"body": "I don't think it's right that you charge $50 a month. I could afford $30. But we're in a pandemic and that's a lot of money", "score": 2, "created_utc": 1612617256, "company": "adobe"}, {"body": "please add BRAW natively in the app. I just can't with these plugins..", "score": 1, "created_utc": 1612610221, "company": "adobe"}, {"body": "Done", "score": 0, "created_utc": 1612609948, "company": "adobe"}, {"body": "Having that as a warning would be nice lol.. can i still cancel my deactivation?", "score": 1, "created_utc": 1612609126, "company": "adobe"}, {"body": "i need help again... it's glitching", "score": 1, "created_utc": 1612607290, "company": "adobe"}, {"body": "deactivated my account. Will i still be able to create a new account with that email adress?", "score": 1, "created_utc": 1612606599, "company": "adobe"}, {"body": "Thank you!", "score": 0, "created_utc": 1612606538, "company": "adobe"}, {"body": "Thanks! Also I edit on my iPad so not sure if that changes anything . I don't super know what video card drives are!", "score": 1, "created_utc": 1612606511, "company": "adobe"}, {"body": "Thanks for the reply! I'm filming from my phone. 4K at 60 fpm yes, it happens with every project", "score": 0, "created_utc": 1612605187, "company": "adobe"}, {"body": "Hello, can you help me please, Audition is causing me endless problems. My mic is echoing and I can't see the sound levels. Any help would be gratefully received. Thank you.", "score": 1, "created_utc": 1612604914, "company": "adobe"}, {"body": "PLEASE why does it do this static crackle video thing. It makes me insane", "score": 3, "created_utc": 1612603704, "company": "adobe"}, {"body": "Managed to Uninstall but now it won't install again... I have to disable my anti virus which I did but it still shows the same message", "score": 2, "created_utc": 1612595966, "company": "adobe"}, {"body": "Sure?", "score": 1, "created_utc": 1612592340, "company": "adobe"}, {"body": "Just tell me how i can solve this.", "score": 1, "created_utc": 1612592274, "company": "adobe"}, {"body": "Thanks. I've come across at least one other person with the same issue, so at least I know it's not *just* me.", "score": 3, "created_utc": 1612585444, "company": "adobe"}, {"body": "I just did! thank you so much for your help!", "score": 1, "created_utc": 1612581270, "company": "adobe"}, {"body": "No joy, I uninstalled 22.1.1, installed 22.1 and still the same problem, photoshop will not launch, still freezing at the \"adding extensions\" part of the launch process. What can I try next? When I do that \"uninstall\", can I be sure it's taking EVERYTHING out?", "score": 1, "created_utc": 1612580280, "company": "adobe"}, {"body": "Hi! I was checking my account to see if my payment went through and was offered a cheaper version of a plan. so I changed my plan but I got double charged for both the previous subscription and the current one. can my payment for the previous plan be refunded? Thanks.", "score": 1, "created_utc": 1612578096, "company": "adobe"}, {"body": "Not you Adobe, your program runs fine. I just hate subscription services.", "score": 0, "created_utc": 1612574741, "company": "adobe"}, {"body": "Hi, I solved the problem by formatting my PC, installing and putting the missing dll file in the SysWOW64 folder, downloading Windows Media Feature pack and rebooting my computer. Thanks for helping me!", "score": 1, "created_utc": 1612565129, "company": "adobe"}, {"body": "omg hi it's okay now, forgive me bestie ILY xx", "score": 1, "created_utc": 1612561185, "company": "adobe"}, {"body": "I'm sick of your awful products. That stupid IPC Broker shit is the last straw. Do you not like customers because bunk ass shit like this is going to cost you customers. I can't even uninstall anything because it keeps popping up to tell me it's trash", "score": 1, "created_utc": 1612560608, "company": "adobe"}, {"body": "Looks like we're back to Premiere Pro not liking NVIDIA drivers. Rendering in the latest version of Premiere Pro won't utilize my GTX 1060 at all using the latest Game Ready AND Studio Drivers (version 461.40 for both). Premiere says its up to date. What's going on?", "score": 3, "created_utc": 1612559813, "company": "adobe"}, {"body": "Bring Back Flash you Cowards", "score": 0, "created_utc": 1612550594, "company": "adobe"}, {"body": "Radeon Pro 455 2 GB Mac OS 11.2 I've got 100 GB of free space on my computer.", "score": 2, "created_utc": 1612547756, "company": "adobe"}, {"body": "is it possible for me to receive a refund for my monthly subscription? I can't afford to pay it. I received the next two months for free which is great but I can't afford this months either and it's still pending", "score": 1, "created_utc": 1612547719, "company": "adobe"}, {"body": "Okay - thanks! I guess I'll just wait for this bug to get fixed - hopefully in the next drop or two.", "score": 0, "created_utc": 1612543110, "company": "adobe"}, {"body": "Yes, that is the issue, although I don't have real-time drawing on. I don't know my exact version at the moment, but I can get the info when I get back to the office on Monday. Thanks for following up despite my anger and frustration.", "score": 1, "created_utc": 1612543097, "company": "adobe"}, {"body": "hello why does my project freeze my pc at like 96% rendering", "score": 1, "created_utc": 1612541816, "company": "adobe"}, {"body": "Reread it, the DM comment should have been the first response. I am on chat trying to cancel the product and get a refund but he is stumped too.", "score": 0, "created_utc": 1612541323, "company": "adobe"}, {"body": "Yes, I got no email but you kept on taking my money.", "score": 2, "created_utc": 1612540879, "company": "adobe"}, {"body": "I can login to Google directly. Just not thru Me or Pr", "score": 1, "created_utc": 1612540794, "company": "adobe"}, {"body": "I believe I had this set to it before but it does seem to be working better now. Hopefully this fixes it folded_hands_medium-dark_skin_tone", "score": 0, "created_utc": 1612539357, "company": "adobe"}, {"body": "It does, and it doesn't. I found that, and it's good to know that. But it only works in point releases, meaning I can download 14.9, but not yesterday's build of 15.0...which is what I need. 14.9 I don't think will help. Today's 15.0 build broke something I need.", "score": 1, "created_utc": 1612538892, "company": "adobe"}, {"body": "I tried different connections and different Adobe accounts and different Google accounts in all combos. No luck yet.", "score": 1, "created_utc": 1612538842, "company": "adobe"}, {"body": "There's no way to download a previous beta version of something, is there? Like...yesterday's build of Premiere Pro that was posted to beta?", "score": 1, "created_utc": 1612534906, "company": "adobe"}, {"body": "4.1. Tried to reset, nothing helps. The issue is with LR + Big Sur 11.2 since all the issues happened after upgrade", "score": 1, "created_utc": 1612533313, "company": "adobe"}, {"body": "I keep trying to perform an action to cancel a service. I am a STUDENT of TAFE NSW but NOT STAFF. Adobe keeps saying the below - I can't even log a support ticket as Adobe will not let me. Can someone do something?", "score": 0, "created_utc": 1612532649, "company": "adobe"}, {"body": "Stop changing the layout of everything. I work in a fast-paced environment and I don't have to time to relearn where everything is. There's no need to continually change where things are and how they work. It's Illustrator - we're not launching rockets, we're making art.", "score": 0, "created_utc": 1612531867, "company": "adobe"}, {"body": "Every time I start a new document in Illustrator I have to reset a lot of my preferences. How many times do I have to disable 'paste remembers layers'? Everything is so slow - it takes so long to cling and hold to select a layered tool. Previous versions it was almost instant.", "score": 0, "created_utc": 1612531810, "company": "adobe"}, {"body": "I don't have enough characters to detail all of the stupid bullshit that's been baked in to CC. For starters, previous versions of Illustrator would use the last transformation (scale = 50% uniform). Now, every time I scale something it's not set to uniform/wild proportions.", "score": 1, "created_utc": 1612531501, "company": "adobe"}, {"body": "I've done that about 4 or 5 times now and the problem still persists. It happens on my work PC, personal PC, and laptop. Don't think it's a me thing", "score": 1, "created_utc": 1612531123, "company": "adobe"}, {"body": "Again, I can't access the Preferences&gt;performance menu as I can't get to ANY menus because it won't launch. I'll have to try installing 22.1 tomorrow. Thanks for all your time on this today.", "score": 1, "created_utc": 1612530503, "company": "adobe"}, {"body": "Posted and other users have duplicated the issue. Now I guess we wait for Adobe to fix it?", "score": 1, "created_utc": 1612529470, "company": "adobe"}, {"body": "Hey AdobeCare! I actually had someone mention that with the recent update, geforce game drivers aren't properly supported anymore with adobe creative, so I switched to Studio to test and have had zero issues since! thumbs_up_light_skin_tone", "score": 1, "created_utc": 1612529466, "company": "adobe"}, {"body": "I have and it still does it. Do I need to uninstall something because I keep getting 30 to 40 pop ups telling me that and I can't do ANYTHING", "score": 1, "created_utc": 1612525899, "company": "adobe"}, {"body": "It's windows. It started after an update to the computer", "score": 1, "created_utc": 1612525264, "company": "adobe"}, {"body": "It keeps freezing with each action even tho I have the space and everything on that list is available as well so I don't really know why is that happening", "score": 1, "created_utc": 1612525204, "company": "adobe"}, {"body": "Damn you are fast. I am new into indesign but I found my mistake. Easy one when export, include hyperlink. But thanks for your damn fast response folded_hands", "score": 2, "created_utc": 1612524995, "company": "adobe"}, {"body": "Yes. InDesign crashes, and then the whole computer follows and shuts down..", "score": 1, "created_utc": 1612523046, "company": "adobe"}, {"body": "Thank you, I will try this out!", "score": 1, "created_utc": 1612522637, "company": "adobe"}, {"body": "At random. MacOS Big Sur. I have updated the OS and my CC to the newest versions, the problem persists and it's always when I have InDesign open.", "score": 1, "created_utc": 1612522042, "company": "adobe"}, {"body": "Thanks!!!!! I realized I went to a cafe called Adobe and that is the charge. Phew", "score": 1, "created_utc": 1612521918, "company": "adobe"}, {"body": "I wasn't even aware of the forum. Thanks for the resource! )", "score": 1, "created_utc": 1612521417, "company": "adobe"}, {"body": "It actually hasn't happened since I tweeted, but it looks like it could be a temperamental thing. It usually fixes it itself when I restart the program", "score": 1, "created_utc": 1612520942, "company": "adobe"}, {"body": "Im happy about the fact that i still have The Alt+Z Command on Studio Drivers so like i said i'll let you know if I encounter any issues", "score": 1, "created_utc": 1612520714, "company": "adobe"}, {"body": "Hi! It's okay it doesn't normally crash, I probably had too many applications open! Thanks for your help anyway )", "score": 1, "created_utc": 1612520693, "company": "adobe"}, {"body": "Alright i'll give studio drivers ago but if im not satisfied i'll go back to game ready drivers also just wondering is there any plans to opimise creative cloud for game ready drivers at any point?", "score": 0, "created_utc": 1612520629, "company": "adobe"}, {"body": "Literally fix your program or im not paying for it. Its up to date.", "score": 2, "created_utc": 1612520581, "company": "adobe"}, {"body": "I can't get to Photoshops Help&gt;System Info as I can't launch Photoshop. Unless there's another way.", "score": 1, "created_utc": 1612520579, "company": "adobe"}, {"body": "it keeps on crashing. I AM TIRED OF EDITING weary_face", "score": 1, "created_utc": 1612520505, "company": "adobe"}, {"body": "Im downloading Nvidia Studio Ready Drivers But does that mean everytime i wanna game im gonna have to switch back to game ready drivers?", "score": 1, "created_utc": 1612520085, "company": "adobe"}, {"body": "haha cheers. its a hardware issue i've figured out. thanks for the offer thougg", "score": 1, "created_utc": 1612518058, "company": "adobe"}, {"body": "Exporting, after the second crash I just split a 60sec video into 30sec and it exported with ease. I sent both crash reports to Adobe systems hopefully it don't happen again.", "score": 1, "created_utc": 1612516861, "company": "adobe"}, {"body": "Unfortunately, still no progress, after following all of the steps. I'm sure I'll fix it, luckily I'm not in urgent need of the Colorize filter. Photoshop is still an amazing app...", "score": 0, "created_utc": 1612516593, "company": "adobe"}, {"body": "So If I wanted, say, single-app Ae and single-app Pr do I have to purchase them one at a time? Or Ae and Photography plan?", "score": 1, "created_utc": 1612516154, "company": "adobe"}, {"body": "Damn that was fast", "score": 2, "created_utc": 1612515733, "company": "adobe"}, {"body": "Is it possible to purchase more than one CC app? If I click BUY on one it just takes me to the checkout. Do you have to do it one by one?", "score": 1, "created_utc": 1612515517, "company": "adobe"}, {"body": "Thanks for replying. I'll try this and let you know.", "score": 0, "created_utc": 1612515123, "company": "adobe"}, {"body": "It just keeps trying to verify my account. I was logged in yesterday so it's not like I haven't been logged in for 30 days.", "score": 1, "created_utc": 1612515064, "company": "adobe"}, {"body": "I have 100gb available space - and this warning pops up often when Media Encoder is open (even when there is nothing in the encoding queue) - maybe I'll try installing an older version of encoder this one seems to have bugs.", "score": 1, "created_utc": 1612515033, "company": "adobe"}, {"body": "The plot thickens. Renamed those extensions, and this time when I tried to launch photoshop it didn't even get as far as bringing up the splash screen... I then tried opening to delete settings file, it let me click the button, but then froze.", "score": 1, "created_utc": 1612513715, "company": "adobe"}, {"body": "2021 with the most recent update", "score": 1, "created_utc": 1612513232, "company": "adobe"}, {"body": "Thanks guys", "score": 2, "created_utc": 1612510986, "company": "adobe"}, {"body": "It is yes.", "score": 1, "created_utc": 1612510692, "company": "adobe"}, {"body": "I have a GeForce RTX 3090 and a 64GB ram. I have also cleared the cache files too", "score": 1, "created_utc": 1612509708, "company": "adobe"}, {"body": "Will do. Had to pop out for a bit so will be later...", "score": 2, "created_utc": 1612508812, "company": "adobe"}, {"body": "Thanks for the rapid response which is much appreciated. It asked for my lrcat which I provided and it seemed to work as my Dev panels order was reset! I'll exercise LR CC today as the issue takes a while to appear - a few hours to &gt; 1 day. Stay well.", "score": 1, "created_utc": 1612508663, "company": "adobe"}, {"body": "No effects on it. Using the GoPro Cineform Codec to make the proxies. Windows 10 Pro x64 build 19042 Ryzen 5 1600 Corsair Vengeance 2x8GB 3200mhz Geforce GTX 1060 6GB driver 460.89", "score": 1, "created_utc": 1612506644, "company": "adobe"}, {"body": "Thanks. Looking now.", "score": 1, "created_utc": 1612505665, "company": "adobe"}, {"body": "Is that article still relevant even though it refers to PS Elements?", "score": 2, "created_utc": 1612505358, "company": "adobe"}, {"body": "It's actually not that much of an issue. However, I do have another issue I'm experiencing, where AE on windows 10 quite often doesn't play back a preview when I hit space bar. Instead, it will keep rendering out a preview (the green line will continue to move) but nothing plays.", "score": 1, "created_utc": 1612504921, "company": "adobe"}, {"body": "Hi, yes I have the latest version, updated from Creative Cloud this morning. It won't launch, freezing at the point shown on the screenshot I uploaded earlier.", "score": 1, "created_utc": 1612504804, "company": "adobe"}, {"body": "Reviewed, that's exactly what I did. Images from ISO 320/800/1600/3200/6400, checked that the only difference between them was the sharpening and noise otherwise all other settings (used in the preset selection) were identical.", "score": 1, "created_utc": 1612504781, "company": "adobe"}, {"body": "Thanks - this is a new one, so never worked. I have several other ISO adaptive presets (made before color grading) and they all still work fine. I was finally getting around to making one with CG included. I do have CG only presets that work (not adaptive). Reviewing now", "score": 0, "created_utc": 1612504603, "company": "adobe"}, {"body": "Yes, that's the only one that runs natively, but don't the others run in the Rosetta emulator like Lightroom?", "score": 1, "created_utc": 1612504288, "company": "adobe"}, {"body": "I made them, screen shot shows that process. MacOS 11.2 (2.4GHz 8-core i9, 64GB Ram, Radeon 5600M 8GB, 2TB SSD) Full Creative Cloud running Adobe PS Lightroom Classic 10.1.1 with Camera Raw 13.1", "score": 1, "created_utc": 1612502628, "company": "adobe"}, {"body": "Hi, it's 22.2.1. I don't want to use the BETA as there are a good number of the features listed as not present yet that I use daily. How can I get this version to launch?", "score": 1, "created_utc": 1612501849, "company": "adobe"}, {"body": "hey sir, i don't have much money bcs i am a student, can i buy adobe pirated software?", "score": 0, "created_utc": 1612500943, "company": "adobe"}, {"body": "This doesn't seem to have worked either unfortunately", "score": 1, "created_utc": 1612499255, "company": "adobe"}, {"body": "Usually freezes when I would try to play back or export a video. Had it happen after taking more then 2 hours to export and then it froze at 89%", "score": 0, "created_utc": 1612499109, "company": "adobe"}, {"body": "oh dont worry it's already solved! thanks for your concern smiling_face", "score": 1, "created_utc": 1612498760, "company": "adobe"}, {"body": "Its back up for me !", "score": 1, "created_utc": 1612497674, "company": "adobe"}, {"body": "XD links ain't workin chief", "score": 1, "created_utc": 1612496552, "company": "adobe"}, {"body": "Adobe XD links are down. Showing something went wrong. Location India", "score": 6, "created_utc": 1612495153, "company": "adobe"}, {"body": "ur program is shit", "score": 2, "created_utc": 1612494581, "company": "adobe"}, {"body": "XD share links haven't been working all morning, seems like a server issue? Any update on when it will be fixed?", "score": 3, "created_utc": 1612494495, "company": "adobe"}, {"body": "Hey, can you help? XD share links are not working for any of my projects currently...", "score": 1, "created_utc": 1612493387, "company": "adobe"}, {"body": "For sure!", "score": 1, "created_utc": 1612493223, "company": "adobe"}, {"body": "Can you tell me what's happening ??? All links are dead ! pouting_face", "score": 3, "created_utc": 1612493011, "company": "adobe"}, {"body": "After updating to #macOSBigSur 11.2 editing anything from the color panel cause #Lightroom to freeze for about a 30 sec. I have Mac Pro, so no hardware performance issue, just software. Any advice on how to resolve that?", "score": 3, "created_utc": 1612492995, "company": "adobe"}, {"body": "On XD ! every projets are down !!", "score": 0, "created_utc": 1612492946, "company": "adobe"}, {"body": "we are getting problems with Sharing features in it gets an Error 69.", "score": 2, "created_utc": 1612492876, "company": "adobe"}, {"body": "when clicking repair it reinstalls anyway", "score": 1, "created_utc": 1612492775, "company": "adobe"}, {"body": "Hi, when is the 2021 edition of the Photoshop Classroom in a Book going to be available please(I'm in the UK)? Pub date supposedly 28th Jan but everywhere saying the paperback is not yet published. Thanks!", "score": 1, "created_utc": 1612489774, "company": "adobe"}, {"body": "stfu thumbs_down", "score": 7, "created_utc": 1612485453, "company": "adobe"}, {"body": "Im on Mac OS Big Sur. 11.2 Adobe Illustrator 2021. The issue has occurred several times while working with different files and different processes running in the background.", "score": 1, "created_utc": 1612482125, "company": "adobe"}, {"body": "Why do I need images synced to cloud storage? Why can't I use local files? And why am I having to reinstall the first time I'm using the app?", "score": 2, "created_utc": 1612475570, "company": "adobe"}, {"body": "Windows 10 16gb ram (ddr3400) Ryzen 5 3600 GeForce 1660 Super B450 tomahawk motherboard Let me know if there's any other info needed", "score": 1, "created_utc": 1612471286, "company": "adobe"}, {"body": "idk what more needs to be explained there are literally no stabs in the spacebar", "score": 5, "created_utc": 1612470735, "company": "adobe"}, {"body": "No, I'm simply encoding an mp4 file - i don't have Premiere or After Effects open, it seems like a recent issue I've used the software for years w/ no issues.", "score": 1, "created_utc": 1612470199, "company": "adobe"}, {"body": "DM'd you!", "score": 0, "created_utc": 1612469657, "company": "adobe"}, {"body": "AM, thank you! Really appreciate that you're there to help!", "score": 0, "created_utc": 1612462454, "company": "adobe"}, {"body": "for some reason Adobe Media Encoder's (v14.8) memory usage is out of control (my MacBook Pro has 16GB). What is causing this?", "score": 1, "created_utc": 1612461752, "company": "adobe"}, {"body": "Lmfaoooo fuck you denise and fuck your monopoly company", "score": 1, "created_utc": 1612461094, "company": "adobe"}, {"body": "Same issue. Even reset print settings.", "score": 1, "created_utc": 1612459994, "company": "adobe"}, {"body": "Replied, thanks for following up thumbs_up", "score": 0, "created_utc": 1612458792, "company": "adobe"}, {"body": "- We were having a private DM chat, but you guys stop replying?", "score": 0, "created_utc": 1612458384, "company": "adobe"}, {"body": "C'mon, do a little due diligence. The LR team are well aware of the issue. Forum posts go back to October on the issue. Light a fire under them.", "score": 1, "created_utc": 1612456768, "company": "adobe"}, {"body": "thats nice adobe but what the fuck is this", "score": 2, "created_utc": 1612456006, "company": "adobe"}, {"body": "It didn't fix it all. My pc still froze while using premire pro. Awesome.", "score": 1, "created_utc": 1612455970, "company": "adobe"}, {"body": "I tried but when i open the composition it's crashing again", "score": 1, "created_utc": 1612449084, "company": "adobe"}, {"body": "I think I might know the issue. Is there someone I can message with directly?", "score": 1, "created_utc": 1612446788, "company": "adobe"}, {"body": "Hey thank you for your response, I opened other projects and they work just fine . When i open this project ae just crash and this is what i see", "score": 1, "created_utc": 1612446532, "company": "adobe"}, {"body": "I'm using Version 15.0.0 BETA (Build 18[R]) and logged in with the correct email.", "score": 1, "created_utc": 1612445025, "company": "adobe"}, {"body": "Still doesn't work on PC or Mac. Latest updated software. I had issues with this logging into Vimeo a while back, now it's Youtube. Does it work for you?", "score": 0, "created_utc": 1612444883, "company": "adobe"}, {"body": "Yes..it looks like it's installing again...??", "score": 0, "created_utc": 1612444597, "company": "adobe"}, {"body": "So this is what I come home to today.....", "score": 1, "created_utc": 1612444505, "company": "adobe"}, {"body": "Thanks, sent", "score": 0, "created_utc": 1612442756, "company": "adobe"}, {"body": "21.2.4. No Error code. See the link to see what's happening. I have to export my print from photoshop as an image, &amp; then import an artboard in Illustrator to print correctly.", "score": 1, "created_utc": 1612442217, "company": "adobe"}, {"body": "Stephanie on your Twitter care team is the real deal. She is deserving of #highpraise ALL the margaritas and a HUGE raise! #thankyou Stephanie.", "score": 1, "created_utc": 1612441875, "company": "adobe"}, {"body": "any ideas on why I can't login to my Gmail on Me or Pr?", "score": 2, "created_utc": 1612440597, "company": "adobe"}, {"body": "Tried that and did a reinstall. No change.", "score": 1, "created_utc": 1612439024, "company": "adobe"}, {"body": "This is an Enterprise membership, I believe. Is there some way I can tell in the account info?", "score": 1, "created_utc": 1612438615, "company": "adobe"}, {"body": "Yep I got it fixed now. I restarted it in safe mode and had no problems getting my programs back. Thank you very much for the help.", "score": 1, "created_utc": 1612436216, "company": "adobe"}, {"body": "Hi Kartika, no error messages. I just selected export to Media Encoder, it will open the program, but never open the file. I tried as well opening with the plus sign on Media Encoder. BUT!!!! this morning I tried again, and so far works weird. Thanks", "score": 1, "created_utc": 1612432508, "company": "adobe"}, {"body": "Didn't work yet. On Mac. To be clear, renaming file folder from /Library/Application Support/Adobe/CEP to /Library/Application Support/Adobe/CEP.old &amp; /Library/Application Support/Adobe/UXP /Library/Application Support/Adobe/extensions.old yes?", "score": 1, "created_utc": 1612431393, "company": "adobe"}, {"body": "It was made and saved in the same version and with preserve illustrator editor capabilities.", "score": 1, "created_utc": 1612431300, "company": "adobe"}, {"body": "Thanks for the reply, but I've already set acrobat as a default app for PDFs, but when I try to export the file as a pdf in illustrator it still gives an error due to the fact that it \"can't find Adobe acrobat\"", "score": 1, "created_utc": 1612431003, "company": "adobe"}, {"body": "Result kept the money. They declined to investigate that they have a dated exit survey from me (which is displayed *after cancelling* and suggests a bug in their software) and analytics showing uninstallation and no use of the software since.", "score": 1, "created_utc": 1612430739, "company": "adobe"}, {"body": "Can i dm you?", "score": 1, "created_utc": 1612430002, "company": "adobe"}, {"body": "Hi again. Since I last opened IDCC last week my workspace has disappeared . . . There's nothing in File/Open Recent. The background color has reset. What's happened now?", "score": 2, "created_utc": 1612429532, "company": "adobe"}, {"body": "for the past few days I have been getting error messages saying I need to quit or repair it by reinstalling. dramatically slowed down my computer since the 2020 update. I cant afford it either, how can you expect students who are known for living of beans and noodles to afford it", "score": 1, "created_utc": 1612428840, "company": "adobe"}, {"body": "Well, that's a problem cause I have accounts on both under the same email. Does this make a difference, if so, why? How can I tell?", "score": 1, "created_utc": 1612428622, "company": "adobe"}, {"body": "What inspires me? Helping others. When a campaign is complete and the client is extremely happy with the results. Overall, helping them succeed.", "score": 1, "created_utc": 1612428099, "company": "adobe"}, {"body": "The Creative Cloud updates finally worked. The Helpx site is still down for me.", "score": 1, "created_utc": 1612427683, "company": "adobe"}, {"body": "Sure, Game ready driver is 461.40 and device manager shows it as 27.21.14.6140", "score": 1, "created_utc": 1612427178, "company": "adobe"}, {"body": "I think this tweet by encompasses exactly 100% what I'm talking about Can you please just fix this issue; it's not just me, and we all think it's super annoying. Thank you!", "score": 2, "created_utc": 1612426682, "company": "adobe"}, {"body": "I've been on remote support with yall for over an hour with no solution.", "score": 1, "created_utc": 1612426348, "company": "adobe"}, {"body": "My mortgage inspires me everyday loudly_crying_face", "score": 0, "created_utc": 1612425993, "company": "adobe"}, {"body": "This request is 5 year old, and I've seen it long ago. I'm sure you customer support are doing what you can to satisfy the users, but the product team, I'm not so sure.", "score": 0, "created_utc": 1612425760, "company": "adobe"}, {"body": "I am already talking with your support. Thank you", "score": 1, "created_utc": 1612425696, "company": "adobe"}, {"body": "This sounds similar, after restarting and checking sync again, it has started uploading. There needs to be a better way to force a sync or force the system to validate that there are no missing items.", "score": 1, "created_utc": 1612425651, "company": "adobe"}, {"body": "Thank you for reaching out. Will do", "score": 0, "created_utc": 1612425209, "company": "adobe"}, {"body": "No, that exports LIBRARIES, I want to export all the individual IMAGES.", "score": 1, "created_utc": 1612424899, "company": "adobe"}, {"body": "36.2, on Windows. FontAwesome. I don't use a font manager, i don't use the font elsewhere. You could host the fonts instead of relying on the system's, it would avoid a lot of issues And integrate FA directly, as a lot of people use it.", "score": 1, "created_utc": 1612424521, "company": "adobe"}, {"body": "Thank you!", "score": 1, "created_utc": 1612424359, "company": "adobe"}, {"body": "That did not work, it is still registering the same 741 pictures trying to sync, and the sync window in preferences show nothing, other than the random sync of meta data showing up.", "score": 1, "created_utc": 1612424198, "company": "adobe"}, {"body": "BTW, I responded and am waiting to hear back from you.", "score": 1, "created_utc": 1612423871, "company": "adobe"}, {"body": "Thank you!", "score": 0, "created_utc": 1612423677, "company": "adobe"}, {"body": "I'm currently on version 22.1.1 and have twice experienced an error using Export As that results in a blank screen with \"no valid asset available\". Nothing will solve the error other than completely resetting my preferences. (picture below)", "score": 3, "created_utc": 1612422959, "company": "adobe"}, {"body": "Creative Cloud isn't updating, and the help site is down.", "score": 1, "created_utc": 1612422548, "company": "adobe"}, {"body": "Windows 10, CPU AMD Ryzen 9 3900x, GPU Gigabyte GeForce RTX 2070 Super, RAM 32GB it happens when i try to render with hardware acceleration on and its not necessarily a taxing edit that causes it", "score": 1, "created_utc": 1612422344, "company": "adobe"}, {"body": "Unfortunately, no luck with those workarounds. I did go back to 21.2.4 and am getting the same error. I wouldn't even mind going back to an even earlier version, but in my CreativeCloud app it's telling me that I can only go back as far as 21.2.4.", "score": 1, "created_utc": 1612420911, "company": "adobe"}, {"body": "Just messaged you", "score": 0, "created_utc": 1612420605, "company": "adobe"}, {"body": "Oh my god person_facepalming thank you", "score": 0, "created_utc": 1612419525, "company": "adobe"}, {"body": "I'm having major issues with Premiere after working well on Big Sur for about a week. All of a sudden I can't scrub my TL or export AT ALL. Please help, I'm working with deadlines.", "score": 1, "created_utc": 1612418578, "company": "adobe"}, {"body": "It worked before the update, I have had minor issues though out the year, almost always tied to a new build. At 36k pictures to sync up it would take forever to start over", "score": 1, "created_utc": 1612417489, "company": "adobe"}, {"body": "having your products segmented, and creating a Twitter handle for each, doesn't cover up your mess! #adobe #fraud #tech", "score": 2, "created_utc": 1612415324, "company": "adobe"}, {"body": "a respectful company won't trap consumers to vacuum their money, shame on you!", "score": 0, "created_utc": 1612415178, "company": "adobe"}, {"body": "Hi I have just herd that it's Chrome apparently Samsung phones default to this? Any updates or info would be great. Many thanks, P", "score": 1, "created_utc": 1612414943, "company": "adobe"}, {"body": "Sync for collections is on", "score": 1, "created_utc": 1612414876, "company": "adobe"}, {"body": "can u also follow this steps", "score": 1, "created_utc": 1612413783, "company": "adobe"}, {"body": "Alright, I will do that", "score": 0, "created_utc": 1612413751, "company": "adobe"}, {"body": "I was told by chat that someone would call me to help me solve syncing issue. Nobody did. Email is asking if issue was solved.? Advice folded_hands_medium-dark_skin_tone", "score": 1, "created_utc": 1612413617, "company": "adobe"}, {"body": "Oh hey Adobe, the video I replied with showcases the problem perfectly, I'm on version 14.8.0 build 39. 2020 year", "score": 1, "created_utc": 1612412575, "company": "adobe"}, {"body": "Hi the problem is it's not me it's the general public people who have android phones are complaining of this I can try and find out but it does seem to be a common problem?", "score": 0, "created_utc": 1612410057, "company": "adobe"}, {"body": "I'm using latest version. I'll do that and report afterward.", "score": 0, "created_utc": 1612409619, "company": "adobe"}, {"body": "when publishing online from InDesign files are unusable on Android devices as the navigation bar at the bottom of the screen disappears almost immediately it's a known issue but nothing seems be being mentioned/done with regard to it. Any updates??", "score": 1, "created_utc": 1612403725, "company": "adobe"}, {"body": "Windows 10. I tried Ctrl+Alt+Shift upon opening... nothing.", "score": 1, "created_utc": 1612396921, "company": "adobe"}, {"body": "8gig ram , 2gig dedicated Graphic card ,windows", "score": 1, "created_utc": 1612395202, "company": "adobe"}, {"body": "Just putting this here as it might help your engineers or other people. This solution fixed the issue. Both in Indesign and illustrator In preference, under the performance tab, untick the GPU performance\"", "score": 0, "created_utc": 1612391038, "company": "adobe"}, {"body": "This has been happening in Bridge (Version 10.1.1.166) for some time. It's weird that the edited/saved images don't appear for all the photos. This tends to happen with stitched images (Microsoft ICE), but lately just regular saved images.", "score": 2, "created_utc": 1612390771, "company": "adobe"}, {"body": "I checked and there were no errors in there, I had one previously but I deleted the image with the issue. It seems that it will sync collections that already exist, but not newly created collections or collections created after the update.", "score": 1, "created_utc": 1612384144, "company": "adobe"}, {"body": "16gb RAM. One hard drive SSD. I found that exporting to quicktime and ProRes and reducing settings helps. Any other advice? Is it normal that it would take this long to render and normal settings? Or am I likely doing something incorectly in composition?", "score": 1, "created_utc": 1612383009, "company": "adobe"}, {"body": "You can start by not updating every 6 months...if I want to update I will.", "score": 1, "created_utc": 1612381449, "company": "adobe"}, {"body": "I have tried restarting multiple times, I have tried turning off and on syncing. Nothing seems to work, ever since the last update. I am running on Mac OS Big Sur, 11.2", "score": 1, "created_utc": 1612381246, "company": "adobe"}, {"body": "Hey, no error codes. Everything just stops encoding randomly", "score": 1, "created_utc": 1612379098, "company": "adobe"}, {"body": "Please Fix Lightroom classic!! I cannot get any of my pictures to sync to the cloud, ever since release 10.1.1 nothing will sync, or even shows that it is making progress. I have been sitting at 750 pictures pending for 5 days.", "score": 1, "created_utc": 1612378273, "company": "adobe"}, {"body": "I try everything, i know that some debuger guy got the same bug back in 2017 - 2018 i'm struggling with this since fall 2020.", "score": 1, "created_utc": 1612377656, "company": "adobe"}, {"body": "Nope just to my C drive.", "score": 1, "created_utc": 1612377609, "company": "adobe"}, {"body": "AM, many thanks for the link! I'm curious to see if I can use it. My client emailed me today &amp; wasn't able to use Dropbox. Also he said it was the third time he'd used an emoji. This might not be a good matching with Share for Review, but could be great to have in my back pocket", "score": 1, "created_utc": 1612377361, "company": "adobe"}, {"body": "The problem is that your platform supports taking my credit card number and doling out services that I barely used for 3 years, but it doesn't support cancelling my account. Instead you want to use a free service that you didn't even build.", "score": 1, "created_utc": 1612374621, "company": "adobe"}, {"body": "Crashes while saving/exporting, v22.1.1 Windows 10", "score": 1, "created_utc": 1612373937, "company": "adobe"}, {"body": "I'm running the most current version of photoshop, on windows. Every time I use the hot key to activate the levels feature, the program freezes, and then crashes.", "score": 1, "created_utc": 1612370994, "company": "adobe"}, {"body": "Photoshop keeps crashing when saving/exporting. I keep losing lots of work. Is there a fix?", "score": 1, "created_utc": 1612369613, "company": "adobe"}, {"body": "I am trying to transcribe a 20 minutes video in the Premiere Pro Beta and it keeps getting stuck in the audio render. I've tried it on both of my drives.", "score": 1, "created_utc": 1612365781, "company": "adobe"}, {"body": "PS 2021 has still to much bugs. But also nice new features.", "score": 0, "created_utc": 1612365475, "company": "adobe"}, {"body": "Sometimes it happens when I'm working on Ai files and switch to AE, restarting AE fixed that problem. This time that's not the case, it started to happen as soon as I started AE, doesn't happen on new files, only with the ones I was working on before this message appeared", "score": 1, "created_utc": 1612364708, "company": "adobe"}, {"body": "Is there any way I can extend this without the annual membership?", "score": 0, "created_utc": 1612364434, "company": "adobe"}, {"body": "Awesome thanks!", "score": 0, "created_utc": 1612364358, "company": "adobe"}, {"body": "hello! i just dm'd about an issue regarding adobe portfolio! thank u!!!!", "score": 0, "created_utc": 1612363822, "company": "adobe"}, {"body": "I get error 206 Nope is a new device", "score": 0, "created_utc": 1612363537, "company": "adobe"}, {"body": "I'm using Photoshop, university access to creative cloud. I'm using the pen tool to draw the path then clicking on the text tool to convert it into a text path, and I only get one letter out of ''lorem ipsum'' and won't be able to see the rest at all. Had that error before.", "score": 1, "created_utc": 1612361507, "company": "adobe"}, {"body": "Thank you so much but I fixed it!", "score": 1, "created_utc": 1612361231, "company": "adobe"}, {"body": "any chance you are bringing back Adobe Story or something similar??", "score": 1, "created_utc": 1612359126, "company": "adobe"}, {"body": "Allready turned off, there's no option to turn it on though. So.. nope not working.", "score": 1, "created_utc": 1612357362, "company": "adobe"}, {"body": "I download the creative cloud app from my creative cloud acount I tried photoshop and illustrator but I have the same results.", "score": 1, "created_utc": 1612357032, "company": "adobe"}, {"body": "Looks like ProRes 4444 with straight not premultiplied fixed it. Surprised it worked a couple weeks ago but now doesnt. All good now. Thanks!", "score": 1, "created_utc": 1612357027, "company": "adobe"}, {"body": "I download the app from my adobe acount and then keeps popping the window that I'm signed in my acount At the end I have a note for firewall error even though is desabled.", "score": 1, "created_utc": 1612355923, "company": "adobe"}, {"body": "Hi, I got a weird bug, i'm doing an animation and the app is EATING my Scratch Disk, and stop saying this is normal CAUSE ISNT. Anyway i got to pay this month too right?, yeah take my money for this last gig. And so long photoshop. Thanks for all the fish.", "score": 2, "created_utc": 1612355550, "company": "adobe"}, {"body": "Done", "score": 0, "created_utc": 1612354935, "company": "adobe"}, {"body": "Gentlemen so many crashes it's impossible to edit anything. Explain why I have to pay a cancellation fee 4 ? Doesn't deliver Help", "score": 1, "created_utc": 1612354761, "company": "adobe"}, {"body": "No no it's all good! It was completely my fault for not saving as frequently and trying to multitask! My PC just freaked out", "score": 1, "created_utc": 1612354509, "company": "adobe"}, {"body": "So when I tried to export , it write not responding then it crashes", "score": 1, "created_utc": 1612354064, "company": "adobe"}, {"body": "I unfortunately didn't have enough time as i was in a rush. I'll definitely try to tomorrow.", "score": 0, "created_utc": 1612353893, "company": "adobe"}, {"body": "Tuesday night, on my windows pc i have Photoshop and illustrator installed. Illustrator can't get updated and Photoshop won't open. I downloaded an older version of both programs they started working fine...", "score": 1, "created_utc": 1612353716, "company": "adobe"}, {"body": "If i try to get support for account it says i'm out of work time, and i need to come back later. I pushed on sales help and the bot robot said it will connect me with an agent. But seems nobody's working today.", "score": 0, "created_utc": 1612352788, "company": "adobe"}, {"body": "Creative cloud desk app, its freezed.", "score": 1, "created_utc": 1612352674, "company": "adobe"}, {"body": "Same thing. It ask me to log in to get support. BUT GUESS WHAT i'm locked out!", "score": 1, "created_utc": 1612352560, "company": "adobe"}, {"body": "Loop, loop and no support.", "score": 0, "created_utc": 1612352332, "company": "adobe"}, {"body": "Nvidia Quadro driver 456.38 However, this is the same driver I've been on for awhile. Premiere 14.0.3 was very stable and NEVER had this bug, and now I'm on 14.8.0 which has the bug again. Should I update my gpu driver?", "score": 2, "created_utc": 1612352256, "company": "adobe"}, {"body": "I checked the files and are whitelisted. My account is now locked, an guess what, if i try to get support y just get another beautiful loop on pages that go nowhere.", "score": 1, "created_utc": 1612351862, "company": "adobe"}, {"body": "I've tried, but it doesn't work. The splash screen stays freezed", "score": 1, "created_utc": 1612351446, "company": "adobe"}, {"body": "Illustrator just log me out. When try to log back in, it prompt me to use the Account Access app... but it's not working. Logged out from app and to log back in it ask me to use the same app. man_facepalming_light_skin_tone what kind of infinite loop is this?", "score": 1, "created_utc": 1612351284, "company": "adobe"}, {"body": "No, that is not the case. This was just an example. The behaviour is the same, if there was a styling. Changes in the style-settings do not apply to text. This happens with different older files. Copying texts with styles into new documents shows the same problems.", "score": 2, "created_utc": 1612350935, "company": "adobe"}, {"body": "the text on a path feature doesn't work after latest upgrade", "score": 1, "created_utc": 1612350804, "company": "adobe"}, {"body": "no thanks. It's an it's an ongoing bug in your software that hasn't been fixed. Not going to waste more time dealing with it.", "score": 0, "created_utc": 1612350598, "company": "adobe"}, {"body": "Ok will do, thank you", "score": 0, "created_utc": 1612350478, "company": "adobe"}, {"body": "Thanks, I have a 45 page indesign document and every time I attempt to copy text to put on another page either by right clicking copy or CMD + C it automatically shuts down Indesign and I can't restore the file", "score": 1, "created_utc": 1612348765, "company": "adobe"}, {"body": "Yes, it is. It's crazy that there is not an option to just name a batch export of artboards when saving as one PDF.", "score": 1, "created_utc": 1612347703, "company": "adobe"}, {"body": "Okay thanks should have done a while ago. I've been fleeced by Adobe long enough", "score": 1, "created_utc": 1612347526, "company": "adobe"}, {"body": "That image is making my eyes bleed.", "score": 1, "created_utc": 1612346926, "company": "adobe"}, {"body": "Thank you! I'll do that when I have the time! Thank you for reaching out!", "score": 1, "created_utc": 1612346733, "company": "adobe"}, {"body": "I sure hope we get this feature soon nerd_face", "score": 0, "created_utc": 1612346395, "company": "adobe"}, {"body": "Premiere and After Effects give me the most trouble. I can't even use the newest version of Media Encoder as it freezes up before it begins so I have it rolled back. Premiere at least once per project for me but I can't replicate the issue to an action.", "score": 2, "created_utc": 1612344346, "company": "adobe"}, {"body": "help", "score": 1, "created_utc": 1612343959, "company": "adobe"}, {"body": "Reset, see how long this time thank you.", "score": 0, "created_utc": 1612343722, "company": "adobe"}, {"body": "Looking for 16.1 which requires macOS 10.14 or later, currently running High Sierra 10.13.6 with no updates available", "score": 1, "created_utc": 1612343651, "company": "adobe"}, {"body": "I changed my email address in my account and email is still going to my old email address.", "score": 1, "created_utc": 1612343316, "company": "adobe"}, {"body": "Hey would you like some professional help with your social media images? Because, much as we love you folks, this is... well, rubbish.", "score": 4, "created_utc": 1612342847, "company": "adobe"}, {"body": "Cleared cache and it still hangs from time to time. So far this is the only project where I've experienced it even after a restart or cache clear", "score": 1, "created_utc": 1612342744, "company": "adobe"}, {"body": "Its a waste of space I don't want it anywhere. This is for rich people who can afford to throw 50 a month at adobe for a hobby", "score": 1, "created_utc": 1612342603, "company": "adobe"}, {"body": "The issue isn't with Creative Cloud as that keeps me signed in, it's with photoshop", "score": 1, "created_utc": 1612341473, "company": "adobe"}, {"body": "I was dowloading photoshop and for some reason this requires Creative suite take up space on my hard drive", "score": 2, "created_utc": 1612341382, "company": "adobe"}, {"body": "In previous OS iterations I was able to workaround by uninstalling said fonts, but Big Sur completely removed my ability to do so, without a workaround.", "score": 0, "created_utc": 1612341043, "company": "adobe"}, {"body": "it's the issue located here Basically all fonts show up in the font list, but Apple doesn't allow me to disable the scores of noto fonts stix fonts and foreign language fonts so i'm stuck with a ratking font list.", "score": 1, "created_utc": 1612340964, "company": "adobe"}, {"body": "When will support RTL languages?", "score": 1, "created_utc": 1612340386, "company": "adobe"}, {"body": "That image needs some Adobe Care!", "score": 5, "created_utc": 1612340310, "company": "adobe"}, {"body": "ugh, this red... why", "score": 6, "created_utc": 1612339342, "company": "adobe"}, {"body": "Well I'm trying to download thgis app called photoshop that I've been over paying for years. Only your Creative Cloud crap is slowing it down so much I've lost interest", "score": 0, "created_utc": 1612339321, "company": "adobe"}, {"body": "Late 2015 iMac. Integrated gpu running Catalina 10.15.7. Have more than half my HD free. Timeline is just slow to respond to anything I do. Restarted my computer and still having the same issues", "score": 2, "created_utc": 1612339150, "company": "adobe"}, {"body": "Windows 10 &amp; photoshop 2021, I'm not sure if it's after an update or what, but it keeps signing me out lol.", "score": 1, "created_utc": 1612339147, "company": "adobe"}, {"body": "Thanks. Lighroom desktop/cloud/CC does not work for 95% of togs I know. It's impractical to sync 100MB+ images between devices in libraries of 100,000 images and above. It's Lightroom Classic or Capture One I'm afraid. Keywords are tiny bytes of data!", "score": 0, "created_utc": 1612339113, "company": "adobe"}, {"body": "Yes I am.", "score": 1, "created_utc": 1612339055, "company": "adobe"}, {"body": "guess what? can't share documents . . . again! i honestly cannot recommend building an office workflow around adobe's cloud system unless you want to ensure that at least once a month you're stuck in your tracks until they fix it. unacceptable.", "score": 1, "created_utc": 1612338306, "company": "adobe"}, {"body": "Hi! No issue at all. Just an extreme use of the gradient tool on illustrator. face_savoring_food", "score": 0, "created_utc": 1612338207, "company": "adobe"}, {"body": "It was on MacOS 10.14.16 and it was while moving a text box. The file in question is a little big (12 MB), but really is not that complicated compared to much larger files (with more nodes, etc) that I've used in previous versions of AI.", "score": 1, "created_utc": 1612337259, "company": "adobe"}, {"body": "hi, can you explain why photoshop keeps signing me out of my account on the computer? It's very frustrating when I load it up and I have to sign in again time after time. Cheers", "score": 1, "created_utc": 1612336384, "company": "adobe"}, {"body": "Thanks for the response! I have 16gb ram with 4ish free while editing and it will lag on play back as well as stutter and jump back a frame or 2 as it plays...even with no color correction, no effects on the clip.", "score": 1, "created_utc": 1612335799, "company": "adobe"}, {"body": "Thanks for swooping in. A handsome pal came to my rescue and showed me it was an overprinting issue. Hopefully it is all sorted now.", "score": 2, "created_utc": 1612334654, "company": "adobe"}, {"body": "I'm quite impressed how quickly you guys react on these tweets. I just wanted to try everything before asking for further help, haha! D Thank you! &lt;3", "score": 1, "created_utc": 1612331822, "company": "adobe"}, {"body": "That's what I thought. A most unsatisfactory situation.", "score": 1, "created_utc": 1612331505, "company": "adobe"}, {"body": "Thanks! So, I managed to solve the problem myself (at least for now) by removing all of my motion graphics templates from the CC's library. I'm not sure which one caused all of my apps to crash on startup, but I'll install them later on one by one to find the faulty mogrt. -&gt;", "score": 2, "created_utc": 1612331267, "company": "adobe"}, {"body": "Versions 2020 and 2021 on Windows I was using Adobe when Deke and Lynda were still *evangelists* and Adobe would beta test everything to be so smooth before release...but that's when you sold software and not subscriptions. Have a nice day.", "score": 0, "created_utc": 1612330923, "company": "adobe"}, {"body": "Thanks for the response! Sure I did vote for this the day it was logged, three years ago The only reason I didn't log it myself, like I did with my own 234 reports, is someone suffers more than me because of this issue.", "score": 0, "created_utc": 1612329244, "company": "adobe"}, {"body": "No. I have images on desktop and synced a collection of images using Lightroom Classic. All i want to do on a laptop with either Lightroom Cloud or Classic is to view these images and keyword them and that sync back to my desktop.", "score": 1, "created_utc": 1612324744, "company": "adobe"}, {"body": "Solved by dm, ty Adobe have a nice day!", "score": 1, "created_utc": 1612321963, "company": "adobe"}, {"body": "Works great now, hopefully you will also incorporate the Dutch language", "score": 1, "created_utc": 1612320237, "company": "adobe"}, {"body": "Lightroom Classic on desktop (files to big for CC) with CC and Classic on laptop. In the laptop Classic does receive keywords from the catalog, but no laptop keyword changes sync back to the desktop.", "score": 1, "created_utc": 1612318787, "company": "adobe"}, {"body": "Thank you for reaching out. I've uninstalled and reinstalled multiple times (4) but I'm not sure if u can say that that is a clean install", "score": 1, "created_utc": 1612317250, "company": "adobe"}, {"body": "Yes, same in both programs. Whenever I click render in Media Encoder, it is set to Hardware rendering. However as soon as I notice that it's going very slow and I turn it off, it switched itself to software encoding'. If that makes sense.", "score": 2, "created_utc": 1612309867, "company": "adobe"}, {"body": "dear Adobe, good afternoon from Jakarta. I use adobe acrobat pro dc, then i hv a problem. I cant save a new file (just a new file) always stuck on save as pdf. Fyi i use windows 10 pro. This problem is new for my pc. Ty Adobe, hope u re doing well.", "score": 2, "created_utc": 1612305455, "company": "adobe"}, {"body": "Thank you for responding. I was reading about it but it wasn't clear how it would work. Maybe I'll try it on an upcoming project. The feature has been around for a while, I think?", "score": 1, "created_utc": 1612292550, "company": "adobe"}, {"body": "The error message is YALL want to bill me but I ain't even open the app this month so why would I pay it", "score": 1, "created_utc": 1612285725, "company": "adobe"}, {"body": "Does Lightroom (10.1.1) support tethered capture with the Nikon Z5?", "score": 1, "created_utc": 1612284778, "company": "adobe"}, {"body": "I have tried other titles with no luck. When I skim through the video with the slider, you can see it, and when I play it within premiere, it shows. However if not playing or sliding, it's a black screen with just the title and then when I export, only black screen on the video", "score": 1, "created_utc": 1612282690, "company": "adobe"}, {"body": "I did and it didn't help /", "score": 1, "created_utc": 1612281225, "company": "adobe"}, {"body": "Thanks for providing a link to the pricing!! #sarcasmOff.....", "score": 0, "created_utc": 1612280546, "company": "adobe"}, {"body": "Is that in the new Prem Pro CC?", "score": 0, "created_utc": 1612278538, "company": "adobe"}, {"body": "Meh same", "score": 1, "created_utc": 1612278343, "company": "adobe"}, {"body": "no. It just greys out certain functions as if I cant use them. I already went through the troubleshooting for this but all it says to do is this And I do but most of the time, that doesn't work and I'm just really tired of dealing with the issue repeatedly", "score": 2, "created_utc": 1612277810, "company": "adobe"}, {"body": "It's happened on my two most recent projects with three different media's in the past. But when I open it in Media Enocoder to render it, it'll still come out as red.", "score": 1, "created_utc": 1612276871, "company": "adobe"}, {"body": "Recently got 2021 but it's the same problem on all versions", "score": 1, "created_utc": 1612276130, "company": "adobe"}, {"body": "I think it's a GPU issue - what GPU do you have and what Driver version? Depth Aware Haze runs fully in the cloud and not on your GPU", "score": 1, "created_utc": 1612275841, "company": "adobe"}, {"body": "Well, it doesn't really solve the issue, as I have everything setup on my main profile; settings, remote access to our files on sharepoint, email, my dropbox, login to browser, mailchimp, wordpress, etc., but if I want to save for web, I'll have to switch between two profiles?", "score": 1, "created_utc": 1612275504, "company": "adobe"}, {"body": "I'm using photoshop 20", "score": 1, "created_utc": 1612275478, "company": "adobe"}, {"body": "what other ways do you have to offer support? After having the same guy with poor cell reception disconnect me 5 times, sitting on hold for another 30 minutes, and another 45 minutes to waiting for someone to answer my chat, I am about to be done with Adobe!", "score": 1, "created_utc": 1612275211, "company": "adobe"}, {"body": "Living in Denmark we have a different keyboard layout. So using the bracket keys to adjust brush size is not easy. I don't even think it's possible. Is it possible to remap brush size to others keys in Photoshop and Lightroom?", "score": 2, "created_utc": 1612275005, "company": "adobe"}, {"body": "Thanks Adobe Care", "score": 1, "created_utc": 1612274578, "company": "adobe"}, {"body": "It's multiple. All my drivers are up to date and it seems I have all the right boxes clicked. on photoshop certain effects don't work sometimes (so I restart and 9/10 times it does) Premire just doesn't like to export. And after effects will crash without warning (It's Windows)", "score": 1, "created_utc": 1612274316, "company": "adobe"}, {"body": "I can't find the project files in the new Premiere Pro CC. They aren't visible when I load it up, only when I load 2019 CC.", "score": 1, "created_utc": 1612274061, "company": "adobe"}, {"body": "Can you please DM me to discuss this further? Thank you kindly for your assistance.", "score": 1, "created_utc": 1612273737, "company": "adobe"}, {"body": "I finally got round to doing this. And OMG! That works (as you can see from my hastily created test-gif). Not sure what that means, and what to do from here? Camilla", "score": 1, "created_utc": 1612273478, "company": "adobe"}, {"body": "Oh well snap crackle pop, didn't expect to get this far. Basically, I uploaded a video (from iphone) and put it in with a few other clips and then threw a title onto the iphone portion of the video and only title shows with no video after I save video.", "score": 1, "created_utc": 1612273148, "company": "adobe"}, {"body": "i9-7900X, 1080ti, 64 GB ram, Windows 10, nvidia 460.89 currently Thanks in advance! Any tips are appreciated.", "score": 1, "created_utc": 1612272590, "company": "adobe"}, {"body": "If this happens to not be a bot, I'd gladly work with you to look into this ) Below is a link from my drive to a crash report", "score": 2, "created_utc": 1612272389, "company": "adobe"}, {"body": "ive downloaded the new Premier Pro CC but I'm unable to see my 2019 CC projects. How can I get the across to the new CC, so that I can delete Prem Pro 2019 CC as it lol be taking a lot of memory space on my MacBookPro alongside of the new CC", "score": 1, "created_utc": 1612271315, "company": "adobe"}, {"body": "It's on all projects Screen recording", "score": 1, "created_utc": 1612271257, "company": "adobe"}, {"body": "Thanks for the quick response. I didn't have that checked off in the first place though.", "score": 1, "created_utc": 1612269084, "company": "adobe"}, {"body": "I'm afraid the issue didn't go away... (I updated and rebooted)", "score": 1, "created_utc": 1612268951, "company": "adobe"}, {"body": "every time I add in new pages to my documents in all of my content on the subsequent pages seem to shift and expand... Is this normal?", "score": 1, "created_utc": 1612268281, "company": "adobe"}, {"body": "I have sent you a DM, thank you!", "score": 0, "created_utc": 1612268048, "company": "adobe"}, {"body": "Adobe cloud to then redownload updated XD, Premiere, Illustrator and Photoshop. Dimension and Aero.", "score": 1, "created_utc": 1612268037, "company": "adobe"}, {"body": "I've been trying to cancel my Adobe Creative subscription but it won't let me. Now it's trying to charge me for a month's subscription. Please help", "score": 1, "created_utc": 1612267918, "company": "adobe"}, {"body": "Yes, the photo I attached to my previous reply shows the folders in that location, can you see it?", "score": 2, "created_utc": 1612266849, "company": "adobe"}, {"body": "Thanks Jeff, but unfortunately I've tried all this steps already disappointed_face", "score": 1, "created_utc": 1612265973, "company": "adobe"}, {"body": "Hi, I just opened my Creative Cloud, and, indeed, it's showing me the update option for version 22.1.1. I'll update and let you know the outcome.", "score": 1, "created_utc": 1612265192, "company": "adobe"}, {"body": "No error codes. It says 'hardware encoding' however as soon as I start encoding it switches to software encoding. Tried with a new project as well, same deal.", "score": 1, "created_utc": 1612264175, "company": "adobe"}, {"body": "Thanks. It's not just render; AE just stole focus briefly while it was quitting. I was typing away and suddenly AE decided that my email wasn't that important. Aside from start-up, I can think of no reason at all why an app should *ever* steal focus. Adobe's do it constantly.", "score": 1, "created_utc": 1612264036, "company": "adobe"}, {"body": "Ps the grid didnt transfer out of the vanishing point", "score": 1, "created_utc": 1612263624, "company": "adobe"}, {"body": "Quick update- restarted the computer, opened older v21.2.4 version, hid all my layers except for the background layer and saved. It worked! Then clicked on all layers to show them and saved again. Worked without the error. Thanks for your help! folded_hands_medium-light_skin_tone", "score": 0, "created_utc": 1612262519, "company": "adobe"}, {"body": "Ok, I tried most of the options from the website and nothing seems to work ( I couldn't find the discover panel). I even reverted back to v21.2.4 but it still won't save.", "score": 0, "created_utc": 1612261335, "company": "adobe"}, {"body": "yes, ive uninstalled and reinstalled a few times, deleted teh application and application support folders per adobe . i can send the full details of the error via DM", "score": 0, "created_utc": 1612260329, "company": "adobe"}, {"body": "The only message i get is; ''Failed to download' nothing more", "score": 2, "created_utc": 1612260113, "company": "adobe"}, {"body": "Oddly, your technicians managed to knacker up my Word, Excel and PowerPoint too. Gotta fix them too!", "score": 0, "created_utc": 1612259746, "company": "adobe"}, {"body": "I've spent many happy!?' hours sorting it out &amp; I've managed to get it all working again  lost a lot of time, a lot of add ons in Photoshop &amp; all my settings for the whole suite, but at least I've managed to stop it from freezing. Still setting up. Adobe fonts are 2 b avoided!", "score": 0, "created_utc": 1612259617, "company": "adobe"}, {"body": "Thanks so much for your response. I will try it out and let you know.", "score": 0, "created_utc": 1612259600, "company": "adobe"}, {"body": "Ok still having trouble with this, lost them all again after restart! Sorted hidden folders, this is what I have", "score": 1, "created_utc": 1612259194, "company": "adobe"}, {"body": "Had also reinstalled still was having the issue. Did get it to work for a bit today but still had some issues.", "score": 1, "created_utc": 1612257264, "company": "adobe"}, {"body": "the audio wont add", "score": 1, "created_utc": 1612256930, "company": "adobe"}, {"body": "Latest and i fixed it. Also another issue i cant put more than two files in Pr with out one coming with no audio", "score": 1, "created_utc": 1612256290, "company": "adobe"}, {"body": "Again i am not using LR Classic.", "score": 0, "created_utc": 1612255622, "company": "adobe"}, {"body": "Various things (Adobe InDesign 2021) - Application loads up, hand tool is stuck as the only thing to use, taskbar on the left because null and void when trying to change, shortcuts don't work - zoom in/out freezes and locks screen - crashes MULTIPLE times", "score": 1, "created_utc": 1612255301, "company": "adobe"}, {"body": "-Would you mind to read what i wrote? -Do you know that there might be answers in a tweet which are some kind of \"follow up\" -Would you mind to read these too? -Whats got LR Classic to do with it??", "score": 1, "created_utc": 1612254577, "company": "adobe"}, {"body": "More bugs in #lightroom #adobe", "score": 1, "created_utc": 1612254459, "company": "adobe"}, {"body": "Ok. Thanks.", "score": 0, "created_utc": 1612254265, "company": "adobe"}, {"body": "Alright, thanks let me try this.", "score": 1, "created_utc": 1612253779, "company": "adobe"}, {"body": "Hi. Most notably in Premiere and After Effects, but I've seen others talk about it with Photoshop and InDesign. It's not new; I've brought it up with Adobe before.", "score": 1, "created_utc": 1612252259, "company": "adobe"}, {"body": "LR5 - the rest is doubtless explained by the screenshot. You just need to open your eyes.", "score": 0, "created_utc": 1612251388, "company": "adobe"}, {"body": "Yes, in fact i do. Would it be possible to show price in less confusing way? Like 18.14? I can even underrstand it like it is 18 per month, but 14 per month when paid annualy.", "score": 1, "created_utc": 1612249656, "company": "adobe"}, {"body": "Maybe, instead of writing FAQs and annoying users, you could perhaps put that energy into making better products? Maybe find a way to keep Typekit fonts active for more than a month? Just a thought. Not taking this conversation any further.", "score": 0, "created_utc": 1612249276, "company": "adobe"}, {"body": "site is the best ever brown_heart brown_heart", "score": 0, "created_utc": 1612248135, "company": "adobe"}, {"body": "some steps i havent done it so thats why it cant be downloaded now its downloading thanks for the help", "score": 1, "created_utc": 1612247484, "company": "adobe"}, {"body": "Worked perfectly thanks!", "score": 2, "created_utc": 1612247263, "company": "adobe"}, {"body": "hi i worked it out it's just that one certain pre-composition crashed whenever i got near it/tried to edit it so it suckd", "score": 1, "created_utc": 1612247066, "company": "adobe"}, {"body": "Ooh! So it's happening across a few files. Win10, Illustrator25.01 64bit. Workflow1 Place a linked pdf file (has layers). Embed the file. Sometimes it doubles the stroke at this point. Work2 place same linked pdf. file&gt;save as copy&gt;include linked files. copy ai has 2x stroke", "score": 1, "created_utc": 1612246067, "company": "adobe"}, {"body": "Thanks! I really appreciate the response. I'll submit a request. I wonder if I could solve this with scripting? I'll have a look at the docs.", "score": 1, "created_utc": 1612246003, "company": "adobe"}, {"body": "I'm working on a 2015 MacBook Pro with the latest os and I have the latest pre pro since I have the creative cloud. Right now I'm just checking my files (mp4) from my canon r6 and even the preview is lacking and cutting. I've turned the playback res down to 1/8. All 25fps.", "score": 1, "created_utc": 1612244988, "company": "adobe"}, {"body": "Using Big Sur 11.1, Photoshop 22.1.1. Suspect it may be an operating system issue. Sometimes I'll click on a window and it doesn't move forward (in front of another window).", "score": 2, "created_utc": 1612244715, "company": "adobe"}, {"body": "DM sent", "score": 0, "created_utc": 1612244048, "company": "adobe"}, {"body": "Hello, is there a timeline for when adobe PS native for Mac M1 will be released?", "score": 1, "created_utc": 1612242677, "company": "adobe"}, {"body": "At 1am? I was asleep. How about today?", "score": 1, "created_utc": 1612241629, "company": "adobe"}, {"body": "Hey. Is there a similar thing I can do in premiere pro to make it run smoother?", "score": 2, "created_utc": 1612239578, "company": "adobe"}, {"body": "Thanks very much! I have sent you a DM relieved_face", "score": 1, "created_utc": 1612239031, "company": "adobe"}, {"body": "I'm trying to get in contact with someone via chat but keep getting directed through q&amp;a pages. How do I access online chat please? loudly_crying_face", "score": 1, "created_utc": 1612238315, "company": "adobe"}, {"body": "Reverted back at 14.7 and 14.6 which did work fine previously, now no longer works. Same for Nvidia drivers. Reverted back several until several months, hardware acceleration still doesn't work.", "score": 4, "created_utc": 1612237217, "company": "adobe"}]}