{"data": [{"body": "can you share m gmail support team email I'd as my brother has forgotten the password and he had entered the recovery email I'd as well as wrong while creating gmail account few years back. We ready share authenticity of that account. Please guide m to correct team", "score": 0, "created_utc": 1612839393, "company": "google"}, {"body": "The only gift I want is for you to make amends with Terraria you capitalistic swine.", "score": 0, "created_utc": 1612838929, "company": "google"}, {"body": "But on the other hand, since they want to separate the business by race, would it not be just as easy for the non-blacks using that information to determine which businesses to avoid?", "score": 0, "created_utc": 1612838913, "company": "google"}, {"body": "FIX THIS MAN'S ACCOUNT!!!! It's ridiculous how responsible persons are being treated, the AI algorithm you people don't know how to code correctly and your AI Q&amp;A bot isn't helpful. #wrong #cancelgoogle", "score": 0, "created_utc": 1612838771, "company": "google"}, {"body": "Hi, I recently reset my phone . But forgot my google account password . I tried to reset password in the recovery page but failed to reset it . Please send me a DM", "score": 1, "created_utc": 1612838100, "company": "google"}, {"body": "what's going on with google mail, lots of companies using google email accounts saying they aren't getting emails over last few days Us included...", "score": 0, "created_utc": 1612837980, "company": "google"}, {"body": "you need to save me from these malwares.", "score": 0, "created_utc": 1612836955, "company": "google"}, {"body": "hi, I still need help with my account so I responded to your dm, but I'm not sure if you've seen it )", "score": 0, "created_utc": 1612836948, "company": "google"}, {"body": "I have forgotten my gmail account password . Trying for password recovery but in the last, a letter is coming from google-\"google couldn't verify that this account belongs to you \", so please tell me what I have to give to verify the account or what ....", "score": 0, "created_utc": 1612836843, "company": "google"}, {"body": "as good as you are at what you do, there are times when you are also completely useless. As an example, trying to report a scam email address is harder than it should be and why reference \"Google+\"?", "score": 0, "created_utc": 1612836235, "company": "google"}, {"body": "I have forgotten my gmail account password . Trying for password recovery but in the last, a letter is coming from google-\"google couldn't verify that this account belongs to you \", so please tell me what I have to give to verify the account or", "score": 1, "created_utc": 1612836084, "company": "google"}, {"body": "Someone already hacked the account, and I did every solutions mentioned from the help tab in the community, but didn't get any luck. Because the Google Account Recovery is not showing and it prevents me even the forgot password. loudly_crying_face", "score": 6, "created_utc": 1612836012, "company": "google"}, {"body": "get your shit together", "score": 0, "created_utc": 1612835968, "company": "google"}, {"body": "Wow that's incredibly racist flushed_face", "score": 0, "created_utc": 1612835876, "company": "google"}, {"body": "Yes, i did try. broken_heart", "score": 0, "created_utc": 1612835587, "company": "google"}, {"body": "Pls Save Burma! ! Save Democracy Culture !!! Save ! Noble Price Winner Aung San Suu Kyi", "score": 0, "created_utc": 1612835499, "company": "google"}, {"body": "hi google i have already tried all the recovery options, mfa has been enabled on the account , mobile number has been changed, password / recovery email changed.Please assist me if you can inbox me on steps, is there someone i can call , i can provide any information you require.", "score": 0, "created_utc": 1612835249, "company": "google"}, {"body": "I have forgotten my password Trying for password recovery so my number are also coming an otp and does not open even after adding otp and in the last a letter is coming from Google Google couldn't verify that this account belongs to you.", "score": 0, "created_utc": 1612835201, "company": "google"}, {"body": "yo wtaf? Since when do you consider unilateral suspension of an entire account, effectively someone's entire digital life and in this case also their business, to be an acceptable course of action? A Kafkaesque nightmare. Cancelling", "score": 0, "created_utc": 1612835036, "company": "google"}, {"body": "#Theshoppers This application has done a lot of fraud with us with your help, in this case, you guys can also join us, you can do everything on people completely because I have been complying for 3 days but you are not taking any legal action. Why is still in playstore", "score": 0, "created_utc": 1612834950, "company": "google"}, {"body": "I have forgotten my password Trying for password recovery so my number are also coming an otp and does not open even after adding otp and in the last a letter is coming from Google Google couldn't verify that this account belongs to you.", "score": 0, "created_utc": 1612834794, "company": "google"}, {"body": "i enjoyed all the times you told me i had a brain tumor because of my headaches more than you telling me i have a crush.", "score": 0, "created_utc": 1612834516, "company": "google"}, {"body": "hi! I'm not sure if you've seen my reply or dm, but I've replied to you about my query, as I still need further help, thank you so much! )", "score": 0, "created_utc": 1612834465, "company": "google"}, {"body": "you and i have bad blood now.", "score": 0, "created_utc": 1612834342, "company": "google"}, {"body": "Hi, I recently reset my phone . But forgot my google account password . I tried to reset password in the recovery page but failed to reset it . Please send me a DM", "score": 1, "created_utc": 1612833941, "company": "google"}, {"body": "What if I just identify with being a black woman who is a lesbian? Am I on the list?", "score": 0, "created_utc": 1612833216, "company": "google"}, {"body": "Hey, Can you take a look at this issue?", "score": 1, "created_utc": 1612832717, "company": "google"}, {"body": "is one of the Enterprise Validator Node on stay tune Feb 17th for talk \"How Theta Labs uses blockchain to improve video streaming for enterprises\"", "score": 2, "created_utc": 1612831992, "company": "google"}, {"body": "TAFE Free TAFE More Popular In 2021 Than Ever Before - Mirage News", "score": 0, "created_utc": 1612830799, "company": "google"}, {"body": "TAFE North Metro TAFE partners with Ink Animation studio to help students gain experience - PerthNow", "score": 0, "created_utc": 1612830798, "company": "google"}, {"body": "TAFE Trainee pilots to be included in TAFE - Yahoo News Australia", "score": 0, "created_utc": 1612830798, "company": "google"}, {"body": "TAFE TAFE NSW Yass launches first ever Diploma of Youth Work - Yass Tribune", "score": 0, "created_utc": 1612830797, "company": "google"}, {"body": "TAFE TAFE NSW Albury campus offers new diploma of youth work to target demand - The Border Mail", "score": 0, "created_utc": 1612830797, "company": "google"}, {"body": "TAFE Report's push for free skills training would 'distort market' - The Australian Financial Review", "score": 0, "created_utc": 1612830796, "company": "google"}, {"body": "TAFE Airways Aviation and TAFE Qld partner up for Gold Coast first aviation qualification - Gold Coast Bulletin", "score": 0, "created_utc": 1612830795, "company": "google"}, {"body": "TAFE Training provider pulls the plug on nursing courses - The Australian Financial Review", "score": 0, "created_utc": 1612830795, "company": "google"}, {"body": "TAFE State government's Summer Skills program now includes seven TAFE NSW online short courses - Camden Haven Courier", "score": 0, "created_utc": 1612830794, "company": "google"}, {"body": "google can u plz see this app is really this momo app following your policy .Still this app providing 7 days loan to the customer n harrased them.", "score": 0, "created_utc": 1612830785, "company": "google"}, {"body": "Do you enjoy your nefarious earnings from exploiting small children and retirees on a fixed income? I'll wait...", "score": 0, "created_utc": 1612830745, "company": "google"}, {"body": "Assistant can recognize nostalgic song/parodies open_file_folder", "score": 0, "created_utc": 1612830451, "company": "google"}, {"body": "Thanks for the reply.", "score": 0, "created_utc": 1612829934, "company": "google"}, {"body": "is it so hard to at least simply state what was wrong with account? It's been 3 weeks and not a single word from you yet! #FreeTerraria", "score": 0, "created_utc": 1612829916, "company": "google"}, {"body": "decision to phase out third-party cookies will usher in a new digital economy. shares three priorities in getting ready for the post-cookie world #PwCTMT", "score": 0, "created_utc": 1612829644, "company": "google"}, {"body": "Hi, I have an open case [4-5510000031052] to replace my pixel 5. I have been sent an email to order the replacement device but I get the error (OR-SOFF-01) ... how can I solve it?", "score": 1, "created_utc": 1612829413, "company": "google"}, {"body": "According to the message. I have to wait for a reset link to be sent to my nominated Alternate email address i used for the retrieval of.", "score": 0, "created_utc": 1612829391, "company": "google"}, {"body": "Just followed", "score": 0, "created_utc": 1612829189, "company": "google"}, {"body": "forms have a UX design flaw. There is no option to change your logged-in user while accessing a google form that you don't have access to. While Google docs handle this correctly, forms don't do even for GSuite users.", "score": 1, "created_utc": 1612829033, "company": "google"}, {"body": "Thats when I was not allowed to log back in. Preventing me to log in with the new password. So i followed the steps to retrieve a reset password. That's when I was sent an info that there was a need to wait 48 hrs. For you guys to fully identify me.", "score": 0, "created_utc": 1612829029, "company": "google"}, {"body": "Please I lost my phone and my Gmail account is on two step verification and i don't know my 8 digits password, have been trying to recover My account but it's not working please help me get my account back", "score": 0, "created_utc": 1612828963, "company": "google"}, {"body": "check up on relogic. They may take terraria off the google play store and have decided to cancel developement of terraria on google stadia due to you guys suspending their account. If this was intentional, screw you. If not, you may wanna try to get this fixed", "score": 0, "created_utc": 1612828897, "company": "google"}, {"body": "I changed its password. In my google app in my laptop. Without logging out of the app in my smartphone. After everything else was done. So ye normally in the smartphone gmail app. You are automatically signed out. For you to re-enter the new password.", "score": 0, "created_utc": 1612828861, "company": "google"}, {"body": "don't !", "score": 0, "created_utc": 1612826756, "company": "google"}, {"body": "I had a similar experience with Amazon seller account suspended. Just the same answer without explanation. The problem was solved as soon as they got a letter from my lawyer", "score": 1, "created_utc": 1612826547, "company": "google"}, {"body": "Considers Anti-Tracking Feature for #PCMag", "score": 0, "created_utc": 1612826502, "company": "google"}, {"body": "Thanks for the, frankly, late response. But all were good within a day.", "score": 0, "created_utc": 1612826109, "company": "google"}, {"body": "Hi, I recently forgot my google account password . I tried to recover it in recovery page but failed . Please help me to recover this account . Please send me a DM.", "score": 1, "created_utc": 1612825354, "company": "google"}, {"body": "Google please help me I cannot recover my google account please help", "score": 0, "created_utc": 1612824006, "company": "google"}, {"body": "Wow, what a great customer support you provide, exactly after 24 days. expressionless_face", "score": 0, "created_utc": 1612823982, "company": "google"}, {"body": "hey google my phone got hacked and so did my gmail account i'm unable to get back into gmail or my account. hacker has enabled Mfa on to the new number , i've tried recovery steps there nothing else i can do , please help desperate.", "score": 6, "created_utc": 1612823734, "company": "google"}, {"body": "We support small businesses regardless of the owners gender or race. #AllLivesMatter", "score": 0, "created_utc": 1612823653, "company": "google"}, {"body": "Racist", "score": 0, "created_utc": 1612822880, "company": "google"}, {"body": "nastaliq when????", "score": 0, "created_utc": 1612822827, "company": "google"}, {"body": "Cures now", "score": 0, "created_utc": 1612822134, "company": "google"}, {"body": "come one now. OTHER PEOPLES, SPREAD THIS AROUND", "score": 0, "created_utc": 1612821888, "company": "google"}, {"body": "is so corrupt. used to show ads of Russian or other languages while I'm a Japanese. I sent reports \"inappropriate\" to YouTube many times. Nothing changed. They ignore marketing policy. So I decided not to see ads. Then, the app show \"Please update\" to shut down.", "score": 4, "created_utc": 1612821866, "company": "google"}, {"body": ") my amount has dedcted but not created in another account. Please refund my amount..", "score": 2, "created_utc": 1612821789, "company": "google"}, {"body": "Already done everything plus everytime I recieved verification code on my number but it's not working", "score": 0, "created_utc": 1612821769, "company": "google"}, {"body": "Looks \"white-adjacent\" to me...", "score": 0, "created_utc": 1612821541, "company": "google"}, {"body": "pi network is the first crypto currency that needs only your phone to mine. After 1 Billion members, no one else can mine. You can download Pi Network at google playstore or apple store and start earning pi. You need the invation code kittyclaws88", "score": 0, "created_utc": 1612821163, "company": "google"}, {"body": "pi network is the first crypto currency that needs only your phone to mine. After 1 Billion members, no one else can mine. You can download Pi Network at google playstore or apple store and start earning pi. You need the invation code kittyclaws88", "score": 0, "created_utc": 1612821144, "company": "google"}, {"body": "Google has no adequate way to recover 2fa secured account?? I have been requesting help to recover my account for 5 months but Google is unable to recover my account. Why?", "score": 0, "created_utc": 1612820326, "company": "google"}, {"body": "Google has no adequate way to recover 2fa secured account. I have been requesting help to recover my account for 5 months but Google is unable to recover my account", "score": 0, "created_utc": 1612820230, "company": "google"}, {"body": "You're all socialist democrat terrorist", "score": 0, "created_utc": 1612820195, "company": "google"}, {"body": "Plz sir solve my problem don't login my Gmail account Plz sir Thanks.", "score": 0, "created_utc": 1612820186, "company": "google"}, {"body": "So how is that unblocking of coming along? You guys managed to pull your thumb out of your ass yet?", "score": 0, "created_utc": 1612820176, "company": "google"}, {"body": "Sir/Mam, each time Google is asking me my previous password I am typing it, but still I am not able to recover my account. Also, I have changed my phone and I don't have access to my previous phone.", "score": 0, "created_utc": 1612819952, "company": "google"}, {"body": "There are no option to DM. Please sir help me I want to login this gmail account please share next step to login.", "score": 0, "created_utc": 1612819893, "company": "google"}, {"body": "Some responses show the New Racisms, that is, people support racial equality in principle but resist policies that encourage behavior needed to change.Opposition to something intended to Advance Racial Equality, effectively helps replicate racial inequality.", "score": 0, "created_utc": 1612819541, "company": "google"}, {"body": "How isn't this is a racist tweet? Why does it matter what color you are when it comes to supporting businesses? What about Chinese or Italian owned businesses. Are they not good enough?", "score": 0, "created_utc": 1612818933, "company": "google"}, {"body": "is counting us. #sheep", "score": 0, "created_utc": 1612818765, "company": "google"}, {"body": "When you're hungry and you want to discriminate based on race, try using google. Google supports racial discrimination.", "score": 0, "created_utc": 1612818721, "company": "google"}, {"body": "ask me one more damn time what app i wanna use to get to shits annoying fucks", "score": 0, "created_utc": 1612818351, "company": "google"}, {"body": "I forgot my Gmail password!! Please help!", "score": 0, "created_utc": 1612818266, "company": "google"}, {"body": "please help me", "score": 0, "created_utc": 1612817890, "company": "google"}, {"body": "hello google Please make in-build Noice cancellation in new google mobile phone", "score": 0, "created_utc": 1612817395, "company": "google"}, {"body": "Just wanted to let you know your Google translate app is pronouncing Norwegian vrist as vrisant. It seems to be something to do with st being converted to sant as I've noticed it in other words. (Keeping it short for Twitter.)", "score": 0, "created_utc": 1612817344, "company": "google"}, {"body": "play So gone -", "score": 0, "created_utc": 1612817336, "company": "google"}, {"body": "What about businesses??? I'm pretty sure there are more of those. #LatinX #Latinos #LatinPower man_raising_hand_medium_skin_tone man_raising_hand_light_skin_tone man_raising_hand_medium-light_skin_tone man_raising_hand_medium-dark_skin_tone man_raising_hand_dark_skin_tone", "score": 1, "created_utc": 1612817288, "company": "google"}, {"body": "hired a camel to take photos of the desert man_shrugging_medium-light_skin_tone you can get out there too.", "score": 0, "created_utc": 1612817017, "company": "google"}, {"body": "Big scam By play store app Theshoppers app #Theshoppers #BigScam #PlayStore #IndiaWithModi #cybercrime #GOODDAY1MViews #", "score": 3, "created_utc": 1612816953, "company": "google"}, {"body": "Hi, I recently forgot my google account password . I tried to recover it in recovery page but failed . Please help me to recover this account .", "score": 1, "created_utc": 1612816509, "company": "google"}, {"body": "I will eat where the food is good. I do not care who cooks it!", "score": 0, "created_utc": 1612816454, "company": "google"}, {"body": "Sir I have problem with my gmail account", "score": 0, "created_utc": 1612816118, "company": "google"}, {"body": "Let's just support working people in general. They're becoming more rare each day.", "score": 0, "created_utc": 1612816009, "company": "google"}, {"body": "Hi , recently I forgot my goolgle account password . Please help me to recover this account.", "score": 2, "created_utc": 1612815701, "company": "google"}, {"body": "hey google my Gmail account has been hacked idk why and why its if u would help me recover it because all my account has on it and i just loss all my work. Please help a bit i really need my past work.", "score": 0, "created_utc": 1612815544, "company": "google"}, {"body": "hello Google tem me password bhul chuka hun meri Google id nahin chal rahi please help me", "score": 0, "created_utc": 1612815537, "company": "google"}, {"body": "Thanks", "score": 0, "created_utc": 1612815323, "company": "google"}, {"body": "admit it you're not just making any A.I. it's the basilisk isn't it?", "score": 0, "created_utc": 1612815256, "company": "google"}, {"body": "i need help to restore my old account", "score": 0, "created_utc": 1612815187, "company": "google"}, {"body": "Need help I can't forgot my gmail account password", "score": 0, "created_utc": 1612814765, "company": "google"}, {"body": "Why are you censoring Trumps lawsuit wins?!?", "score": 0, "created_utc": 1612814478, "company": "google"}, {"body": "needs to hire me as a Misspelling Specialist cus i'm sick and tired of google not knowing what i'm trying to spell when it's obvious what i'm trying to spell like SOME OF US JUST CAN'T SPELL", "score": 0, "created_utc": 1612814367, "company": "google"}, {"body": "Sounds pretty racist. If I search for white owned businesses, I'm a racist, right? RIGHT?", "score": 0, "created_utc": 1612814282, "company": "google"}, {"body": "Done. I could not initiate DM service,so please reach me there", "score": 0, "created_utc": 1612814148, "company": "google"}, {"body": "Not displaying #stock chart of any #Stock in search result", "score": 0, "created_utc": 1612813724, "company": "google"}, {"body": "hello Google .. I suggest that you put the opposite of many words on Google translate .", "score": 0, "created_utc": 1612813207, "company": "google"}, {"body": "Amazing! This in a white supremacist country!", "score": 0, "created_utc": 1612812907, "company": "google"}, {"body": "Er.....mixed race owned. This one is mixed race and that is evemn more evolutionary! Congrats, Kids! Breaking barriers.", "score": 0, "created_utc": 1612812749, "company": "google"}, {"body": "Dear Google team Why is the stock chart not showing please bother correcting this problem. Thank you", "score": 0, "created_utc": 1612812580, "company": "google"}, {"body": "need to avail The Weeknd's background from the Super Bowl as a Meet background.", "score": 0, "created_utc": 1612812127, "company": "google"}, {"body": "Sort of humorous that Google is promoting black owned businesses using a photo where half of the ownership is white. rolling_on_the_floor_laughing", "score": 1, "created_utc": 1612812108, "company": "google"}, {"body": "Please help me Google to recover my account", "score": 0, "created_utc": 1612811687, "company": "google"}, {"body": "Since I did not put any backup code in my google account and it is not able to find my google account", "score": 2, "created_utc": 1612811600, "company": "google"}, {"body": "Help me open the gmail, This gmail is very important for me, Please Sir Help me. Password change link do folded_hands folded_hands folded_hands folded_hands folded_hands folded_hands backhand_index_pointing_left backhand_index_pointing_left folded_hands folded_hands backhand_index_pointing_left Please for me to open gmail for two photos , pleading_face pleading_face pleading_face pleading_face pleading_face", "score": 0, "created_utc": 1612811458, "company": "google"}, {"body": "//twitter.com/gathe165/status/1295237194454466560?s=09", "score": 0, "created_utc": 1612811312, "company": "google"}, {"body": "I have Vivo Z1X mobile and I have reseted it since it is asking backup cod, I can not login to my Google account. Please help me", "score": 0, "created_utc": 1612811064, "company": "google"}, {"body": "That is so wrong and racist", "score": 0, "created_utc": 1612810670, "company": "google"}, {"body": "do not deserve to get ban. Free", "score": 0, "created_utc": 1612810531, "company": "google"}, {"body": "WHAT WHY", "score": 0, "created_utc": 1612810523, "company": "google"}, {"body": "Next", "score": 0, "created_utc": 1612810433, "company": "google"}, {"body": "Help, my Gmail and YouTube was hacked less than an hour ago, and the details have been changed, I can't login or recover! Help please!", "score": 1, "created_utc": 1612810272, "company": "google"}, {"body": "Are we supposed to now go into a business and ask the race of the owner prior to supporting it? woman_facepalming_medium_skin_tone", "score": 1, "created_utc": 1612810225, "company": "google"}, {"body": "Sounds racist. How do I search white-owned businesses?", "score": 0, "created_utc": 1612810208, "company": "google"}, {"body": "When will we have black theme Meet? (", "score": 0, "created_utc": 1612809159, "company": "google"}, {"body": "Please help my recovery account", "score": 0, "created_utc": 1612808942, "company": "google"}, {"body": "my Google password forgot please help me", "score": 0, "created_utc": 1612808868, "company": "google"}, {"body": "where's my saved passwords on Chrome?!", "score": 0, "created_utc": 1612808822, "company": "google"}, {"body": "How does a business prove that it is black-owned?", "score": 0, "created_utc": 1612808800, "company": "google"}, {"body": "is a bunch of turd munchers", "score": 0, "created_utc": 1612808706, "company": "google"}, {"body": "sucks. Bunch of lizard ppl", "score": 0, "created_utc": 1612808675, "company": "google"}, {"body": "it's very annoying how you guys make me verify my number with you before I can use my phone, because it was working seconds before it made me verify, and it's also very frustrating how you make us verify but you don't give us an option if a code is never sent.", "score": 0, "created_utc": 1612808054, "company": "google"}, {"body": "I think the whole idea of encouraging people to buy from one group is racist. This is the wrong thing to do. If their business provide good service good product at a fair price they will succeed if not they won't.I wonder how you feel about white owned struggling business?", "score": 0, "created_utc": 1612807770, "company": "google"}, {"body": "Please respond! I need your help", "score": 0, "created_utc": 1612807758, "company": "google"}, {"body": "I'm having trouble with my chromecast I keep resetting everything including my router twice, &amp; nothing seems to work. I'm able to connect my phone to the chromecast but it won't give me the option to mirror anywhere.", "score": 1, "created_utc": 1612807600, "company": "google"}, {"body": "OH god give me only one more chance", "score": 0, "created_utc": 1612807535, "company": "google"}, {"body": "I need help signing into my old YouTube account. However I don't remember the password as the account was created in 2006. It asks me to retype my latest password but I wouldn't need my password reset if I remembered it. I need help. Please reach out.", "score": 0, "created_utc": 1612807470, "company": "google"}, {"body": "yeah Google app is down discover tab isn't work at all or loading articles", "score": 0, "created_utc": 1612807315, "company": "google"}, {"body": "I have 4 emails I can't get into my account. My old college email was the recovery emails - I no longer have 920-952-0249 or but a different number and email account recovery has been a huge nightmare. Please help me as soon as possible.", "score": 3, "created_utc": 1612807189, "company": "google"}, {"body": "So stupid! How about we just go where we want to", "score": 0, "created_utc": 1612806952, "company": "google"}, {"body": "why dose your chrome keeps sync me out?", "score": 0, "created_utc": 1612806747, "company": "google"}, {"body": "can you please take on and save Australia from Aussies don't want bing - we want Google faaaaarrrr more than we want government and his awful media", "score": 1, "created_utc": 1612806265, "company": "google"}, {"body": "I unable to login gmail account I fill up google recovery form correctly and right information but google couldn't verify that this account belongs to you. I am real owner of please send me password reset link.", "score": 6, "created_utc": 1612806216, "company": "google"}, {"body": "This comment section is missing the point as usual.", "score": 0, "created_utc": 1612806122, "company": "google"}, {"body": "is such an evil company.", "score": 0, "created_utc": 1612806107, "company": "google"}, {"body": "Your support is abysmal. This convinced me I have no reason to continue paying for games on Stadia or paying the monthly fee for it.", "score": 0, "created_utc": 1612805414, "company": "google"}, {"body": "Why should anyone care what color the owner is? Isn't it more important to know if the food is good?", "score": 0, "created_utc": 1612804973, "company": "google"}, {"body": "Is *she* a black business owner?", "score": 0, "created_utc": 1612804578, "company": "google"}, {"body": "pls let terraria people in their accounts they would like to check their email", "score": 0, "created_utc": 1612804451, "company": "google"}, {"body": "Can i order black tacos please?? Thanks fxrs", "score": 0, "created_utc": 1612804141, "company": "google"}, {"body": "Logs you in faster, steals your data. This should be the slogan. #google #privacy #thief #champ", "score": 0, "created_utc": 1612803927, "company": "google"}, {"body": "sad how many were burned to the ground over the summer frowning_face frowning_face frowning_face", "score": 1, "created_utc": 1612802939, "company": "google"}, {"body": "has announced the launch of OSV (#OpenSource #Vulnerabilities), which the internet giant has described as a vulnerability #database and triage infrastructure for open source projects. #Linux #girlswhocode #OpenSourceSecurity", "score": 6, "created_utc": 1612802595, "company": "google"}, {"body": "As I have stated you can close that account!", "score": 0, "created_utc": 1612801606, "company": "google"}, {"body": "Hi can we pls redesign #googlevoice 2 operate like whatsapp? PLS better even, I know u're capable! I #love that we r able 2 create numbers for businesses, but I also use it for personal reasons n u make me feel so safe! Let's make it #prettier!?! PLS xo", "score": 0, "created_utc": 1612800937, "company": "google"}, {"body": "This isn't the best example of a black owned business, seems to be 1/2 black owned......", "score": 0, "created_utc": 1612800916, "company": "google"}, {"body": "I can't imagine a more pathetic company, EVERYTHING you do fails, you have yet to launch even a single succesful product. You manage to rake in billions, yet screw over your users, employees and general public regularly. What an absolute Joke.", "score": 0, "created_utc": 1612800803, "company": "google"}, {"body": "Disgusting only for black owned businesses", "score": 0, "created_utc": 1612800761, "company": "google"}, {"body": "expands into #health tracking using smartphone cameras to monitor heart and respiratory rates. It's via #HealthTech #BigHealthcareCompanies", "score": 0, "created_utc": 1612800704, "company": "google"}, {"body": "spell check buracracy", "score": 0, "created_utc": 1612800693, "company": "google"}, {"body": "BLM will probably burn it down just like they have other businesses. BLM...terrorist organization.", "score": 0, "created_utc": 1612800566, "company": "google"}, {"body": "what the actual fuck?? What is even the point of this service if I can't watch games that are on the networks I pay for??", "score": 0, "created_utc": 1612800410, "company": "google"}, {"body": "make your dog do this grinning_face_with_sweat", "score": 0, "created_utc": 1612800377, "company": "google"}, {"body": "please bring back Cryptoface on YouTube! #freethetrade", "score": 0, "created_utc": 1612799910, "company": "google"}, {"body": "announces it is meeting Apple's privacy challenge, will add nutrition style privacy labeling to its app store. This will tip the scales toward #transparency in the mobile app world. #ccpa #cpra", "score": 0, "created_utc": 1612799853, "company": "google"}, {"body": "Horrible company", "score": 2, "created_utc": 1612799765, "company": "google"}, {"body": "That's my pal!", "score": 1, "created_utc": 1612799407, "company": "google"}, {"body": "my computer crashed and I had to reinstall Backup and Sync and it created a new computer on my drive to sync to, how do I connect to what I already had on there?", "score": 0, "created_utc": 1612799396, "company": "google"}, {"body": "you got some explain to do....", "score": 0, "created_utc": 1612799223, "company": "google"}, {"body": "#MyTwitterAnniversary I'm happy to be able to tell you about the new technology! We are reporting in the field of quantum computer technology. The goal is for IBM to be at the forefront. why? Do you need a quantum compiler? There is technology that is not needed.", "score": 0, "created_utc": 1612799078, "company": "google"}, {"body": "this is my very important email id with you tube channel. I formate my my mobile and thats why my email gone in this email id I have 2 step verification i clear 1 step with my last password but I am not able to clear second step bcz", "score": 1, "created_utc": 1612798784, "company": "google"}, {"body": "Oh, you want to cancel a subscription? Okay, just go to this webpage and have a nice day ) You have to use an apple device to cancel this service. Oh, you don't have an apple device? You need to install itunes. Oh, no PC access? Lifetime subscriptions for you!", "score": 0, "created_utc": 1612798688, "company": "google"}, {"body": "Kind of like saying supporting a business ran by Christians is atheist. Doesn't make any sense.", "score": 0, "created_utc": 1612798609, "company": "google"}, {"body": "can you guys update this", "score": 0, "created_utc": 1612798440, "company": "google"}, {"body": "I don't care what race owns it... this crap is getting old. Run it well, be 1st there, last to leave = success Start it because free money, no risk = poor me", "score": 0, "created_utc": 1612798204, "company": "google"}, {"body": "these new strategists might be causing the banking glitches", "score": 0, "created_utc": 1612798176, "company": "google"}, {"body": "They are basically saying there's no value in certain people having profiles", "score": 0, "created_utc": 1612798017, "company": "google"}, {"body": "they are saying a cog is stupid loudly_crying_face hatching_chick The Twitterers", "score": 0, "created_utc": 1612797908, "company": "google"}, {"body": "When I research good food, and good restaurants, I don't care the color of the skin of the owner....it is not them that I am going to eat!", "score": 0, "created_utc": 1612797799, "company": "google"}, {"body": "and if you don't want to add real persons in your support, the least you can do is to decouple the accounts so that a ban on youtube does not take everything else with it.", "score": 0, "created_utc": 1612797680, "company": "google"}, {"body": "How about supporting all small business and drop the black and white.", "score": 0, "created_utc": 1612797215, "company": "google"}, {"body": "Hopefully you have them a considerable discount on your ad fees. You guys are scum.", "score": 0, "created_utc": 1612797175, "company": "google"}, {"body": "How about ALL SMALL BUSINESSES!", "score": 0, "created_utc": 1612797065, "company": "google"}, {"body": "Larry Page when do I get paid for my work with the Mandesmorium?", "score": 0, "created_utc": 1612796860, "company": "google"}, {"body": "Some White people are so damn clueless! #Blackownedbusinesses are highlighted because they're less than 3% of all businesses in the USA and 40% of those have closed due to Covid. Plus it's #BlackHistoryMonth. Learn something!", "score": 0, "created_utc": 1612796648, "company": "google"}, {"body": "how to be singal white? #HandeErel", "score": 0, "created_utc": 1612796301, "company": "google"}, {"body": "Why does skin color matter????", "score": 0, "created_utc": 1612796005, "company": "google"}, {"body": "#SupportAmericanSmallBusiness Regardless of race, color or creed #WeAreOne", "score": 0, "created_utc": 1612795986, "company": "google"}, {"body": "WTF??? IVE BEEN LOCKED OUT OF MY GMAIL FOR MONTHS NOW PLEASE HELP . I EVEN KNOW KY PASSWORD AN DC EVERYTHING .VPIECE IF DHIT ACCOUNT RECOVERY", "score": 4, "created_utc": 1612795846, "company": "google"}, {"body": "The blacks will burn it down. Like they do everywhere else.", "score": 0, "created_utc": 1612795626, "company": "google"}, {"body": "Hi, I need help to check in your system. i've forgotten my old account. is it possible to find with phone number?", "score": 0, "created_utc": 1612794969, "company": "google"}, {"body": "Well too bad for you beacause i do not have any girl friends! &gt; )", "score": 0, "created_utc": 1612794846, "company": "google"}, {"body": "I have an idea for how to fix all of your vulnerabilities. a reverse bug bounty where your employees are asked to step forward and publicly account any vulnerabilities within your company (not necessarily code related).", "score": 0, "created_utc": 1612794826, "company": "google"}, {"body": "takes down #Parler because they see the platform as a threat but they leave apps on their platform which infect user devices. Rinn #TES", "score": 0, "created_utc": 1612794717, "company": "google"}, {"body": "Omg thats me!", "score": 6, "created_utc": 1612794490, "company": "google"}, {"body": "Mudsharkery", "score": 0, "created_utc": 1612794191, "company": "google"}, {"body": "Is it possible to mail order your specialty and have it sent to Texas?", "score": 0, "created_utc": 1612794013, "company": "google"}, {"body": "Company that spent a decade knowingly promoting white supremacy and conspiracy theories because they \"drove engagement\" says what? STFU. Google needs to be broken up into many very small pieces before they kill again.", "score": 0, "created_utc": 1612793878, "company": "google"}, {"body": "to pay ~$3.8m to settle allegations systemic comp/hiring discrimination at CA &amp; WA sites. &gt;5,500 current employees &amp; job applicants will receive payments under a conciliation agreement. Google Settles Pay and #Hiring 3Bias Case for $3.8 Million", "score": 0, "created_utc": 1612793419, "company": "google"}, {"body": "Why do we have to insult this hard-working entrepreneur by bringing the color of his skin into a discussion of his success.", "score": 0, "created_utc": 1612793248, "company": "google"}, {"body": "Great thank you. I am now following you. Please help as I'm trying to get into my Instagram account from this email which is locked. Thank you smiling_face", "score": 1, "created_utc": 1612793144, "company": "google"}, {"body": "How about senior citizen small business owners?", "score": 0, "created_utc": 1612793074, "company": "google"}, {"body": "- Biden plans to increase corporate taxes to 28%. Trying to kill corporations, now small business is dead.", "score": 0, "created_utc": 1612792924, "company": "google"}, {"body": "Find me a Valentine first", "score": 0, "created_utc": 1612792914, "company": "google"}, {"body": "meet is such a horrible product.", "score": 0, "created_utc": 1612792787, "company": "google"}, {"body": "what the actual fuck is this", "score": 0, "created_utc": 1612792722, "company": "google"}, {"body": "Hello there. I've been in touch of some people at your company with the subject of my Google Account. I've lost my access, I remember an password I've used 1 year ago, but I still being negated access. I linked this account to Google Authenticator and Instagram, that I've lost.", "score": 2, "created_utc": 1612792508, "company": "google"}, {"body": "how am I supposed to contact google support", "score": 0, "created_utc": 1612791864, "company": "google"}, {"body": "Not heard anything you", "score": 0, "created_utc": 1612791851, "company": "google"}, {"body": "Need help in finding a gurl bruhh !!??", "score": 1, "created_utc": 1612791826, "company": "google"}, {"body": "Help me to recover my gmail id Please help me loudly_crying_face loudly_crying_face loudly_crying_face", "score": 1, "created_utc": 1612791026, "company": "google"}, {"body": "Hello friends smiling_face_with_smiling_eyes Here's the easiest way to start workout and Martial Arts and remain consistent. Please subscribe folded_hands_dark_skin_tone folded_hands_dark_skin_tone folded_hands_dark_skin_tone", "score": 0, "created_utc": 1612791024, "company": "google"}, {"body": "and ! Release the BAN on Cryptoface! Or WE will BAN YOU!", "score": 0, "created_utc": 1612790777, "company": "google"}, {"body": "No thanks. I am good.", "score": 1, "created_utc": 1612790531, "company": "google"}, {"body": "Inspiration is a fancy word for copying someone's work.", "score": 0, "created_utc": 1612790474, "company": "google"}, {"body": "A dog or a box of chocolate, Both will end up badly.", "score": 1, "created_utc": 1612790385, "company": "google"}, {"body": "Native Americans are saying that good,we have been trying to support White and Native American small businesses, and its hard", "score": 0, "created_utc": 1612790327, "company": "google"}, {"body": "I just want the best product or service at the best possible price.", "score": 0, "created_utc": 1612790278, "company": "google"}, {"body": "hope you subscribe to my channel I upload videos daily red_heart red_heart red_heart red_heart Thank You smiling_face_with_halo smiling_face_with_halo", "score": 0, "created_utc": 1612790273, "company": "google"}, {"body": "\"The very,very rich are getting much richer during the pandemic $73 billion Jeff Bezos; $45 billion Elon Musk; $31 billion Mark Zuckerberg; $28 billion Bill Gates; $19 billion L Page; $19 billion Sergey Brin; Total $215 billion. Tax their wealth.Break up Big Tech\"-Bernie", "score": 0, "created_utc": 1612790223, "company": "google"}, {"body": "hi, I've got a note 10 and tablet A, I've downloaded Google calendar on both but can't it the tablet to sync to the phones calendar so it shows what's on my phone on the tablet, any help appreciated", "score": 1, "created_utc": 1612790119, "company": "google"}, {"body": "Broken App #GoogleMyBusiness", "score": 0, "created_utc": 1612789406, "company": "google"}, {"body": "Google, that is because you helped burn down so many businesses you insensitive idiots. You never pay for your damage to America. Someday the tide will turn on you Big Tech COMMUNISTS who hate.", "score": 1, "created_utc": 1612789396, "company": "google"}, {"body": "Why are they making this about race . This pisses me off ! I want a list of white owned businesses!", "score": 0, "created_utc": 1612789323, "company": "google"}, {"body": "Thanks for confirming that you can access the contact email address you provided. Unfortunately Google couldn't verify that belongs to you. Learn more about how to recover your account. could you plz help my account is locked for more than 20 days..", "score": 2, "created_utc": 1612789083, "company": "google"}, {"body": "There's a special referral event going on in the #Webull mobile app smiling_face_with_heart-eyes Participate to win awesome prizes!", "score": 0, "created_utc": 1612788984, "company": "google"}, {"body": "I need my Adobe subscription canceled. Please I need my Adobe subscription canceled please", "score": 0, "created_utc": 1612788976, "company": "google"}, {"body": "how do I contact your support team. I need to speak with someone ASAP", "score": 0, "created_utc": 1612788926, "company": "google"}, {"body": "this all seems wrong", "score": 0, "created_utc": 1612788712, "company": "google"}, {"body": "What about White Wife's Matter?", "score": 0, "created_utc": 1612788694, "company": "google"}, {"body": "Goggle is the Company that KILLS DREAMS especially if you are a conservative.. there were thousands of conservative Media Sites on UTube yanked off for 1 reason ONLY.. they had a conservative viewpoint that disagreed with Google /YouTubes Socialist agenda .. #GOOGLEGESTAPO", "score": 0, "created_utc": 1612788532, "company": "google"}, {"body": "Insufficient. It's only half black owned.", "score": 0, "created_utc": 1612788292, "company": "google"}, {"body": "my phone doesnt recognize or find the backup thats on my drive. help", "score": 0, "created_utc": 1612788133, "company": "google"}, {"body": "this is how you treat your costumers? thats why cancelled his game.", "score": 1, "created_utc": 1612787917, "company": "google"}, {"body": "As long as he stays on Dims message. U stray from that google censors u", "score": 0, "created_utc": 1612787376, "company": "google"}, {"body": "Sure thing. I followed, so whenever you're ready.", "score": 0, "created_utc": 1612787308, "company": "google"}, {"body": "should have a direct 24/7 service line. They run most of the future in the cloud wall garden they call google drive. Our information should be money enough for them to consider everyone a paying a customer not just a google one subscriber.", "score": 2, "created_utc": 1612787260, "company": "google"}, {"body": "I have posted videos on YouTube that have detailed descriptions. Now if I search for a similar subject as described by text in my videos, my own videos appear fairly high in the search results. Is this customized for my Google account?", "score": 0, "created_utc": 1612786899, "company": "google"}, {"body": "why do you guys seem to hate your #Stadia service?", "score": 0, "created_utc": 1612786869, "company": "google"}, {"body": "I am DESPERATE to get access to my acct", "score": 0, "created_utc": 1612786834, "company": "google"}, {"body": "Google not support me in DM Nobody help me loudly_crying_face loudly_crying_face iam verry sad my account was lost. iam trying to recovery over 2 month but not sucess", "score": 0, "created_utc": 1612786650, "company": "google"}, {"body": "This is very misleading why would gorilla glue come up when I clearly searched for gorilla snot fix this ASAP", "score": 0, "created_utc": 1612786609, "company": "google"}, {"body": "I still don't have access to the account please is very important to me this the mail", "score": 0, "created_utc": 1612786572, "company": "google"}, {"body": "sucks. They have tons of small businesses stuck in verification for weeks and months but do nothing about it. Suspending accounts and making them invisible at random. Not right. #GoogleSucks", "score": 0, "created_utc": 1612786483, "company": "google"}, {"body": "Where do I search for conservative owned businesses?", "score": 0, "created_utc": 1612786164, "company": "google"}, {"body": "is going to start phasing out its broad match modifier by expanding its phrase match modifier. Read on to find out if this will affect your #search queries #Google", "score": 0, "created_utc": 1612786044, "company": "google"}, {"body": "hey, I'm doing a research paper on a book I found on google books and I need the page number but I can't seem to find it anywhere. Is there a way to do that? loudly_crying_face (this is the book in case yall need it idk", "score": 0, "created_utc": 1612786012, "company": "google"}, {"body": "#googleGnome come on Google, isn't it time for a weather proof Google home for the garden? You can call it the Google Gnome grinning_face thumbs_up", "score": 0, "created_utc": 1612785886, "company": "google"}, {"body": "tell your photos app to stop showing me Memories Together with my ex please n thanks", "score": 0, "created_utc": 1612785397, "company": "google"}, {"body": "can you please help me get me into my old account?? I already created a new one but would like to get all my old pictures off my Google cloud. #gmail #google", "score": 0, "created_utc": 1612785395, "company": "google"}, {"body": "Lets support ALL small businesses. Must of them are owned by poor whites and poor minorities, but we all are trying to make it and we ALL are contributing.", "score": 0, "created_utc": 1612785053, "company": "google"}, {"body": "fix what you've done to your customer service for what has been told today by is a scandal and an outburst if even them can't get help I wonder how the rest of the world would react. I say we move on from google completely if this is just gonna keep happening.", "score": 1, "created_utc": 1612785039, "company": "google"}, {"body": "Myself whiteQUinee Gaming, I am unable to login gmail account. I am trying to login my account so many times but it's don't login.Also trying to forgot password I have no received any kind of OTP in my mobile no. So please help me.", "score": 1, "created_utc": 1612785019, "company": "google"}, {"body": "Promote your Store and get sales guarantee", "score": 0, "created_utc": 1612784855, "company": "google"}, {"body": "Promote your store with sales guarantee", "score": 0, "created_utc": 1612784826, "company": "google"}, {"body": "- please tell me how I turn off damn notifications from you about \"sign in to this website with google\" every time I go to a site? I don't want to sign in with google. How do I make that stop??", "score": 0, "created_utc": 1612784624, "company": "google"}, {"body": "I checked again, and I was sent a code to another account I made, but that one's for recovery, I'm trying to get my main account back. I typed the code, and I'm waiting for an email.", "score": 1, "created_utc": 1612784612, "company": "google"}, {"body": "Hi we already complain it 8times while we are booking a train ticket on 9Nov 2020 Money debited but ticket can't booked Almost 4Months happen our Money can't credited", "score": 0, "created_utc": 1612784546, "company": "google"}, {"body": "can you spread this message", "score": 0, "created_utc": 1612784410, "company": "google"}, {"body": "he google my gmail account is can't recover plez help me my very important data at store in my gmail account plez recover my gmail account This my gmail account", "score": 0, "created_utc": 1612784018, "company": "google"}, {"body": "apparently I forgot my password &amp; no longer have access to the backup phone number when I moved countries", "score": 0, "created_utc": 1612783936, "company": "google"}, {"body": "IDK every time I try to create at least an account on youtube it says I cannot access that but IDK why!!! But it's okay.", "score": 0, "created_utc": 1612783215, "company": "google"}, {"body": "Proper #patching would have prevented 25% of all #zerodays found in 2020 #cybersecurity", "score": 1, "created_utc": 1612783188, "company": "google"}, {"body": "#HeyGoogle Why do y'all keep allowing abusive content creators to keep making and growing channels y'all keep deleting to sit back and harass and lie on other people? This woman needs her entire youtube shut down for the 10th and final time!", "score": 0, "created_utc": 1612782521, "company": "google"}, {"body": "Using skin color is racist.", "score": 0, "created_utc": 1612782306, "company": "google"}, {"body": "Done", "score": 0, "created_utc": 1612782121, "company": "google"}, {"body": "warns of a zero-day vulnerability in the V8 open-source engine that's being actively exploited by attackers. Read more here #V8 #CyberAttacks #Cybercriminals", "score": 1, "created_utc": 1612782008, "company": "google"}, {"body": "Since when did Omaha become part of Chicago??? Somebody please help", "score": 3, "created_utc": 1612782003, "company": "google"}, {"body": "Please i lost my phone and my Google account is on two steps verification, and i don't know my 8 digits password. Please help me have been trying to recover My account for weeks now but it's not working", "score": 0, "created_utc": 1612781735, "company": "google"}, {"body": "When are you going to update iOS apps and stop being scared of disclosing how much data you collect?", "score": 0, "created_utc": 1612781535, "company": "google"}, {"body": "and allowed people to find, research, and share Q-anon. and all allowed people to listen to Trump. If Parler can be taken down for the Q-anon content and ' inciting violence', why aren't these companies being taken down?", "score": 0, "created_utc": 1612781474, "company": "google"}, {"body": "I want garo language on Google ASAP sneezing_face", "score": 2, "created_utc": 1612781307, "company": "google"}, {"body": "why does it turn the volume up on my xbox when I clearly said down", "score": 0, "created_utc": 1612781193, "company": "google"}, {"body": "Yeah you Gmail Captcha is Broken Fix it.", "score": 0, "created_utc": 1612780835, "company": "google"}, {"body": "what is the status on creating the lock assignment feature for google classroom. As the teacher, I should be able to lock asgmts and students shouldn't be able to submit once locked. It would be up to the teachers discretion to unlock. Signed -A very frustrated teacher", "score": 0, "created_utc": 1612780801, "company": "google"}, {"body": "my accout was hacked. Hacker changed recovery mail and phone. Google cant help me to take my account back, also YT with 55 videos and 40k viewers. pouting_face anxious_face_with_sweat hot_face", "score": 7, "created_utc": 1612780696, "company": "google"}, {"body": "Is that why an ad campaign that is targeted for U.S being shown in South Asia,where I cannot sell or ship to? So much for supporting black owned businesses", "score": 0, "created_utc": 1612780656, "company": "google"}, {"body": "WHY DID MY PIXEL3A UNROOT ITSELF?", "score": 0, "created_utc": 1612780603, "company": "google"}, {"body": "why is there no full #bitcoin node in Google Home yet? Not even a wallet. Are you sleeping? Remember how missed Internet?", "score": 0, "created_utc": 1612780481, "company": "google"}, {"body": "What a stupid ad. Just support small business. It doesn't need to be about color. Good grief. face_with_rolling_eyes", "score": 3, "created_utc": 1612780185, "company": "google"}, {"body": "Help help help help folded_hands_light_skin_tone crying_face folded_hands_light_skin_tone crying_face folded_hands_light_skin_tone crying_face folded_hands_light_skin_tone crying_face folded_hands_light_skin_tone crying_face folded_hands_light_skin_tone crying_face folded_hands_light_skin_tone crying_face folded_hands_light_skin_tone crying_face folded_hands_light_skin_tone crying_face folded_hands_light_skin_tone crying_face folded_hands_light_skin_tone crying_face folded_hands_light_skin_tone crying_face folded_hands_light_skin_tone crying_face folded_hands_light_skin_tone crying_face folded_hands_light_skin_tone crying_face folded_hands_light_skin_tone crying_face folded_hands_light_skin_tone crying_face folded_hands_light_skin_tone crying_face folded_hands_light_skin_tone crying_face", "score": 0, "created_utc": 1612780164, "company": "google"}, {"body": "When I go out to buy some thing, I don't walk into a business to see who owns it, a black guy or a white guy, I go into a store to find the best deal.", "score": 0, "created_utc": 1612780125, "company": "google"}, {"body": "sir please provide me a Google task mate refferal code", "score": 0, "created_utc": 1612779914, "company": "google"}, {"body": "and Please could you look urgently into the automatic algorithm-banning of CryptoFace's YouTube channel. It is not clear why this done as it did not appear to break any rules and no reason has been given. Please reinstate ASAP! )", "score": 0, "created_utc": 1612779249, "company": "google"}, {"body": "Service like this is absolutely unacceptable. If what Andrew is saying is true, and he has not done anything to violate ToS, you should be ashamed of yourselves.", "score": 1, "created_utc": 1612779222, "company": "google"}, {"body": "Trying to figure out how this isn't racist. So choosing a business over another based upon skin color is okay? I though that was done away with a generation ago...", "score": 0, "created_utc": 1612778929, "company": "google"}, {"body": "We should support ALL small business, not just black? Why seclude other races out?", "score": 0, "created_utc": 1612778833, "company": "google"}, {"body": "yall got any customer service or nah? this shit cant be ok", "score": 1, "created_utc": 1612778632, "company": "google"}, {"body": "So people only want to eat there because of minority ownership not because he produces a great product. Nice way to belittle his service.", "score": 0, "created_utc": 1612778406, "company": "google"}, {"body": "stuck on this. I tried to login on all devices including the one wich the account was created, but still nothing. Tried to restore it but nothing. I filled the form and got an automated email telling me to do the exact same thing I have already did in the beginning...", "score": 0, "created_utc": 1612777977, "company": "google"}, {"body": "You have decided for some reason that my IP address is in the UAE even though I'm in the US. How to I stop getting ads in arabic?", "score": 0, "created_utc": 1612777950, "company": "google"}, {"body": "This is nice and racial! Since when do we say \"Search Hispanic, White, or Chinese\" businesses? Are they asking for a handout or our pity? Most businesses would never use race to drive traffic into their store.", "score": 0, "created_utc": 1612777943, "company": "google"}, {"body": "I have a problem .. Please guide me..", "score": 0, "created_utc": 1612777937, "company": "google"}, {"body": "Why are advertising for them and not others? Not fair!", "score": 0, "created_utc": 1612777910, "company": "google"}, {"body": "is an asshole with money. Can't be that smart though if they thought everyone's internet infrastructure was ready for something like #Stadia. |Andrew (Redigit) tells Google to get stuffed, cancels #Terraria on Stadia|", "score": 0, "created_utc": 1612777863, "company": "google"}, {"body": "shame on you. Ordered a Chromecast google tv on 23rd Jan and it still hasn't arrived. Stop blaming #Covid and #CanadaPost. I have received items from China quicker than this. No compensation or answer to why it's lost in the mail.", "score": 1, "created_utc": 1612777636, "company": "google"}, {"body": "i forgot my gmail password and tried to recover it but there's no security questions asked or anything else. it only asked me to type the last pw i remembered (which of course i don't remember anything). pls help me recover my account", "score": 2, "created_utc": 1612777530, "company": "google"}, {"body": "This seems a sad commentary or how Google supports racism and division. If they do a great job and provide a great product then they should get great reviews and deserve success. Are we now going to be able to easily find companies based on our prejudices?", "score": 0, "created_utc": 1612777417, "company": "google"}, {"body": "why does my Chrome browser keep crashing since I installed the latest update? #GoogleChrome", "score": 0, "created_utc": 1612777409, "company": "google"}, {"body": "i've replied to your dm in response to my issue, i'm unsure if you've seen it or not, are you able to help?", "score": 0, "created_utc": 1612776993, "company": "google"}, {"body": "Yes Google I have tried all the ways to recover I am not able to do it because I have not accessed my account from more than 4 years. Please help.", "score": 3, "created_utc": 1612776837, "company": "google"}, {"body": "Support all small businesses!", "score": 0, "created_utc": 1612776560, "company": "google"}, {"body": "Hello Team Google My account is not opening.Please help me, I request you Google team.", "score": 1, "created_utc": 1612776534, "company": "google"}, {"body": "Hey Google, I have some proofs of the property of an Google Account that I want to recover, such as an YouTube video that has been sent by my actual smartphone but with a different version of Android OS I have a link with Instagram in this account that is by Google Authenticator", "score": 2, "created_utc": 1612776470, "company": "google"}, {"body": "I have no interest in supporting businesses based on the race of their owners, you Medieval Ages-minded troglodytes.", "score": 0, "created_utc": 1612776396, "company": "google"}, {"body": "This is racism", "score": 0, "created_utc": 1612776389, "company": "google"}, {"body": "Do something about this", "score": 0, "created_utc": 1612776267, "company": "google"}, {"body": "Hello, I randomly received a 0.76 payment from Google today. There was a reference code attached. What's this about?", "score": 0, "created_utc": 1612776252, "company": "google"}, {"body": "is fake", "score": 0, "created_utc": 1612776195, "company": "google"}, {"body": "at it again. Welcome to the party Libs. No one's safe. Censorship is censorship regardless of who is being censored. Not agreeing w/ the person being censored, de-platformed, or demonetized doesn't make it NOT censorship. #BidenRegret #CancelCulture #BigTechCensorship", "score": 0, "created_utc": 1612776195, "company": "google"}, {"body": "I've already followed your account. Do you need some details about my account? I have proofs of the property into the account, like a video I've sent to YouTube by my actual smartphone and some subscription that I have in common with my actual account.", "score": 1, "created_utc": 1612776030, "company": "google"}, {"body": "I tried everything. Nothing worked.", "score": 0, "created_utc": 1612775789, "company": "google"}, {"body": "I have question about, what the fuck you did with RUSSIAN WRITER IVAN BUNIN? You okay? Or you russophobic?", "score": 0, "created_utc": 1612775757, "company": "google"}, {"body": "I am trying to recover my email on urgent basis. I am having only mobile number currently with me I forgot all question and recovery email is of someone else whom I am not able to connect. Can you please help me in recovery.", "score": 3, "created_utc": 1612775692, "company": "google"}, {"body": ", , etc, why do they have insane algorithm interview questions? In software development the interview is harder than the job itself #webdev #softwaredevelopment", "score": 2, "created_utc": 1612775340, "company": "google"}, {"body": "said it paid more than $6.7 million in bug bounty rewards to 662 security researchers across 62 countries for submitting vulnerability reports in Google products last year. #cybersecurity #infosec #datasecurity", "score": 3, "created_utc": 1612775030, "company": "google"}, {"body": "I support businesses that provide a great product and a great service. The owner's skin color isn't even considered. Why should it be?", "score": 0, "created_utc": 1612774991, "company": "google"}, {"body": "It's time for the people to dump Google products like and their OS and move to a more consumer friendly environment who respects our beliefs and values.. I haven't used a product in years but it's about that time", "score": 0, "created_utc": 1612774890, "company": "google"}, {"body": "further evidence of your systematic inaction against #Cybercrime #Spam #Scams", "score": 0, "created_utc": 1612774852, "company": "google"}, {"body": "You're all socialist democrat terrorist !", "score": 0, "created_utc": 1612774504, "company": "google"}, {"body": "Please restore account, he was streaming something very important to us. Thank you.", "score": 0, "created_utc": 1612774375, "company": "google"}, {"body": "It's almost as if the white woman doesnt exist...good job google.", "score": 0, "created_utc": 1612774325, "company": "google"}, {"body": "hi! I'm not sure if you've seen my reply to the dm, but I've replied to you about my query, as I still need further help, thank you so much! )", "score": 0, "created_utc": 1612774201, "company": "google"}, {"body": "To Offer Heart And Respiratory Rate Measurements Using Smartphone #digitalhealth", "score": 0, "created_utc": 1612774124, "company": "google"}, {"body": "glad you're catching on to the facts!", "score": 0, "created_utc": 1612774092, "company": "google"}, {"body": "Please help my mom! her husband abandoned her and she is having a hard time affording divorce fees, school, and medical bills. Can you please help us by donating $10 or sharing this message? Thank you! smiling_face_with_hearts Read her story here", "score": 0, "created_utc": 1612774017, "company": "google"}, {"body": "Please help my mom! her husband abandoned her and she is having a hard time affording divorce fees, school, and medical bills. Can you please help us by donating $10 or sharing this message? Thank you! smiling_face_with_hearts Read her story here", "score": 0, "created_utc": 1612774010, "company": "google"}, {"body": "Why is it so hard to turn off \"turn on\" Google assistant notifications ? Inspite of following everything on every instruction, it's so irritating to have that notification keep popping up. Is there a solution ?", "score": 0, "created_utc": 1612773902, "company": "google"}, {"body": "in bits these days", "score": 0, "created_utc": 1612773897, "company": "google"}, {"body": "please remove the suspension for CryptoFace on YouTube.", "score": 0, "created_utc": 1612773722, "company": "google"}, {"body": "Jigsaw Announces Toxicity-Reducing API, Perspective, is Processing 500M Requests Daily #Tech #Technology #Marketing #B2B #salestech #Salestechnology #sales", "score": 0, "created_utc": 1612773675, "company": "google"}, {"body": "Yes I managed to lock them out. They are trying with old emails to try and gain access. I am deleting all old accounts", "score": 0, "created_utc": 1612773671, "company": "google"}, {"body": "This happened on the Google Payments site when I was asking for help. First, what's the difference which format I use  you can detect &amp; convert easily. Second, please indicate what the right format is. Thanks. #userexperience #UI #UX", "score": 1, "created_utc": 1612773382, "company": "google"}, {"body": "I just followed you, send me a dm please", "score": 0, "created_utc": 1612773185, "company": "google"}, {"body": "Andrew Spinks should have his google account renewed, or at least real responses instead of a 3 week run around. Fix it", "score": 1, "created_utc": 1612773066, "company": "google"}, {"body": "is evil", "score": 0, "created_utc": 1612772998, "company": "google"}, {"body": "I'm using last three year of Google but there is no resale value in Market so plz make some discount and all folded_hands folded_hands", "score": 0, "created_utc": 1612772786, "company": "google"}, {"body": "is unaccountable and a threat to a free and open society.", "score": 0, "created_utc": 1612772758, "company": "google"}, {"body": "#freeterraria What in the world is taking you guys so long? It's been more than 3 weeks, have you any idea how this affects ??", "score": 3, "created_utc": 1612772554, "company": "google"}, {"body": "Think fast.", "score": 0, "created_utc": 1612772538, "company": "google"}, {"body": "Maybe we should put a sign over the door to designate the race of the owner. If it's a black-owned business, the sign says Blacks only. If it's a white-owned business, the sign over the door says Whites only. Hmmm... Where have we seen this before?", "score": 0, "created_utc": 1612772534, "company": "google"}, {"body": "She is white. So the business must be white-owned.", "score": 0, "created_utc": 1612772425, "company": "google"}, {"body": "hey reinstate crypto face. Dude does everything to stay within community guidelines", "score": 0, "created_utc": 1612772309, "company": "google"}, {"body": "Please take a look at Crypto Face Youtube Channel. He is helping people, not breaking any rules... We need him Live!", "score": 1, "created_utc": 1612772220, "company": "google"}, {"body": "Yeah I'm still able to sign in, no worries. I changed all my passwords and such!", "score": 0, "created_utc": 1612772118, "company": "google"}, {"body": "what happened to redigits accounts?", "score": 0, "created_utc": 1612772102, "company": "google"}, {"body": "How do I send a text", "score": 0, "created_utc": 1612772090, "company": "google"}, {"body": "Why did you suspend CryptoCipher? aka Cryptoface.Turn it back on now.", "score": 0, "created_utc": 1612772048, "company": "google"}, {"body": "denying Michael Lindell My Pillow ad word purchases", "score": 0, "created_utc": 1612772026, "company": "google"}, {"body": "why tho?", "score": 0, "created_utc": 1612772008, "company": "google"}, {"body": "hello there, why is cryptoface banned?", "score": 0, "created_utc": 1612771984, "company": "google"}, {"body": "stop fucking with", "score": 0, "created_utc": 1612771923, "company": "google"}, {"body": "Why oh why would you take Crypto Face's live stream down today. He's done nothing wrong &amp; has changed people lives for the good today &amp; on many days.", "score": 0, "created_utc": 1612771900, "company": "google"}, {"body": "Please get Crypto Face back online.", "score": 0, "created_utc": 1612771863, "company": "google"}, {"body": "please un ban he has done nothing wrong and does nothing but help people. He did nothing wrong and does not deserve to have his account banned.", "score": 0, "created_utc": 1612771741, "company": "google"}, {"body": "why did you delete Crypto Face's youtube account? He did nothing wrong. what a bummer for many of us. enough already!", "score": 1, "created_utc": 1612771673, "company": "google"}, {"body": "channel has just been deleted from Youtube. Please review this, this is one of the most informative and cool channels out there, many crypto channels have suffered in the past few weeks w/o breaking any guidelines, this has to stop. FREE MY MAN", "score": 0, "created_utc": 1612771637, "company": "google"}, {"body": "Please unlock account. His content is life changing!", "score": 0, "created_utc": 1612771533, "company": "google"}, {"body": "Please unsuspend youtube account. He is helping a community of people vested in bettering themselves. Taking his account down means a lot of people are losing out on much valuable information and learning opportunities!", "score": 0, "created_utc": 1612771485, "company": "google"}, {"body": "you guys have blocked youtube mid live stream. This must be an error as no policy was broken. Please fixthis!", "score": 0, "created_utc": 1612771484, "company": "google"}, {"body": "please allow crypto face to stream on youtube. Don't ban him ! He's the best crypto youtuber and teaches his community so much about crypto! His channel promotes a friendly and positive space and he has changed SO many of our lives for the better. Please don't do this !", "score": 1, "created_utc": 1612771451, "company": "google"}, {"body": "Please stop banning on YouTube. He is not doing anything wrong and have many followers who enjoy his live streams!", "score": 0, "created_utc": 1612771443, "company": "google"}, {"body": "unsespend the channel from please ... He is helping so much people and you are suspending him....What is wrong whit you?", "score": 0, "created_utc": 1612771425, "company": "google"}, {"body": "please un ban crypto face. He only had 1 active strike on his channel and he did nothing wrong to get his account banned.", "score": 0, "created_utc": 1612771407, "company": "google"}, {"body": "Please Fix this. this channel is a good channel !! very good info and education Thanks !!", "score": 0, "created_utc": 1612771386, "company": "google"}, {"body": "Hey could you guys help out there seems to be an issue with his channel?", "score": 0, "created_utc": 1612771368, "company": "google"}, {"body": "Free the People's Champ we weren't breaking any rules worried_face", "score": 0, "created_utc": 1612771358, "company": "google"}, {"body": "please re instate crypto faces youtube channel. He's been making such a positive impact in the crypto currency space and teaches all of us so much, while creating a friendly and positive learning environment ! Please let him stream and un ban him! Please ) ) )", "score": 1, "created_utc": 1612771342, "company": "google"}, {"body": "Please let the community know which guidelines he didn't follow?", "score": 0, "created_utc": 1612771327, "company": "google"}, {"body": "Modern-day segregation, compliments of Big Tech", "score": 0, "created_utc": 1612771105, "company": "google"}, {"body": "Dear sar My gmail account Not Recover. and I lost my gmail password. Account is. Ples Help me,", "score": 2, "created_utc": 1612770993, "company": "google"}, {"body": "Ads have shut us down since November because of their \"Misrepresentation\" policy. They offer no solutions and only Copy/Paste answers to emails. Then I found this, \"politics, social issues, or matters of public concern\" won't be tolerated. WTH!?! #censorship", "score": 0, "created_utc": 1612770971, "company": "google"}, {"body": "hi! I'm not sure if you've seen my reply to the dm, but I've replied to you about my query, as I still need further help, thank you so much! )", "score": 0, "created_utc": 1612770913, "company": "google"}, {"body": "very bad service every time i found issue with you.. Amount deducted but still not deposit. I need my money back.. Please support.", "score": 1, "created_utc": 1612770605, "company": "google"}, {"body": "let free with his account", "score": 0, "created_utc": 1612770295, "company": "google"}, {"body": "I only support Australian Aboriginal- and Inuit-owned businesses, please make that searchable along with black-owned businesses or I will sue you for #discrimination", "score": 0, "created_utc": 1612770244, "company": "google"}, {"body": "please help me recover my account. There's only an option for a phone number - I don't have access to anymore. I have a recovery email on the account and it's not letting me use it. My password is correct it's just saying the device isn't recognised pls help", "score": 5, "created_utc": 1612769804, "company": "google"}, {"body": "I am able to log into my google account", "score": 0, "created_utc": 1612769662, "company": "google"}, {"body": "bad move", "score": 0, "created_utc": 1612769478, "company": "google"}, {"body": "announced FLoC, a promising framework among several being researched for a transition to a cookie-less #marketing. What does this mean for #digitalmarketing? My post looks at the implications #machinelearning #Chrome #tech", "score": 3, "created_utc": 1612769318, "company": "google"}, {"body": "Greetings! I verified my age but Im still getting emails about my account getting locked in x days. Did I do it wrong or is there a problem on your end? Before verifying, the emails took me to the verification page, but now it just takes me to the google account settings.", "score": 1, "created_utc": 1612769300, "company": "google"}, {"body": "The governor in your state of CA is killing small businesses of every kind. How about focusing your ad on this?", "score": 0, "created_utc": 1612769283, "company": "google"}, {"body": "google are you kidding me I can't sign in because you guys think the account ain't mines but it is you remove the recovery email off the account and now I can't even sign in -_-", "score": 0, "created_utc": 1612768906, "company": "google"}, {"body": "Unblock Andew Spinks! [terraria]", "score": 0, "created_utc": 1612768782, "company": "google"}, {"body": "no I cant", "score": 0, "created_utc": 1612768700, "company": "google"}, {"body": "I don't support anything based on skin color or gender. I'm not racist.....", "score": 0, "created_utc": 1612768689, "company": "google"}, {"body": "your turn", "score": 0, "created_utc": 1612768514, "company": "google"}, {"body": "You guys are bitchmade", "score": 0, "created_utc": 1612768107, "company": "google"}, {"body": "Yes of course I've tried a lot, but as I said it was from a long time and I couldn't remember", "score": 0, "created_utc": 1612768047, "company": "google"}, {"body": "I need to speak to a human on the phone if possible. Can you send me a number I can PM you one for someone to call us", "score": 0, "created_utc": 1612767918, "company": "google"}, {"body": "alternative? Yes, please! #Graph", "score": 12, "created_utc": 1612767786, "company": "google"}, {"body": "Question regarding Google Authenticator I need to export my info in order to have it imported back onto the same phone after a wipe. The only option I have for export is to create a QR code, but it expects for me to have a 2nd device ready &amp; won't let me screenshot it. Options?", "score": 0, "created_utc": 1612767759, "company": "google"}, {"body": "I hope whoever owns your product/design team thought of adding the QR code extension on the address bar got a 10 million dollars raise. Saves we web designers 2 minutes at a time (and that 2 mins adds up pretty fast).", "score": 1, "created_utc": 1612767249, "company": "google"}, {"body": "hi, I've had an issue with an unauthorized login and I need some assistance. I was unable to find any other way to contact google directly.", "score": 0, "created_utc": 1612767156, "company": "google"}, {"body": "Hey, google don't you know that President Trump did more to help Americans start their businesses? He made more citizens jobs for Black/Latino's than any other President. He also set up a 500million $ fund (on an annual basis) for Black colleges. No one had ever done that B/4.", "score": 0, "created_utc": 1612767024, "company": "google"}, {"body": "please help me i need donation for my leaver transplant your donation save my life", "score": 0, "created_utc": 1612766962, "company": "google"}, {"body": "is considering like anti tracking measures for #Android Google's solution won't be as strict as Apple's. I think, its safe to speculate. Stocks of #Facebook and many #advertisement businesses, associated with it, is going to take a hit.", "score": 0, "created_utc": 1612766910, "company": "google"}, {"body": "you guys took Season 4 of Reno 911 off of your servers which I paid for in full. I deserve a refund for that.", "score": 0, "created_utc": 1612766751, "company": "google"}, {"body": "Ok. I'm following your account. I'm waiting for you. my smartphone doesn't work and I really need to check my email.I don't know why but when i digit the code you sent me to the Gmail recovery account you continue to say that I'm not the owner...it's unbelievable!", "score": 1, "created_utc": 1612766381, "company": "google"}, {"body": "Hi there is one bug in your photos app, The video autoplays after 2seconds when i pause it , My app is up to date. If you want i can share video recording of the bug.", "score": 1, "created_utc": 1612766373, "company": "google"}, {"body": "hi! I'm not sure if you've seen my reply or dm, but I've replied to you about my query, as I still need further help, thank you so much! )", "score": 0, "created_utc": 1612766134, "company": "google"}, {"body": "play", "score": 0, "created_utc": 1612766116, "company": "google"}, {"body": "TITAN 2FA keys can be copied. and keys that use the same chip are likely susceptible, too. Be careful of using #FIDO token with NXP chipset. #clone #itsecurity", "score": 3, "created_utc": 1612766083, "company": "google"}, {"body": "Ruthlessly slaughtered Terraria for Stadia. Their practices are shadowy af. Staying away from them with a credit card and so should you. Steam for the win.", "score": 0, "created_utc": 1612765626, "company": "google"}, {"body": "Thank you - done!", "score": 0, "created_utc": 1612765288, "company": "google"}, {"body": "NO! ALL small biz's need support! pouting_face", "score": 0, "created_utc": 1612765250, "company": "google"}, {"body": "is what are doing acceptable? Just asking. Thank you", "score": 0, "created_utc": 1612764983, "company": "google"}, {"body": "Sir please rply ... please sir ...it's urgent", "score": 1, "created_utc": 1612764852, "company": "google"}, {"body": "follow my channel #technicalstardom", "score": 0, "created_utc": 1612764771, "company": "google"}, {"body": "Sir I was resetting my phone Nd I forgot my Gmail password ..now I m unable to recover that ...I m facing so much problems ... please help me out sir ...please sir ...tht I'd is so much important for me", "score": 0, "created_utc": 1612764743, "company": "google"}, {"body": "hey google, can you explain why you are associating mental illness with lgbt?", "score": 0, "created_utc": 1612764698, "company": "google"}, {"body": "will not display the Doorbell. Google prefer you buy their products. Consumers should be allowed to choose, not restricted by the hub you buy. Many articles say that Ring and Google are compatible. BUT THEY ARE NOT!! Looking at ditching the #GoogleHomeHub.", "score": 0, "created_utc": 1612764673, "company": "google"}, {"body": "Sir please help me to recover my Gmail password ...I was resetting my phone ..Nd I forgot my Gmail password ...sir please help me", "score": 0, "created_utc": 1612764543, "company": "google"}, {"body": "are you just ignoring this?", "score": 0, "created_utc": 1612764463, "company": "google"}, {"body": "please help me recover my account. There's only an option for a phone number - I don't have access to anymore. I have a recovery email on the account and it's not letting me use it. My password is correct it's just saying the device isn't recognised please help", "score": 3, "created_utc": 1612764432, "company": "google"}, {"body": "please", "score": 0, "created_utc": 1612764420, "company": "google"}, {"body": "yeah i can .he mailed someone from my account. can u delete that sent mail?", "score": 0, "created_utc": 1612764194, "company": "google"}, {"body": "Please donate and share!", "score": 0, "created_utc": 1612764149, "company": "google"}, {"body": "Already tried that. It says we will take a look at you request and it might take a several weeks.", "score": 0, "created_utc": 1612763676, "company": "google"}, {"body": "Trump allowed this!", "score": 0, "created_utc": 1612763150, "company": "google"}, {"body": "seriously? you're going to mess with the likes of Redigit? OuttaPocket", "score": 0, "created_utc": 1612761953, "company": "google"}, {"body": "when will you introduce a decent account recovery process? Your current process is a disaster and prevents users from accessing their photos, email and other assets. Or do we need to change the legislation in order for you to wake up? #eupolitics", "score": 0, "created_utc": 1612761900, "company": "google"}, {"body": ", #theshoppersscan, how can you give space to such apps? this app has defrauded money from people.", "score": 0, "created_utc": 1612761552, "company": "google"}, {"body": "DM when can", "score": 0, "created_utc": 1612761477, "company": "google"}, {"body": "Answer me on your DM!!! This is taking way toooooo long to add a location on google map!!!! Since dec 2020!!!! And toooo long to take action!!! Im following you already!!", "score": 0, "created_utc": 1612761255, "company": "google"}, {"body": "have recently announced that using the same hyperlink twice, on one web page, is not considered spam and as long as the anchor texts are different, you are good to go! Take a read here #SEO #Digitalmarketing #Google #Anchortext", "score": 1, "created_utc": 1612760643, "company": "google"}, {"body": "do you guys take money from business owners to hide bad reviews? I don't see a review I posted yesterday on the restaurant Google review page. Fishy eh", "score": 0, "created_utc": 1612760584, "company": "google"}, {"body": "hello i'm desperate. I'm searching for help . I was attacked by a hacker who hacked my email. changed the password and more no way. I cannot retrieve my password in any way. I followed the tips but it doesn't help", "score": 1, "created_utc": 1612759786, "company": "google"}, {"body": "i have followed you thanks a lot for this", "score": 0, "created_utc": 1612759726, "company": "google"}, {"body": "I just received this code for Chat verification, and I didn't use Google Meet or Chat. I wasn't even near my phone. What is this?", "score": 0, "created_utc": 1612759715, "company": "google"}, {"body": "when are you going to start regulate your ad platforms? The only banner ads left on YouTube are all bait scams person_facepalming", "score": 0, "created_utc": 1612759568, "company": "google"}, {"body": "i tried to signup my gmail account . I also know my gmail account current password but i am unable to signup so please sir help me to access my gmail account please disable two step verification from my gmail account or please help me to access my account", "score": 1, "created_utc": 1612759398, "company": "google"}, {"body": "Ive tried all of that.what's my othe obtain", "score": 0, "created_utc": 1612759296, "company": "google"}, {"body": "Any message?", "score": 0, "created_utc": 1612758882, "company": "google"}, {"body": "TV - TV designed around you. We're proud to have partnered with Google to create a new brand identity for Google TV. An identity which is now simple, flexible and recognizable. Read the full case study", "score": 4, "created_utc": 1612758810, "company": "google"}, {"body": "just checking if you check your dms after getting in contact? ^^ I've sent some follow up information as I need some specific help and I'm not sure if I'm talking in the wrong place or not )", "score": 1, "created_utc": 1612758791, "company": "google"}, {"body": "I have forgotten my gmail password. Trying for password recovery. So my number and gmail are also coming on otp but does not open even after adding otp. In the last, a latter is coming from google, Google couldn't verify this account belong to you. So please help me", "score": 1, "created_utc": 1612758752, "company": "google"}, {"body": "I tried this morning at 11.09", "score": 0, "created_utc": 1612758704, "company": "google"}, {"body": "Restaurants near me", "score": 0, "created_utc": 1612758569, "company": "google"}, {"body": "Could you please, add a drag &amp; drop email Id from different tabs to \"+Compose\" button. Just had a thought while I was copying an email from elsewhere &amp; thought this would be a great feature (I think so).Would love to hear your thoughts. Have a great day ahead.", "score": 1, "created_utc": 1612758410, "company": "google"}, {"body": "amp added my address but my dress was not verified why Contact me plz 03164427292", "score": 0, "created_utc": 1612758255, "company": "google"}, {"body": "Yes we have tried all means! After verifying phone numbers, it is asking for 8 digit verification code which we do not possess. And after that it's failing to reset. Please help.", "score": 0, "created_utc": 1612758141, "company": "google"}, {"body": "i don't recover my gmail id plz help.", "score": 0, "created_utc": 1612757918, "company": "google"}, {"body": "Hi random help person - my complaint is about an email campaign and it's poor choice of subject title &amp; sending it during hours when majority would be a sleep in the timezone ... you know where my devices are &amp; time of day - poor phrasing &amp; time of day = implied sec issue", "score": 0, "created_utc": 1612757866, "company": "google"}, {"body": "I have since recovered my account.", "score": 0, "created_utc": 1612757861, "company": "google"}, {"body": "your account recovery process is terrible. Relative is going crazy trying to get back into her account, which sends her in loops. Phone pin not enough. Support not allowed to use Google one payment details to validate. Will suggest stopping payments.", "score": 0, "created_utc": 1612757680, "company": "google"}, {"body": "glass cover of pixel 2 XL damaged by mistake due old age and glass sediments must have gone into it. Please help. Shall be more careful in future.", "score": 1, "created_utc": 1612757518, "company": "google"}, {"body": "can we still trust you !? #GoodMorningTwitterWorld #google #chrome #buckybarnes #dogecoin #dreamfell #DateRush #EVERGLOW #gorillagluegirl #IndiaWithModi #India #snow #topface2021 #uksnow #UNSC #z dear see this !!", "score": 6, "created_utc": 1612757290, "company": "google"}, {"body": "its fine", "score": 0, "created_utc": 1612757120, "company": "google"}, {"body": "Yea i was able to log in now! i also added 2fa so its secure. Thank you google )", "score": 0, "created_utc": 1612756699, "company": "google"}, {"body": "I'm now following you", "score": 0, "created_utc": 1612756298, "company": "google"}, {"body": "hi! I'm not sure if you've seen my reply or dm, but I've replied to you about my query, as I still need further help, thank you so much! )", "score": 0, "created_utc": 1612755987, "company": "google"}, {"body": "emailing me at 3am to check account sec for no apparent reason is a trigger", "score": 1, "created_utc": 1612755861, "company": "google"}, {"body": "Why does Gmail 'Grrr! A popup blocker may be preventing the application from opening the page' Why do you want me to be angry at my browser when you should be delivering a website that doesn't use vulnerable features such as pop ups?", "score": 0, "created_utc": 1612755775, "company": "google"}, {"body": "ok I'm following now", "score": 0, "created_utc": 1612755549, "company": "google"}, {"body": "give me my phone!! Please XD", "score": 0, "created_utc": 1612755394, "company": "google"}, {"body": "yes, I did. and I filled out every last step. still no joy. I got emails from you stating \"someone knows your password\" ... well, I do.", "score": 0, "created_utc": 1612755245, "company": "google"}, {"body": "can y'all fix this", "score": 0, "created_utc": 1612755131, "company": "google"}, {"body": "omg! i was literally seeking help to die and here you are sending me numbers of people to talk to? duh...", "score": 0, "created_utc": 1612755065, "company": "google"}, {"body": "this is a trippy question..if u allow me to download all my data about my phone, that I paid u all these years to collect..is it okay for me to redistribute it..they just let me download my whole music am coming for u", "score": 0, "created_utc": 1612754974, "company": "google"}, {"body": "A whole google responded to Uzo! #Class", "score": 0, "created_utc": 1612754917, "company": "google"}, {"body": "isn't that racist?", "score": 1, "created_utc": 1612754694, "company": "google"}, {"body": "PLEASE implement a dark mode in google classroom to save my eyes", "score": 0, "created_utc": 1612754620, "company": "google"}, {"body": "Chrome is ditching third-party cookies for good. If all goes according to plan then future updates will rewrite the rules of online #advertising and make it far harder to track the web activity of billions of people.", "score": 0, "created_utc": 1612754132, "company": "google"}, {"body": "Can you PLEASE put AM/PM on the fucking clock?!? Like WTF. This shouldn't even be a \"Thing\". This conversation shouldn't be happening.", "score": 1, "created_utc": 1612753894, "company": "google"}, {"body": "carried out a research study called Project Oxygen to find out whether managers matter'. They ended up proving GOOD management makes a difference &amp; identified 10 behaviours in their top performing managers. Read more here -", "score": 0, "created_utc": 1612753863, "company": "google"}, {"body": "Yes I've tried it a long time ago", "score": 1, "created_utc": 1612753802, "company": "google"}, {"body": "How about American-owned businesses?", "score": 1, "created_utc": 1612753568, "company": "google"}, {"body": "lol u bourgeois scum", "score": 0, "created_utc": 1612753512, "company": "google"}, {"body": "can you create an multiplayer online google maps?", "score": 1, "created_utc": 1612753500, "company": "google"}, {"body": "Help, Can not recover google account.", "score": 0, "created_utc": 1612753442, "company": "google"}, {"body": "Can not recover google account. Sent many request. But not working.", "score": 0, "created_utc": 1612753399, "company": "google"}, {"body": "Can not recover google account", "score": 0, "created_utc": 1612753348, "company": "google"}, {"body": "Racist History Month", "score": 1, "created_utc": 1612753279, "company": "google"}, {"body": "Hello have a good day", "score": 4, "created_utc": 1612752635, "company": "google"}, {"body": "Hello, a good day to you", "score": 1, "created_utc": 1612752548, "company": "google"}, {"body": "Trying to reach your support for a while but not been able to . Any way to email/get on call ?", "score": 0, "created_utc": 1612752349, "company": "google"}, {"body": "I dont know how is this happening.. I am getting someone else's mails in my inbox... I am now skeptical on where are my mails going... #Google #gmail #googleerrors #security", "score": 2, "created_utc": 1612751833, "company": "google"}, {"body": "Stop using #COVID19 as an excuse for your poor customer service! You have stolen 20 in December for a Gift Voucher ,40 emails later still it is not working with you accusing me of fraudulent change of code ! You sent me the code ! #COVIDIOTS .", "score": 2, "created_utc": 1612751629, "company": "google"}, {"body": "pls ban kpop stans from using ur services ty", "score": 0, "created_utc": 1612751555, "company": "google"}, {"body": "hello My Google not singing in i have my phonenumber also but at the end Google Could not verify this account belongs to you this shows I have enabled 2step verification I have important data and documents, phone number please help me urgently.", "score": 0, "created_utc": 1612750901, "company": "google"}, {"body": "I am a Mandate/affiliate of ATLANTIS COMMODITIES TRADING LTD. ATLANTIS COMMODITIES TRADING (UK) LTD is a reseller of various product categories. They buy from the direct sellers and take responsibility", "score": 0, "created_utc": 1612750752, "company": "google"}, {"body": "you're putting your service in hot water because you guys can't fix a issue with one of your partners #Stadia", "score": 0, "created_utc": 1612750406, "company": "google"}, {"body": "what the fk is this... asexual doesn't mean  in Sinhala. It's the meaning for homosexuals. Dude fix this I literally k!lled my friend because of this", "score": 0, "created_utc": 1612750003, "company": "google"}, {"body": "Hey google there is bug for this search please look after this... Soon", "score": 0, "created_utc": 1612749843, "company": "google"}, {"body": "my internet is strong but this happens! please fix it!", "score": 0, "created_utc": 1612748985, "company": "google"}, {"body": "Kindly attend to the problem of undelivered email into the inbox of", "score": 1, "created_utc": 1612748899, "company": "google"}, {"body": "Hey google there is bug for this search please look after this... Soon", "score": 0, "created_utc": 1612748600, "company": "google"}, {"body": "The hosting website for has indicated that the undelivered emails are due to your server hence contacted directly. Kindly rectify or DM for further information and clarity", "score": 0, "created_utc": 1612748576, "company": "google"}, {"body": "is amazing.", "score": 0, "created_utc": 1612748461, "company": "google"}, {"body": "Super! smiling_face_with_hearts bouquet bouquet", "score": 0, "created_utc": 1612748445, "company": "google"}, {"body": "Hi guys, I would recommend a great Solar Lights seller on Amazon which I bought from and used for years, really got great fun and charming lighting atmosphere around house. Here is the beautiful solar garden lights I like so much", "score": 0, "created_utc": 1612748044, "company": "google"}, {"body": "please help me recover my account. There's only an option for a phone number - I don't have access to anymore. I have a recovery email on the account and it's not letting me use it. My password is correct it's just saying the device isn't recognised please help.", "score": 0, "created_utc": 1612746214, "company": "google"}, {"body": "Nice", "score": 0, "created_utc": 1612746162, "company": "google"}, {"body": "is run by Communist China REPEAL SECTION 230", "score": 0, "created_utc": 1612746115, "company": "google"}, {"body": "Why are all of my apps on my chromebook crashing on open after update?!", "score": 0, "created_utc": 1612746090, "company": "google"}, {"body": "This guide not help me I'm also visit google office at gurgao. But no response anywhere.", "score": 0, "created_utc": 1612746009, "company": "google"}, {"body": "Sema Live update !!! AIADMK Head Quarters Temporarily Closed!!! Ruling party Head Quarters Closed 1st time seeing this and all!!!... Adimaigal Bayathin Utcham.", "score": 1, "created_utc": 1612744928, "company": "google"}, {"body": "When will Google Translate be able to translate songs and shows you're listening to / watching? 2030, maybe?", "score": 0, "created_utc": 1612744663, "company": "google"}, {"body": "I have access on the apple mail app on my phone. But I believe my account has been compromised and I can't log in elsewhere I have tried account recovery various times. I have tried logging in on devices I know I have used as per the picture above. I really need access to this.", "score": 0, "created_utc": 1612744513, "company": "google"}, {"body": "TAFE TAFE pilot program for future aviators - Yahoo News Australia", "score": 1, "created_utc": 1612744423, "company": "google"}, {"body": "TAFE Coast first boost for aspiring pilots - Daily Telegraph", "score": 0, "created_utc": 1612744422, "company": "google"}, {"body": "TAFE South West TAFE scholarship aims to help women study non-traditional trade courses - Warrnambool Standard", "score": 2, "created_utc": 1612744421, "company": "google"}, {"body": "TAFE New gig for former council high-flyer - Herald Sun", "score": 0, "created_utc": 1612744420, "company": "google"}, {"body": "TAFE State government's Summer Skills program now includes seven TAFE NSW online short courses - Camden Haven Courier", "score": 0, "created_utc": 1612744419, "company": "google"}, {"body": "please can I have you thoughts on this please. My new pixel 4a 5g has poor screen quality when viewing video or pics taken on the 4a 5g but the same video taken on the 4a 5g playback fine my 4a and any other devices. Help please pleading_face", "score": 1, "created_utc": 1612744285, "company": "google"}, {"body": "GIVE ANDREW SPINKS HIS ACCOUNT BACK HE DID NOTHING WRONG", "score": 0, "created_utc": 1612744078, "company": "google"}, {"body": "you even admit Mike Lindel's 3 hour documentary of facts are real. Congratulations balloon bottle_with_popping_cork party_popper", "score": 0, "created_utc": 1612743360, "company": "google"}, {"body": "Idk, she looks pretty white to me. Why you racist though?", "score": 0, "created_utc": 1612742511, "company": "google"}, {"body": "pls assist me to get google home mini. I have completed all required steps mentioned in the instruction under offer section. #axisacecreditcard", "score": 0, "created_utc": 1612742195, "company": "google"}, {"body": "#Apigee focuses a lot on #API management &amp; #security but makes no mention of industry specialization or types of calls' API calls vary significantly from one industry to another. #FinServ", "score": 0, "created_utc": 1612742130, "company": "google"}, {"body": "why is half my \"takeout\" from GPM .csv rather than .mp3? Is there any way to actually download the music i paid for?", "score": 0, "created_utc": 1612742060, "company": "google"}, {"body": "Hello team , Please help me to access my gmail account Actually i know my gmail account recovery But i enable two step verification in my Account and i forget to download backup codes so Google is not asking me for mobile phones veverification", "score": 0, "created_utc": 1612741647, "company": "google"}, {"body": "I can't open my gmail account, that is... Please help me recover it", "score": 2, "created_utc": 1612741429, "company": "google"}, {"body": "Piggy park mustard is best in SC", "score": 0, "created_utc": 1612740216, "company": "google"}, {"body": "i forget my gmail password and recovery mail id. i am always forced to answer recovery mail id but i don't remember. I have my registered moblie number. How can i proof its me please suggest me folded_hands", "score": 0, "created_utc": 1612739726, "company": "google"}, {"body": "do you guys know how in the world is baby soul 4 meters tall here?", "score": 0, "created_utc": 1612739191, "company": "google"}, {"body": "how can I send back mail to youtube support.", "score": 0, "created_utc": 1612739073, "company": "google"}, {"body": "Yes. Our recovery email address was entered with one extra character, so we can't receive recovery details. Could I DM you with more information? I'm sure we can prove ownership.", "score": 1, "created_utc": 1612739038, "company": "google"}, {"body": "Tried all, No success!", "score": 0, "created_utc": 1612738799, "company": "google"}, {"body": "Isn't it racist to pick a restaurant for dining based on the owners color of their skin?", "score": 0, "created_utc": 1612738186, "company": "google"}, {"body": "My account has 2 step verification.If you want to know any information about my account I can say that but I am not getting any action to provide account has very important numbers and I am very upset. loudly_crying_face .Please reply!", "score": 0, "created_utc": 1612738105, "company": "google"}, {"body": "Our Lives Matter Vaccinate. Physically distance. Mask Up. Wash Hands. Dr. Kizzmekia Shanta Corbett Safety and Effectiveness of Coronavirus Vaccines Listen. Learn. Share.", "score": 0, "created_utc": 1612737347, "company": "google"}, {"body": "you are no help in my homework middle_finger", "score": 1, "created_utc": 1612737031, "company": "google"}, {"body": "Why do Pixel phones not support HDMI connectivity? Explain it to me like I'm 5.", "score": 0, "created_utc": 1612737005, "company": "google"}, {"body": "Search Hispanic-owned and White-owned and Native American owned and Hindu-owned and Women-owned and Men-owned and Child-owned", "score": 0, "created_utc": 1612736885, "company": "google"}, {"body": "It's very complicated to find an email for google. someone messing around with google shopping photos. We are selling these products for Pokemon, but they put their logo on the listings showing on google. Please find a solution - I believe this is against your policy.", "score": 0, "created_utc": 1612736778, "company": "google"}, {"body": "Sorry, I only support White owned businesses.", "score": 1, "created_utc": 1612736557, "company": "google"}, {"body": "Hey Google, what if the black small business owner is a conservative. Still support it? Burn it down? What's your stance? Asking for a black friend.", "score": 0, "created_utc": 1612736433, "company": "google"}, {"body": "my account has now been disabled for over 3 weeks. I still have no idea why, and after using every resource I have to get this resolved you have done nothing but given me the runaround.", "score": 20086, "created_utc": 1612736400, "company": "google"}, {"body": "wait she's not black", "score": 0, "created_utc": 1612735946, "company": "google"}, {"body": "I really wish I could fix the fact that the clock on my google nest hub is incorrect by and hour, their is no way to change it or any way to set time zones and it's annoying (I go by EST)", "score": 1, "created_utc": 1612735677, "company": "google"}, {"body": "introducing information about the site in search results. Wikipedia entries, when Google indexed the site, security, whether its an ad or not, etc. Fascinating to see how platforms introduce features to stop spread of misinformation. Still to come to India.", "score": 0, "created_utc": 1612734192, "company": "google"}, {"body": "Yes google thank you! My bf likes to hack my google home. Any suggestions on how to not make it happen?", "score": 1, "created_utc": 1612734116, "company": "google"}, {"body": "fire You guys just let Him monitor me? Breaking all privacy laws.. Breach of trust.", "score": 0, "created_utc": 1612733754, "company": "google"}, {"body": "Black owned barbecue? Shameful, disgraceful racial stereotyping! No wonder many \"blacks\" now refer to Google as Joogle!", "score": 0, "created_utc": 1612732760, "company": "google"}, {"body": "who gave the google home the n word pass???? thinking_face", "score": 0, "created_utc": 1612731310, "company": "google"}, {"body": "I Have Added Rs.5000/- On 5th feb Still Not Added", "score": 0, "created_utc": 1612731010, "company": "google"}, {"body": "hello google my google account is not opening", "score": 2, "created_utc": 1612730973, "company": "google"}, {"body": "this twitter is also connected with my gmail account", "score": 0, "created_utc": 1612730941, "company": "google"}, {"body": "i have only asked to verify recovery mail id. i haven't remember my recovery mail id. i have my regestered number and some old password{not last}. and frequently whom i mailed.", "score": 0, "created_utc": 1612730892, "company": "google"}, {"body": "you guys have so many Twitter accounts I don't know which one to talk to. You need to STOP supporting the Republican Party/ because I'm going to delete your entire family of apps if you do not prove to me your support of American democracy#StopGOPSUPPORT or else angry_face pouting_face", "score": 0, "created_utc": 1612730009, "company": "google"}, {"body": "I have forgotten the password of my account and I am getting this notification when i want to reset please help me to recover my account", "score": 0, "created_utc": 1612729368, "company": "google"}, {"body": "hi I am himanshu please recover my you tube account", "score": 0, "created_utc": 1612728708, "company": "google"}, {"body": "please help me google couldn't verify this account belongs to you", "score": 0, "created_utc": 1612728646, "company": "google"}, {"body": "please recover my email account", "score": 0, "created_utc": 1612728112, "company": "google"}, {"body": "Google please recover my Google account", "score": 1, "created_utc": 1612727726, "company": "google"}, {"body": "please help me DM", "score": 0, "created_utc": 1612727628, "company": "google"}, {"body": "please recover my Google classroom account", "score": 0, "created_utc": 1612727621, "company": "google"}, {"body": "google help me put here. my gmail is not on any device as of rigjt now its not anything i own i completely scattered my old phone so i couldn't reset my password. i did the whole request password change and i waited 2 days now it says u cant verify im the maker of the acc", "score": 1, "created_utc": 1612727590, "company": "google"}, {"body": "It's been a long time for me. Google has given me DM yet. Google give me DM as soon as possible.", "score": 0, "created_utc": 1612727552, "company": "google"}, {"body": "please help me DM", "score": 0, "created_utc": 1612727478, "company": "google"}, {"body": "please recover my Google classroom account I am student", "score": 1, "created_utc": 1612727456, "company": "google"}, {"body": "please recover my google account", "score": 0, "created_utc": 1612727366, "company": "google"}, {"body": "recover my account I am student", "score": 0, "created_utc": 1612727263, "company": "google"}, {"body": "You're a month late my account is fine LMAO", "score": 0, "created_utc": 1612727113, "company": "google"}, {"body": "please recover my gmail I'd", "score": 0, "created_utc": 1612726943, "company": "google"}, {"body": "please recover my gmail I'd", "score": 2, "created_utc": 1612726672, "company": "google"}, {"body": "Here's a novel thought... why not make it easier than ever to find and support the most honest, ethical &amp; outstanding businesses in your community on Google Search? Or is it better to simply be racially motivated in all of life's decisions?", "score": 0, "created_utc": 1612726245, "company": "google"}, {"body": "nope", "score": 0, "created_utc": 1612726145, "company": "google"}, {"body": "Dear Sir Please help me sir, i send picture of problem details. Please help me, please stop shopmymobile fake site, please refund my money, please Nefon N20 pluse mobile add stoped, my english week please understand my thought.", "score": 1, "created_utc": 1612726075, "company": "google"}, {"body": "Dear Prime Minister Sir Please help me sir, i send picture of problem details. Please help me, please stop shopmymobile fake site, please refund my money, please Nefon N20 pluse mobile add stoped, my english week please understand my thought.", "score": 1, "created_utc": 1612726012, "company": "google"}, {"body": "I have been trying for days and you won't change my country, thus won't accept my payment, thus I cannot give you money for more storage. I have followed all online guidance. What gives?", "score": 0, "created_utc": 1612725929, "company": "google"}, {"body": "needs to hit that update button face_with_steam_from_nose #7RingsTB12 #SuperBowl", "score": 0, "created_utc": 1612725683, "company": "google"}, {"body": "I just finished watching the Super Bowl Performance on The amount of ads (5 in 15 minutes) was so utterly disrespectful to #TheWeeknd performance, and to him as an artist. Whoever is responsible the ad placement in that video.. shameful.", "score": 0, "created_utc": 1612725633, "company": "google"}, {"body": "Umm, I've been doing this on my iPhone since before I bought a Fitbit... When are you going to release something new? You bought Fitbit, you bought Nest, but we're still waiting for any improvements in the world of Smart Devices...", "score": 0, "created_utc": 1612725550, "company": "google"}, {"body": "Biden will kill that business just like millions of others.", "score": 0, "created_utc": 1612725529, "company": "google"}, {"body": "this ALEXA commercial with is the best!!", "score": 0, "created_utc": 1612725427, "company": "google"}, {"body": "I reset my mobile after that I can't login my Gmail account because I forgot my Gmail password. I have number verification but still it can't verify that account belongs to me. I am student,i have very important data related to my study in my Gmail.Please recovery", "score": 1, "created_utc": 1612725188, "company": "google"}, {"body": "So what did MLK say? He looked forward to the \"day when people are judged by the content of their character, not the color of their skin\"??? So you want people to chooses businesses based upon the \"color of their skin\" of the owners?", "score": 0, "created_utc": 1612724908, "company": "google"}, {"body": "Really? All time interest with 215 likes? Wow there must have been 0 interest before. Good job Google!! The world could not operate without your leadership..... oh wait, it actually CAN", "score": 1, "created_utc": 1612724815, "company": "google"}, {"body": "So we are able to search for businesses based upon the race of the owner? Isn't that a bit racist?", "score": 0, "created_utc": 1612724572, "company": "google"}, {"body": "if you don't know, I bet you can find an answer on one of these platforms instead of believing every post you see here face_with_tears_of_joy", "score": 0, "created_utc": 1612723853, "company": "google"}, {"body": "I unable to login gmail account I fill up google recovery form correctly and right information but google couldn't verify that this account belongs to you. I am real owner of please send me password reset link. Help me", "score": 3, "created_utc": 1612723781, "company": "google"}, {"body": "thank you for your service", "score": 0, "created_utc": 1612722913, "company": "google"}, {"body": "Using skin color is racist", "score": 0, "created_utc": 1612722606, "company": "google"}, {"body": "I guess if you don't have a race problem. Better try to make one. Digital segregation. Full circle.", "score": 2, "created_utc": 1612722063, "company": "google"}, {"body": "If they've been in business since 1946, do they really need you to pander for them in 2021?", "score": 0, "created_utc": 1612721240, "company": "google"}, {"body": "Um, she's not black and there are so many offensive insinuations in this ad I hardly know where to start breaking it down. Please don't do this anymore", "score": 0, "created_utc": 1612720907, "company": "google"}, {"body": "and are pushing #BlackLivesMatter too much. Youtube Kids has a \"black\" section that is first when it loads. Quit pushing politics on children. I am Native American where is the videos and ads promoting us?", "score": 3, "created_utc": 1612720802, "company": "google"}, {"body": "Tube Mastery and Monetization is the best YouTube course and community on the market. It reveals how Matt Par runs 9 different YouTube niche channels without even showing his face", "score": 0, "created_utc": 1612720483, "company": "google"}, {"body": "Hiiii D.O. of EXO is back.. Can you add a description for him ? Because D.O. / Kyungsoo is EXO's main vocal. Don't leave out the description for D.O. blank. it hurts us slightly_smiling_face Thanks, have a nice day!!", "score": 0, "created_utc": 1612720260, "company": "google"}, {"body": "Maybe we should put a sign over the door to designate the race of the owner. If it's a black-owned business, the sign says Blacks only. If it's a white-owned business, the sign over the door says Whites only. Hmmm...", "score": 0, "created_utc": 1612720018, "company": "google"}, {"body": "Could you imagine designating a business as white owned??? Liberal hypocrisy &amp; stupidity is epic!", "score": 0, "created_utc": 1612719649, "company": "google"}, {"body": "why is it that your ok Google application can do everything except turn off the pandemic notifications?", "score": 0, "created_utc": 1612719492, "company": "google"}, {"body": "Awesome", "score": 0, "created_utc": 1612719178, "company": "google"}, {"body": "Awesome", "score": 0, "created_utc": 1612719166, "company": "google"}, {"body": "Thanks, the steps you DMd are the same ones I've been trying. I've pulled an old laptop out of the closet after 5 years and it still doesn't work tried from a place I work that's had the same static IP for a decade. I have both phone and email codes. Why isn't that enough?", "score": 0, "created_utc": 1612718430, "company": "google"}, {"body": "You go with your good old fashioned down home racism Google. Let your bigotry shine for the world to see you as you are", "score": 1, "created_utc": 1612717824, "company": "google"}, {"body": "what is the goal of YouTube to reduce the number of views and likes? to whom and where can I write a complaint about YouTube actions? How do these human rights violations coexist alongside the rule of Democracy in the United States?", "score": 1, "created_utc": 1612717347, "company": "google"}, {"body": "Are you sure about that?", "score": 0, "created_utc": 1612716929, "company": "google"}, {"body": "how come no 5G for IPhone 12 on starting to look likes it's time to switch. Global roaming doesn't have much value and sitting with a major feature I can't use it beyond frustrating.", "score": 1, "created_utc": 1612716872, "company": "google"}, {"body": "How do I contact the Google Accounts team directly via email to sort out an issue with my daughter's Gmail password? Your online \"help\" resources are a confusing waste of time. Thank you.", "score": 2, "created_utc": 1612716180, "company": "google"}, {"body": "is a modern world wonder.", "score": 0, "created_utc": 1612715859, "company": "google"}, {"body": "Hello", "score": 0, "created_utc": 1612715315, "company": "google"}, {"body": "very disappointed with customer service. Closed on a Sunday given the size of your company... unacceptable", "score": 0, "created_utc": 1612715231, "company": "google"}, {"body": "does Nick Jonas have diabetes??", "score": 0, "created_utc": 1612714857, "company": "google"}, {"body": "I need access to old accounts and no longer have the cell number to which they were linked to in order to recover. I can provide copies of old emails, ids, anything. Please help!", "score": 1, "created_utc": 1612714841, "company": "google"}, {"body": "I make sure not to buy here from racist fools!!!", "score": 0, "created_utc": 1612714098, "company": "google"}, {"body": "Google is a globalist organization. They work with China to stifle free speech. These authoritarian thugs are great at it.", "score": 0, "created_utc": 1612713213, "company": "google"}, {"body": "ihave my gmail account I can access my email just forget my password please can get back pleading_face", "score": 0, "created_utc": 1612713109, "company": "google"}, {"body": "if you make me cry from a commercial this year idk what I'll do woman_shrugging_medium_skin_tone #SuperBowl", "score": 0, "created_utc": 1612712212, "company": "google"}, {"body": "Hey Google, maybe you should consider throwing out one virtue signal at a time.", "score": 0, "created_utc": 1612711389, "company": "google"}, {"body": "You post this but you still hypocritically monetize misinformation and hate peddler, Jim Hoft of The Gateway Pundit? Sheesh.", "score": 0, "created_utc": 1612710318, "company": "google"}, {"body": "I can't replace Ubereats in the maps with the correct links for local restaurants online orders? Places w/their own on-line delivery or btownmenus have links to ubereats that local guides can not edit, not ad links, info links. Please assist. Thank you.", "score": 0, "created_utc": 1612710122, "company": "google"}, {"body": "Now that Pixel 5 doesn't have SOLI amd thus no regulation nightmare.. You guys could have easily launched it in India! I really l oved your pixel2/3! You guys have a fanbase here! Amazon asks like double the price for pixel5 and they are the only one selling!", "score": 0, "created_utc": 1612709049, "company": "google"}, {"body": "How many multi-million dollar black athletes are there?Instead of celebrating the FACT that America has open opportunity based on skill, the NBA and NFL bowed to BLM bullying to become a divisive force", "score": 0, "created_utc": 1612709013, "company": "google"}, {"body": "Happier than ever I use DuckDuckGo", "score": 1, "created_utc": 1612708591, "company": "google"}, {"body": "Hi there, how can l recover an old login password, been trying all recovery steps but no luck zany_face disappointed_face .... HELP!", "score": 0, "created_utc": 1612708133, "company": "google"}, {"body": "can't acess my gmail, the account is disabled. I tried to recover it but I am only told to leave an alternative email to be contacted. Once I give the alternative email, I am told to type in the code I just receive to prove the account belongs to me, but still can't prove", "score": 2, "created_utc": 1612707959, "company": "google"}, {"body": "I don't choose businesses based on skin color or gender identity. I choose based on quality, service, and merit. This race/gender path is going to destroy America.", "score": 0, "created_utc": 1612707792, "company": "google"}, {"body": "What about the working class white Americans that you dehumanize?", "score": 2, "created_utc": 1612707756, "company": "google"}, {"body": "Ah yes, more tribalism and segregation. That will help.", "score": 2, "created_utc": 1612707520, "company": "google"}, {"body": "what about creating new colors to use on Google Jamboard, so anoying working only with 7 colors. at least 10 differents colors, it would be nice to change that", "score": 0, "created_utc": 1612706599, "company": "google"}, {"body": "big RIP. So sad, may fav pair of buds I've ever used and they have been lost to the whiter powder of PA. White is my personal fav color on the buds up until it has been lost in white snow loudly_crying_face", "score": 0, "created_utc": 1612706299, "company": "google"}, {"body": "what up with your home speakers never understanding simple commands? Hey Google, turn off Device replies Sorry, I don't understand", "score": 0, "created_utc": 1612703670, "company": "google"}, {"body": "Yes I have, multiple times, unfortunately it does not let me progress to security questions. I set the account up 5 years ago when my daughter was born, but now cannot remember the password to give to her woman_facepalming", "score": 0, "created_utc": 1612703517, "company": "google"}, {"body": "Google is promoting and offering a service to search based on skin color! Where's the media on this extremely racist add/ service? How about choosing a business based on their product and or service", "score": 0, "created_utc": 1612703405, "company": "google"}, {"body": "I choose to spend my money based on quality and service. Not race.", "score": 6, "created_utc": 1612703341, "company": "google"}, {"body": "why can't I connect my #RingDoorbell to my #GoogleHomeHub. Seems and want to make life as difficult as possible for customers", "score": 1, "created_utc": 1612703154, "company": "google"}, {"body": "What would it take to release #Pixel5 in India? Why can't I still get one? pleading_face pleading_face pleading_face", "score": 0, "created_utc": 1612702829, "company": "google"}, {"body": "Help me start a school.", "score": 1, "created_utc": 1612702651, "company": "google"}, {"body": "shouldn't have created those poll for K-pop stans.", "score": 0, "created_utc": 1612702590, "company": "google"}, {"body": "tell me why the FUCKKKK is this happening", "score": 0, "created_utc": 1612702351, "company": "google"}, {"body": "Using a skin color is racist", "score": 2, "created_utc": 1612702273, "company": "google"}, {"body": "A great place to eat home cooking, soul food!", "score": 0, "created_utc": 1612702029, "company": "google"}, {"body": "Where is DM option?", "score": 0, "created_utc": 1612701990, "company": "google"}, {"body": "When I want BBQ, the first thing I think about is how the owner looks. Not!", "score": 7, "created_utc": 1612701813, "company": "google"}, {"body": "YouTube Music blows. Thanks for nothing!", "score": 0, "created_utc": 1612701314, "company": "google"}, {"body": "let me say your customer service is absolutely Sh*t!", "score": 0, "created_utc": 1612700499, "company": "google"}, {"body": "excuse me !!!!", "score": 0, "created_utc": 1612700263, "company": "google"}, {"body": "Love all the cast but you might want to update this seeing as you've missed out the multi award winning star of the movie! woman_facepalming_light_skin_tone", "score": 0, "created_utc": 1612699915, "company": "google"}, {"body": "Yes, especially after Antifa started burning them down!", "score": 1, "created_utc": 1612699662, "company": "google"}, {"body": ".. Maybe Google could create a color chart to let us know what shade of a persons skin is most optimal for us to visit.... And of course if they have the wrong color skin we will know to stay away. #Unbelievable #Insane ...", "score": 2, "created_utc": 1612699408, "company": "google"}, {"body": "PLEASE Stop the BS and take action against #Cybercrime #GoogleCloud could be leading the fight against #cybercriminals but choses to host them!", "score": 1, "created_utc": 1612699385, "company": "google"}, {"body": "Segregation lol", "score": 0, "created_utc": 1612698664, "company": "google"}, {"body": "Once again #GoogleCloud shows complete disregard for reported #spam &amp; #scams making #Google a clear accessory to #Cybercrime", "score": 1, "created_utc": 1612698374, "company": "google"}, {"body": "People usually want good BBQ, not the color of skin of the owner. That's racism.", "score": 2, "created_utc": 1612698127, "company": "google"}, {"body": "You know what else is important? Thermostats that work in -20 degree weather!", "score": 0, "created_utc": 1612698067, "company": "google"}, {"body": "should never discontinue their budget 'a' series smartphones (Ex. #pixel4A). Those are one of the most compact, minimal and value for money android smartphones imo.", "score": 0, "created_utc": 1612697976, "company": "google"}, {"body": "Sad If you make your account more secure and forget the password some day, then the account will not be able to recover because Google does not have a solution for this. I have been trying to recover my account for 5 months but #Google seems unable to recover my account.", "score": 0, "created_utc": 1612697826, "company": "google"}, {"body": "fix this shit.", "score": 0, "created_utc": 1612697817, "company": "google"}, {"body": "Just another feature to collect our P info rolling_on_the_floor_laughing face_with_tears_of_joy face_with_tears_of_joy", "score": 0, "created_utc": 1612697686, "company": "google"}, {"body": "Sad If you make your account more secure and forget the password some day, then the account will not be able to recover because Google does not have a solution for this. I have been trying to recover my account for 5 months but seems unable to recover my account.", "score": 2, "created_utc": 1612697669, "company": "google"}, {"body": "why must you be so cruel? loudly_crying_face loudly_crying_face loudly_crying_face loudly_crying_face", "score": 1, "created_utc": 1612697624, "company": "google"}, {"body": "hello, I would like to discuss about google maps have an idea please tell me what to do to whom to write", "score": 0, "created_utc": 1612697529, "company": "google"}, {"body": "hello, I would like to discuss about google maps have an idea please tell me what to do to whom to write", "score": 0, "created_utc": 1612697513, "company": "google"}, {"body": "hello, I would like to discuss about google maps have an idea please tell me what to do to whom to write", "score": 0, "created_utc": 1612697506, "company": "google"}, {"body": "made a bad decision getting rid of #GoogleMusic. Only place i can get music ala cart without a monthly subscription. easy to use. Now very few options. Apple i need to sign a blood oath.", "score": 0, "created_utc": 1612697210, "company": "google"}, {"body": "Yes i completed the recovery 3 times now and it keeps locking my account because of suspicious activity every couple of weeks. Can you fix this? there is no suspicious activity. its always the same location and the same device. different IP obviously but i can't change that.", "score": 1, "created_utc": 1612697166, "company": "google"}, {"body": "You're*", "score": 0, "created_utc": 1612696680, "company": "google"}, {"body": "Is the BBQ better because the owner is black? No? Then fuck you Stop being evil.", "score": 0, "created_utc": 1612696666, "company": "google"}, {"body": "please help me I have put two step verification it's not resetting the password please help me", "score": 0, "created_utc": 1612696468, "company": "google"}, {"body": "hello this app is using my contact nd calling to my friend family hacked my all contacts... I'm report this app in play store bt u have not take nay action agents this app #paymeindiafraud #banfraudapp #RBIAuditorsCorruption #OperationHaftaVasooli", "score": 10, "created_utc": 1612696384, "company": "google"}, {"body": "How do you know what race a person is when they do a Google search? face_with_rolling_eyes thinking_face Are you SPYING? BUSTED!", "score": 0, "created_utc": 1612696372, "company": "google"}, {"body": "You ok with this? Asking for a friend", "score": 0, "created_utc": 1612696309, "company": "google"}, {"body": "I think google should pay for this!!!", "score": 0, "created_utc": 1612695993, "company": "google"}, {"body": "Love you red_heart", "score": 0, "created_utc": 1612695536, "company": "google"}, {"body": "I wouldn't want Google to check my pulse because I'm a robot according to Google how can the be trusted", "score": 0, "created_utc": 1612695110, "company": "google"}, {"body": "I'm deleting Google snd im not a robot off my phone computer and every.wher the should not be trying to call 911 and I'm not a robot appears that person didn't need to die because Google wanted to know if I was a robot.", "score": 0, "created_utc": 1612694944, "company": "google"}, {"body": "do you guys take money from business owners to hide bad reviews? I don't see a review I posted yesterday on the restaurant Google review page. Fishy eh", "score": 0, "created_utc": 1612694901, "company": "google"}, {"body": "You guys are too smart. From June u are going to charge for cloud storage and for that reason you are trying to cleanup all personal memories uploaded in youtube. The videos which were uploaded 10 yrs back. Not even giving an option to download. F**", "score": 1, "created_utc": 1612694789, "company": "google"}, {"body": "can you please donate me one coupon for Google home mini of flipkart... I need it and i tried every day but all vouchers are already claimed.. Please pleading_face pleading_face pleading_face daya kardo is chhote bache pe", "score": 0, "created_utc": 1612694776, "company": "google"}, {"body": "Promoted says it all.", "score": 5, "created_utc": 1612694672, "company": "google"}, {"body": "can you fix channel on YouTube seen as you are the parent owner of the platform", "score": 0, "created_utc": 1612694129, "company": "google"}, {"body": "I'm Gonna Support Small American owned Business, I just don't give a rats ass what color the owners are.", "score": 1, "created_utc": 1612694127, "company": "google"}, {"body": "so you guys just basically take people money during a whole pandemic. This is sad and disgusting.", "score": 0, "created_utc": 1612693714, "company": "google"}, {"body": "I remember my password my account is successfully recovered sorry for the inconvenience caused.", "score": 0, "created_utc": 1612693656, "company": "google"}, {"body": "I will support small business owners, but I will not put a color before \"owned\".", "score": 0, "created_utc": 1612693614, "company": "google"}, {"body": "Wouldn't that be a half-black owned business, or does she just not count?", "score": 0, "created_utc": 1612693138, "company": "google"}, {"body": "Hi Surendra did you get any response from Google my issue is same as issue", "score": 1, "created_utc": 1612692703, "company": "google"}, {"body": "We shop at stores for their products, service or location, not because of the owners color.", "score": 0, "created_utc": 1612692563, "company": "google"}, {"body": "So much Unity, dividing businesses based on skin tone rather than quality of products and services.", "score": 1, "created_utc": 1612692530, "company": "google"}, {"body": "She looks white to me.", "score": 0, "created_utc": 1612691863, "company": "google"}, {"body": "I'll stick with going to businesses that provide the best service at the best price. Really don't care much about the demographics of the owner.", "score": 0, "created_utc": 1612691571, "company": "google"}, {"body": "Plz 4 years passed please dear google please i am Weeping please help me with manual reviwe.please please please please", "score": 0, "created_utc": 1612691560, "company": "google"}, {"body": "Ive got a bit of a question - I've been trying to fix my site's CLS issue for the last four months. Thing is, lab data shows there is no issue. Field data does. Any ideas as to the cause? I want to be compliant, and I can't figure out how.", "score": 1, "created_utc": 1612691538, "company": "google"}, {"body": "She is white, why not support her half of the business too? Btw, if a divorce occurs, she will own it all. In that event, should we withdraw our support? Racist Morons!", "score": 0, "created_utc": 1612691518, "company": "google"}, {"body": "please send me Reset password link Please Help me Last passwords 03406522830 033678142433 Gmail Mobile Number +923367814243 First Name Farhan Last Name Ahmad Account creation Date OCT-2013 Date of birth 31/12/1993 Recovery email", "score": 0, "created_utc": 1612691359, "company": "google"}, {"body": "I'm sorry that's racist division crap ..I'm not a racist and I take offense at this statement.. if they weren't racists they would say American small businesses..I'm sick of the double standard ..its taboo to say support white businesses.. which I wouldnt support either !", "score": 2, "created_utc": 1612691356, "company": "google"}, {"body": "Imagine my disgust when I try to watch a video on your platform only to see this hideous xenophobic man advertising his company. You're obviously not choosy on who you allow to advertise on your platform.", "score": 0, "created_utc": 1612691254, "company": "google"}, {"body": "Please make an app for google scholar....It will be a great help for us who belongs from the academic fraternity", "score": 0, "created_utc": 1612691246, "company": "google"}, {"body": "come on this isn't right. As technology advances it's more important to teach about color in its most prominent form, light. Having yellow as a primary color is just appeasing the painters. Life is #RGB", "score": 0, "created_utc": 1612691229, "company": "google"}, {"body": "Dear Google team I have tried All recovery methods of Recover gmail account. 4 years passed my I am So warried Please Give me Manual Reviwe. Please please please", "score": 2, "created_utc": 1612690793, "company": "google"}, {"body": "should refund me for all the music purchases i've made on play music that they apparently won't allow me to transfer to their terrible youtube service because i paid for them because i'm not getting swindled into making a whole new youtube account for this nonsense", "score": 2, "created_utc": 1612690746, "company": "google"}, {"body": "I Would use it but most, where I live, burned down by BLM thumbs_up_medium-light_skin_tone", "score": 0, "created_utc": 1612690437, "company": "google"}, {"body": "Thanks google my broblem solved", "score": 0, "created_utc": 1612690393, "company": "google"}, {"body": "Why do you make this so hard? #JustTransThings #Transgender #NameChange #DeadNamesStayDead", "score": 0, "created_utc": 1612690253, "company": "google"}, {"body": "We dream the survival.", "score": 0, "created_utc": 1612689738, "company": "google"}, {"body": "hey please help me open my account. my recovery email does not work??? nor there is any option besides recovery email. how can I prove its my account? I want my account back! please help me google.", "score": 0, "created_utc": 1612689550, "company": "google"}, {"body": "how can i get a task mate referral code..??", "score": 0, "created_utc": 1612689431, "company": "google"}, {"body": "why are you allowing #OwenShroyer of #Infowars to use your podcast service? He was part of the #CapitolInsurrection.", "score": 0, "created_utc": 1612689010, "company": "google"}, {"body": "Dear issue still not resolved . Can you guys please give me the customer support number to whom i may tell my issue in detail .", "score": 0, "created_utc": 1612688888, "company": "google"}, {"body": "What about Asian owned. You never say anything about supporting Asian-owned businesses. #racists", "score": 0, "created_utc": 1612688794, "company": "google"}, {"body": "I unable to login gmail account I fill up google recovery form correctly and right information but google couldn't verify that this account belongs to you. I am real owner of please send me password reset link.", "score": 2, "created_utc": 1612688546, "company": "google"}, {"body": "display ads should display text ads as well. big a$$ display ad with a text ad in the middle.", "score": 0, "created_utc": 1612688518, "company": "google"}, {"body": "tell me, why am I hearing ads to upgrade to YouTube Music Premium when listening to songs when I have a blessed YouTube Music Premium subscription?????", "score": 1, "created_utc": 1612688062, "company": "google"}, {"body": "Chicken wings are not exclusively an appetizer", "score": 0, "created_utc": 1612687972, "company": "google"}, {"body": "these are the real issues, heck the frame rate issue has been around since Oct. Check your forums. You pioneered this Casting culture, you should lead. But it just feels like the same Google. No effort after concept. Just give up and delete the app, studio, device, etc...", "score": 0, "created_utc": 1612687771, "company": "google"}, {"body": "I forget my gmail password And i have Many times wrong password this time Google couldn't verify my account how can solve this problem please reply me", "score": 1, "created_utc": 1612687610, "company": "google"}, {"body": "Can you provide me some free ad credits so that I can advertise and warn people not to book tickets from as they illegally loot customer's refund?", "score": 1, "created_utc": 1612687334, "company": "google"}, {"body": "Is this true for all minority owned businesses as well exclamation_question_mark How about veteran owned businesses exclamation_question_mark STOP playing the damn race card double_exclamation_mark heart_suit diamond_suit spade_suit #unity", "score": 3, "created_utc": 1612687307, "company": "google"}, {"body": "Here for good and for food.", "score": 0, "created_utc": 1612686894, "company": "google"}, {"body": "the back of Pixel 4 XL (which I keep in YOUR case) literally just straight fell off. My phone got water damage thnx 2 this DEFECT. But I'm outside the 1-year warranty period so says it's not their problem they built a shitty phone that falls apart after 15 months", "score": 1, "created_utc": 1612686330, "company": "google"}, {"body": "please do explain! face_with_tears_of_joy", "score": 1, "created_utc": 1612685882, "company": "google"}, {"body": "when your data analysis course at Coursera will be ready?", "score": 0, "created_utc": 1612685647, "company": "google"}, {"body": "folded_hands folded_hands loudly_crying_face I am forget password not forget password please help me not mobile number add my Gmail account not recovery for folded_hands folded_hands loudly_crying_face", "score": 0, "created_utc": 1612685550, "company": "google"}, {"body": "Try to vote here backhand_index_pointing_down", "score": 0, "created_utc": 1612685537, "company": "google"}, {"body": "Just Vote and let's see which is best in hands.", "score": 1, "created_utc": 1612685422, "company": "google"}, {"body": "Hi Google, can I ask what the actual fuck this is? This is similar to some pretty appalling online scams.", "score": 0, "created_utc": 1612685201, "company": "google"}, {"body": "please help me recover my account. There's only an option for a phone number - I don't have access to anymore. I have a recovery email on the account and it's not letting me use it. My password is correct it's just saying the device isn't recognised please help.", "score": 2, "created_utc": 1612684707, "company": "google"}, {"body": "thanks for black owned search flexed_biceps_medium-dark_skin_tone", "score": 0, "created_utc": 1612684611, "company": "google"}, {"body": "I know I am single, but you can't make fun of me persevering_face persevering_face", "score": 0, "created_utc": 1612684542, "company": "google"}, {"body": "How do I uninstall google play music since the app is now useles?", "score": 1, "created_utc": 1612684366, "company": "google"}, {"body": "sucks.", "score": 0, "created_utc": 1612684350, "company": "google"}, {"body": "any ideas why my nest hub keeps telling me my Apple Music account is no longer linked' ? It works on some of my Google devices but not the Nest hub... I've unlinked and relinked no change!", "score": 0, "created_utc": 1612684021, "company": "google"}, {"body": "PLEASE FIX UR APP???? IT LITERALLY SAID MY FILES WERE SAVED IN THE DRIVE AND I COME TO CHECK AND SOME OF THERE AREN'T FINISHED AND SOME ARE MISSING??? I DON'T HAVE ANY EXTRA COPIES OMFG", "score": 1, "created_utc": 1612683968, "company": "google"}, {"body": "Wait, is his wife a white woman? Looks like a 50% black-owned business. Reminds me of when a person is multi-racial...whether 1% or 50% African DNA and...poof! They're black. (ex Tiger Woods, Obama)", "score": 0, "created_utc": 1612683764, "company": "google"}, {"body": "I block Twitter advertisers because they are supporting Twitter censorship. I send this to each of them to explain, so each time you see it, I have blocked another supporter of censorship. When I stop it will be because Twitter's policy has changed or my account has been ended.", "score": 1, "created_utc": 1612683332, "company": "google"}, {"body": "So don't buy from white or spanish businesses is what you're telling people to do???", "score": 0, "created_utc": 1612683288, "company": "google"}, {"body": "please just let me keep my outdated flash its all gone i wanna play animal jam fuck i got MICE ON THERE THAT I NEEDA STARE AT I HAVE A DEN TO DECORATE I HAVE AN OUTFIT TO CREATE WTF", "score": 2, "created_utc": 1612682788, "company": "google"}, {"body": "My account just have been hacked recently and my youtube channel name is RezuREXion with 33.5k subs they deleted every info that I have on my Gmail and now google can't recognize me can you help me recover my account back? please help", "score": 0, "created_utc": 1612682550, "company": "google"}, {"body": "I responed to your suggestions and as I explained they don't work, My business is comprised and you do nothing after my email address was stolen and hacked Pls sort it out", "score": 3, "created_utc": 1612682402, "company": "google"}, {"body": "Wouldn't it be gr8 if a T could create a rubric-style #GoogleForm &amp; have Ss be able to use a marker tool/click an option to score themselves or a peer? Oh, &amp; if we could attach some text/typing questions to it as well that'd be great! #GoogleFormRubric", "score": 1, "created_utc": 1612682263, "company": "google"}, {"body": "Why google", "score": 0, "created_utc": 1612681841, "company": "google"}, {"body": "# scam", "score": 1, "created_utc": 1612681623, "company": "google"}, {"body": "hasn't officially revealed anything about Android 12, but an update has been spotted in the Android Beta Feedback #AndroidDev #GooglePlay", "score": 0, "created_utc": 1612681514, "company": "google"}, {"body": "why have you excluded Rami Malek in the cast section for Bohemian Rhapsody, he is a main character and pivotal to the movie playing Freddie Mercury. This is a disgusting move Google!", "score": 1, "created_utc": 1612681223, "company": "google"}, {"body": "Nest Deals #Google", "score": 2, "created_utc": 1612681203, "company": "google"}, {"body": "This is so racist. The new left is super racist. Singling out any race or ethnicity for special treatment is racist", "score": 2, "created_utc": 1612680756, "company": "google"}, {"body": "It doesn't. ( at some point it's attached to an email address I do not recognize. I'm hoping I could have it disconnected.", "score": 0, "created_utc": 1612680710, "company": "google"}, {"body": "hey google, on kids accounts on the Google home assistant they can't see the rooms. So they end up broadcasting all over the house. Can you help?", "score": 1, "created_utc": 1612680638, "company": "google"}, {"body": "owned radical left-wing moderators deplatformed this comment because it provides a link to an image of Press Secretary Psaki wearing a Russian ushanka with the \"Hammer &amp; Sickle\" of socialism and the \"Red Star\" of communism.", "score": 0, "created_utc": 1612680546, "company": "google"}, {"body": "hi! I'm not sure if you've seen my reply or dm, but I've replied to you about my query, as I still need further help, thank you so much! )", "score": 0, "created_utc": 1612680201, "company": "google"}, {"body": "a short story.i went on holidays, had the reservations on my email .the battery of my phone died, i cant log in Gmail because i have Need my dead phone to validate my authentication, Yes!", "score": 0, "created_utc": 1612680173, "company": "google"}, {"body": "I Will never forgive your worker and my ungrateful son Caglar Unlu.. #ungratefulsoncaglarunlu. Ebubekir nl, Md, mgo, Minimal Acces surgeon in Turkey", "score": 0, "created_utc": 1612679649, "company": "google"}, {"body": "Yes, pay 1 BTC compensation for all users of your CryptoTab Browser that have an EUR Trojan dangerous Virus in the browser.exe file while buying Kaspersky Solutions! It's a fair Deal! face_savoring_food", "score": 1, "created_utc": 1612679292, "company": "google"}, {"body": "on Thursday removed The Great Suspender, a popular #Chrome extension used by millions of users, from its Chrome Web Store for containing #malware. It also took the unusual step of deactivating it from users' computers.", "score": 3, "created_utc": 1612679281, "company": "google"}, {"body": "needs to recognize the N word with an \"a\" at the end and not an \"er\"...", "score": 0, "created_utc": 1612679230, "company": "google"}, {"body": "your story's are shit and stop keep going on about Amanda Holden I don't like her now because she all we are seeing , she nothing special and I'm glad X factor had gone for a year , we need blind date , play your cards right or family Fortunes , not X factor", "score": 0, "created_utc": 1612679072, "company": "google"}, {"body": "yea i already did", "score": 0, "created_utc": 1612678933, "company": "google"}, {"body": "Just blacks,? How about the other! Brown , Latino, etc", "score": 0, "created_utc": 1612678827, "company": "google"}, {"body": "Support Small Businesses. Color Does Not Matter.", "score": 0, "created_utc": 1612678650, "company": "google"}, {"body": "How many black people are on google's board of directors? Hypocrites.", "score": 2, "created_utc": 1612678318, "company": "google"}, {"body": "Why don't we have Sanskrit translation in Google ? I have seen tweets posted in Sanskrit are identified as Marathi/Hindi and translation is random. I feel Google must have oldest language with script on #Googletranslate", "score": 1, "created_utc": 1612678280, "company": "google"}, {"body": "I call bullshit. Texas has to be tortilla chips and salsa.", "score": 0, "created_utc": 1612677832, "company": "google"}, {"body": "I am able to sign in and it seems like things were reviewed but untouched. They got into my laptop and were controlling the camera but didn't do much else that I know of.", "score": 0, "created_utc": 1612677071, "company": "google"}, {"body": "Looks like black AND white owned to me....or is it the white woman' part that doesn't count anymore?", "score": 0, "created_utc": 1612676820, "company": "google"}, {"body": "Google now supports racism? Segregating out your favorite color is the definition of racism. Own it", "score": 0, "created_utc": 1612676635, "company": "google"}, {"body": "But it has to be a mixed race couple before Google will promote it. Because if it was just white, you know Google is going to put it way down in the results.", "score": 0, "created_utc": 1612676552, "company": "google"}, {"body": "TAFE Training provider pulls the plug on nursing courses - The Australian Financial Review", "score": 8, "created_utc": 1612675985, "company": "google"}, {"body": "spectacular fail. Google forms being used to spam me on the \"unpunctuated alias\" of my Gmail account and get around Google spam filtering. Thanks", "score": 0, "created_utc": 1612675969, "company": "google"}, {"body": "Joe Morris David Morris 15 May at 12 16  Joe Morris David Morris 3 April  See more See more Book", "score": 0, "created_utc": 1612675531, "company": "google"}, {"body": "has announced that they are going to block everything but Chrome from accessing certain Google features (like Chrome sync) starting on March 15.", "score": 0, "created_utc": 1612674770, "company": "google"}, {"body": "Over the past year, Google's censorship has hit all time highs. China and the communist democRats are grateful.", "score": 0, "created_utc": 1612674451, "company": "google"}, {"body": "Yes thank you", "score": 0, "created_utc": 1612674367, "company": "google"}, {"body": "This ad itself appears very racist and fascist.", "score": 2, "created_utc": 1612673463, "company": "google"}, {"body": "I thought systemic racism was a thing??? Oh- maybe it really isn't after all and you're confident you'll get more business advertising black-owned vs hurting your business. shushing_face", "score": 0, "created_utc": 1612673238, "company": "google"}, {"body": "What a fuck, you didn't let Honor use your services", "score": 0, "created_utc": 1612672214, "company": "google"}, {"body": "I need a real fuck partner. kiss_mark kiss_mark anyone free here for live video sex. #Add me on #Snapchat SnapMe ---- carina31330", "score": 0, "created_utc": 1612671910, "company": "google"}, {"body": "Help Can not recover google account...", "score": 0, "created_utc": 1612671844, "company": "google"}, {"body": "Can not recover gmail account... Help", "score": 0, "created_utc": 1612671820, "company": "google"}, {"body": "Can not recover google account... Help", "score": 0, "created_utc": 1612671801, "company": "google"}, {"body": "says it has made progress toward a new system allowing the delivery of targeted advertising without the use of privacy-invading \"cookies\" #googlenews", "score": 0, "created_utc": 1612671622, "company": "google"}, {"body": "When will you be getting a #ClassAction for the shitty #LowQuality #Algorithms destroying peoples hearing when listening to your hosted output? #QuantThat Can #PublishingPlatforms like still cause suable harm to health, beit psychological or physical?", "score": 0, "created_utc": 1612670606, "company": "google"}, {"body": "My Gmail is not login in any phone and i am not able to use my gamil because my phone number is lost also is number is connected with my Gmail my another number is connected with my Google pay account and this Google pay is connected with my Gmail pls recovery my Gmail", "score": 2, "created_utc": 1612669460, "company": "google"}, {"body": "So we're supposed to be racist when we pick a business to patronize?", "score": 0, "created_utc": 1612669430, "company": "google"}, {"body": "Why. Wtf yo.", "score": 1, "created_utc": 1612668938, "company": "google"}, {"body": "Latest teachers jobs in sindh govt 2021", "score": 0, "created_utc": 1612668540, "company": "google"}, {"body": "FIX THIS PLS TY", "score": 0, "created_utc": 1612668425, "company": "google"}, {"body": "why are you displaying nazi pictures on a recipe?", "score": 0, "created_utc": 1612668245, "company": "google"}, {"body": "DESERVING WINNER RUBINA", "score": 0, "created_utc": 1612666510, "company": "google"}, {"body": "DESERVING WINNER RUBINA", "score": 0, "created_utc": 1612666497, "company": "google"}, {"body": "DESERVING WINNER RUBINA", "score": 1, "created_utc": 1612666487, "company": "google"}, {"body": "DESERVING WINNER RUBINA", "score": 2, "created_utc": 1612666478, "company": "google"}, {"body": "DESERVING WINNER RUBINA", "score": 0, "created_utc": 1612666473, "company": "google"}, {"body": "DESERVING WINNER RUBINA", "score": 0, "created_utc": 1612666463, "company": "google"}, {"body": "DESERVING WINNER RUBINA", "score": 1, "created_utc": 1612666459, "company": "google"}, {"body": "DESERVING WINNER RUBINA", "score": 2, "created_utc": 1612666451, "company": "google"}, {"body": "DESERVING WINNER RUBINA", "score": 0, "created_utc": 1612666447, "company": "google"}, {"body": "DESERVING WINNER RUBINA", "score": 1, "created_utc": 1612666437, "company": "google"}, {"body": "DESERVING WINNER RUBINA", "score": 2, "created_utc": 1612666431, "company": "google"}, {"body": "DESERVING WINNER RUBINA", "score": 0, "created_utc": 1612666413, "company": "google"}, {"body": "DESERVING WINNER RUBINA", "score": 1, "created_utc": 1612666407, "company": "google"}, {"body": "DESERVING WINNER RUBINA", "score": 0, "created_utc": 1612666402, "company": "google"}, {"body": "DESERVING WINNER RUBINA", "score": 0, "created_utc": 1612666398, "company": "google"}, {"body": "DESERVING WINNER RUBINA", "score": 1, "created_utc": 1612666394, "company": "google"}, {"body": "DESERVING WINNER RUBINA", "score": 0, "created_utc": 1612666386, "company": "google"}, {"body": "DESERVING WINNER RUBINA", "score": 0, "created_utc": 1612666381, "company": "google"}, {"body": "DESERVING WINNER RUBINA", "score": 0, "created_utc": 1612666376, "company": "google"}, {"body": "DESERVING WINNER RUBINA", "score": 0, "created_utc": 1612666372, "company": "google"}, {"body": "DESERVING WINNER RUBINA", "score": 1, "created_utc": 1612666368, "company": "google"}, {"body": "DESERVING WINNER RUBINA", "score": 1, "created_utc": 1612666364, "company": "google"}, {"body": "DESERVING WINNER RUBINA", "score": 2, "created_utc": 1612666358, "company": "google"}, {"body": "DESERVING WINNER RUBINA", "score": 1, "created_utc": 1612666339, "company": "google"}, {"body": "DESERVING WINNER RUBINA", "score": 0, "created_utc": 1612666335, "company": "google"}, {"body": "DESERVING WINNER RUBINA", "score": 0, "created_utc": 1612666330, "company": "google"}, {"body": "DESERVING WINNER RUBINA", "score": 2, "created_utc": 1612666325, "company": "google"}, {"body": "DESERVING WINNER RUBINA", "score": 1, "created_utc": 1612666319, "company": "google"}, {"body": "DESERVING WINNER RUBINA", "score": 3, "created_utc": 1612666309, "company": "google"}, {"body": "DESERVING WINNER RUBINA", "score": 1, "created_utc": 1612666297, "company": "google"}, {"body": "DESERVING WINNER RUBINA", "score": 3, "created_utc": 1612666286, "company": "google"}, {"body": "why cant I search \"COVID\" in the app store??? It redirect me to search Google instead??? #android #COVID19", "score": 0, "created_utc": 1612665882, "company": "google"}, {"body": "I have reset my mobile phone and forgot my password I have access to the registered mobile number but not access to the added email so pls remove the added email so that I can reset my password", "score": 0, "created_utc": 1612665373, "company": "google"}, {"body": "TAFE Former deputy lord mayor Arron Wood lands senior job with Bendigo Kangan TAFE - The Mercury", "score": 0, "created_utc": 1612665215, "company": "google"}, {"body": "Get your shiz together!! #DragRaceUK", "score": 0, "created_utc": 1612664451, "company": "google"}, {"body": "you know well and good that I meant what I typed owl #SuperbOwl", "score": 2, "created_utc": 1612664333, "company": "google"}, {"body": "Also I had taken into Google Account Community and asked, them... they just ignored me.", "score": 0, "created_utc": 1612663287, "company": "google"}, {"body": "Hello Google, so sorry I didn't respond! So I would like to recover an old google account which is linked to my hotmail account but since the hotmail account I can't get into because the email no longer exists on Hotmail. Microsoft couldn't help.", "score": 2, "created_utc": 1612663265, "company": "google"}, {"body": "can I have an option to snooze my notifications on my pixel or archive them until the end of my day? Sometimes I get too overwhelmed to look at my notif but I don't want it to go away forever u know I still wanna come back to the things I missed", "score": 1, "created_utc": 1612662682, "company": "google"}, {"body": "and Twitter are unamerican companies who illegally interfered in our elections - We must do everything in power to destroy their businesses.", "score": 0, "created_utc": 1612662545, "company": "google"}, {"body": "why there is no live tv or on now tab on android tv like that in fire os and patch wall..", "score": 0, "created_utc": 1612661657, "company": "google"}, {"body": "gboard on Ios is far more customizable compared to Android. Why? Will Android users get the same lvl of customization in the future or not ?", "score": 0, "created_utc": 1612661463, "company": "google"}, {"body": "What about white owned businesses?", "score": 0, "created_utc": 1612661274, "company": "google"}, {"body": "If u owned minecraft. What whold u do google. To minecraft (i hate microsoft)", "score": 0, "created_utc": 1612660794, "company": "google"}, {"body": "Interesting you post about this, Google. Silicon Valley likes to claim they are so invested in businesses owned by people of color and also by women of color. But their actions don't match their words.", "score": 3, "created_utc": 1612660702, "company": "google"}, {"body": "What the f eggplant tomato kkk I just saw are you serious face_with_monocle flushed_face flushed_face exploding_head exploding_head face_with_open_mouth face_with_open_mouth google,, What are you doing google what an racist stupid ad is this are you guys losing your mind,, face_with_open_mouth face_with_open_mouth what about the other colors you don't support them stupid", "score": 2, "created_utc": 1612658621, "company": "google"}, {"body": "Please add python language", "score": 0, "created_utc": 1612658184, "company": "google"}, {"body": "TAFE I'd been dreaming of going to Tafe. When it finally happened I was nearly in tears | Emmanuel Asante - The Guardian", "score": 0, "created_utc": 1612657988, "company": "google"}, {"body": "TAFE TAFE NSW horticulture students propagate and donate native plants to Eurobodalla Shire - About Regional", "score": 1, "created_utc": 1612657987, "company": "google"}, {"body": "Lebhah? How many people even know what this is? (Yes, I know what it is and it makes a great dip). Seriously, grilled cheese for WV? Now way, that should be pepperoni rolls!", "score": 0, "created_utc": 1612657311, "company": "google"}, {"body": "#engineers leave the company over controversial exit of top #AI #ethicist", "score": 0, "created_utc": 1612657202, "company": "google"}, {"body": "take google forms away from stays pls", "score": 0, "created_utc": 1612655266, "company": "google"}, {"body": "can you increase ads in YouTube both in duration and in frequency. Sometimes I can't find ad to click on. Also other times 15 sec. disappeared so fast that I can't click on the ad. Show me ads and I'll make sure that I'll click on each and every single one them.", "score": 1, "created_utc": 1612654854, "company": "google"}, {"body": "Using skin color is racist", "score": 1, "created_utc": 1612653610, "company": "google"}, {"body": "Are they both owners??Are they both black? If not, I guess white doesn't count.", "score": 0, "created_utc": 1612652922, "company": "google"}, {"body": "Can you check with your translation team to find how pmo ()and sumo () match ??? Just to let you know . Pmo is Prime Minister of India.", "score": 0, "created_utc": 1612652445, "company": "google"}, {"body": "I look forward to support &amp; cooperation to pursue career.", "score": 0, "created_utc": 1612651534, "company": "google"}, {"body": "I can help", "score": 0, "created_utc": 1612651112, "company": "google"}, {"body": "show rubina is the winner. DESERVING WINNER RUBINA", "score": 0, "created_utc": 1612649647, "company": "google"}, {"body": "yalls account recovery is probably the worst I've ever seen", "score": 0, "created_utc": 1612649406, "company": "google"}, {"body": "Hello Google (Google Team) I just got my phone reset some time ago, but after resetting, when I tried to login my email id, it is unable to do, but I forgot the password of my id but I recover I have entered the phone number but I have not entered my recover e-mail id.", "score": 1, "created_utc": 1612649375, "company": "google"}, {"body": "Hello Google (Google Team) I just got my phone reset some time ago, but after resetting, when I tried to login my email id, it is unable to do, but I forgot the password of my id but I recover I have entered the phone number but I have not entered my recover e-mail id", "score": 1, "created_utc": 1612648922, "company": "google"}, {"body": "BUZZ LIGHTNING GET IT RIGHT MF", "score": 0, "created_utc": 1612648685, "company": "google"}, {"body": "Would it be racist if the ad read, it's easier than ever to find &amp; support white-owned businesses?", "score": 0, "created_utc": 1612648183, "company": "google"}, {"body": "Using skin color is racist", "score": 0, "created_utc": 1612647980, "company": "google"}, {"body": "I can't message in any way in direct message. My problem has not been solved yet. Please be sure to fix the problem as soon as possible.", "score": 0, "created_utc": 1612647945, "company": "google"}, {"body": "Please help me get my Gmail account back when I try to reset password it tells me that handle does not exist and then when I try to create an email with that handle it says already exists I'm at my wit's end with this", "score": 0, "created_utc": 1612647858, "company": "google"}, {"body": "Google team I need your help. For the last week I'm trying to reach to you.I've forgotten my account password and tried to login back and got the message \"Google couldn't sign you in\". Can you please DM me so that i can share the screenshots. Please help", "score": 0, "created_utc": 1612647732, "company": "google"}, {"body": "I can't still access google earth", "score": 0, "created_utc": 1612647664, "company": "google"}, {"body": "I hate you. Why do you make adding apps, not from Google play so hard", "score": 0, "created_utc": 1612647201, "company": "google"}, {"body": "my gmail account password is loss in my memory please recover my Gmail account and you tube chenal name karnveer yadav please help me sir folded_hands", "score": 2, "created_utc": 1612645682, "company": "google"}, {"body": "you gave me a form in DM to fill but no response from more than 5months. Google could not verify my account from june 2019. Please help this account is so worthy for me.", "score": 1, "created_utc": 1612645183, "company": "google"}, {"body": "Why isn't Fake woke not number 1 search result when i google Tom MacDonald? Are you trying to cancel the song?", "score": 0, "created_utc": 1612643686, "company": "google"}, {"body": "Wait...she's black?", "score": 0, "created_utc": 1612643582, "company": "google"}, {"body": "help you Will help me singn into my bank account go2bank", "score": 0, "created_utc": 1612643402, "company": "google"}, {"body": "But I can't DM you.", "score": 0, "created_utc": 1612643274, "company": "google"}, {"body": "If an ad has minority owned women owned or any virtue signaling in it I'm not buying anything there because that means they don't have a product with the merit to sell itself. I just want a quality product for a reasonable price I don't care about your politics or race", "score": 0, "created_utc": 1612642558, "company": "google"}, {"body": "I enabled my Google account to be two step verification. And after that I reset my phone. And now I am not able to login to my account even though I have a registered phone number", "score": 0, "created_utc": 1612641930, "company": "google"}, {"body": "Who cares what color their skin is - the BBQ has to be great . That is what will be the draw", "score": 0, "created_utc": 1612641053, "company": "google"}, {"body": "can someone please help me. I can't get into any of my accounts because I accidentally signed out. And you're not letting me recover them. Please DM Me", "score": 0, "created_utc": 1612641049, "company": "google"}, {"body": "But of course, all that Black success is just more proof of systemic white racism according to the DC leftists and its propaganda media.", "score": 0, "created_utc": 1612641036, "company": "google"}, {"body": "I won't loss my gmail account. Google team help me. I have trouble two step verification. Help me please", "score": 0, "created_utc": 1612640950, "company": "google"}, {"body": "This is complete nonsense. Marketing bullshit. Capitalism is in collapse get a clue", "score": 0, "created_utc": 1612640780, "company": "google"}, {"body": "Why did you ban Kanwar Grewal ? Did he do a content breach or a copyright breach ? If none, then you have to stand up to the fascist Indian government and restore the account. Do the same that you would have done in US.", "score": 0, "created_utc": 1612640688, "company": "google"}, {"body": "It's showing we couldn't sign in you ? Help Please Few days back you reach to me but after that didnt get any reply from your side.", "score": 0, "created_utc": 1612640213, "company": "google"}, {"body": "I wonder when you're going to support small business and local manufacturing .This nonsense of promoting a minority owned business is simply that nonsense. If they have good service good pricing and good product they'll get business if they don't they won't.", "score": 1, "created_utc": 1612639918, "company": "google"}, {"body": "Did you changed the spacing on the searching engine or is it just me? How do I fix it?", "score": 0, "created_utc": 1612639598, "company": "google"}, {"body": "Make sure you support white &amp; spanish owned businesses too... Anything else just sounds racist.", "score": 2, "created_utc": 1612638561, "company": "google"}, {"body": "disappointed! I 'upgraded' my YT Music to YouTube Premium for 14.99 and today I was told this was a trial and had ended. No indication it was a trial when I signed up (attached). No indication on confirmation email (attached). And nothing sent to say trial ending.", "score": 0, "created_utc": 1612637838, "company": "google"}, {"body": "Waoo Google me trump from my country I need 30 millions $ I give you back after my investisment 13wLjaTfVnwUSAGLXA9xdwT84z8yw9qiso My BTC count blockchain", "score": 0, "created_utc": 1612637162, "company": "google"}, {"body": "Dear Google this is not a black owned business if its 50% white face_with_rolling_eyes face_with_rolling_eyes face_with_rolling_eyes face_with_rolling_eyes Couldve just promoted as a regualar business.", "score": 0, "created_utc": 1612636553, "company": "google"}, {"body": "After update Google map app not show route location why???", "score": 0, "created_utc": 1612636170, "company": "google"}, {"body": "I am not able to reset my google password. Please give me the password reset link. This is coming again and again despise doing the whole recovery process continued from 5 month I am real Owner of this account your recovery process is not working properly in my problem", "score": 1, "created_utc": 1612635696, "company": "google"}, {"body": "Hey google, This actor is alive and doing great. Please rectify all details please.", "score": 2, "created_utc": 1612635010, "company": "google"}, {"body": "I understand that the Australian Govt, munted nutters that they are are trying to force you to pay the likes of Murdoch, I don't have the advertising funds to place articles re Murdoch in everyone's feeds, but I do suggest you get creative with his billing", "score": 0, "created_utc": 1612634224, "company": "google"}, {"body": "I will be so grateful when color of skin does not matter", "score": 1, "created_utc": 1612633563, "company": "google"}, {"body": "I want this clip !", "score": 0, "created_utc": 1612633414, "company": "google"}, {"body": "are you for the #dogecoin? #DogecoinToTheMoon #helpthelittleguy", "score": 4, "created_utc": 1612633239, "company": "google"}, {"body": "Hey! I have a problem ) My gmail account was banned. I couldn't get it back. I logged in google classroom in high school(different pc in school) and then it got banned. There is no security question enabled or anything so recovery doesn't work. please contact me", "score": 1, "created_utc": 1612632777, "company": "google"}, {"body": "Larry buy the house quickly and build something grand. Don't forget to compensate me a little something.", "score": 0, "created_utc": 1612632770, "company": "google"}, {"body": "Probably won't stay up in very long and do the coronavirus lockdowns now will it", "score": 0, "created_utc": 1612632298, "company": "google"}, {"body": "Oh God white people have discovered lebneh. More cultural appropriation.", "score": 0, "created_utc": 1612632009, "company": "google"}, {"body": "Sir, we are from Kolkata.And our family is very poor. Plz help me sir Give me any jobs in india my qualifications is Higher Secondary (10+2) My family and my child Is in trouble Because I have no jobs .My contact number 7003701320", "score": 0, "created_utc": 1612631447, "company": "google"}, {"body": "Speaker Pelosi -Went to the salon when the rest of us couldn't. -Didn't wear a mask when the rest of us had to. -Avoids the medal detectors when the rest of us can't. Double standards. Again", "score": 0, "created_utc": 1612631352, "company": "google"}, {"body": "please restore Senator Johnson's account immediately. And apologize.", "score": 0, "created_utc": 1612631029, "company": "google"}, {"body": "no disrespect. Blame he taught he thats the word you use when you don't know em personally rolling_on_the_floor_laughing", "score": 0, "created_utc": 1612630893, "company": "google"}, {"body": "In Great Depression of the 30s, black unemployment was lower than that of whites. What changed? THE WAR AGAINST POVERTY. It wrecked the black family.", "score": 0, "created_utc": 1612630871, "company": "google"}, {"body": "Racist", "score": 2, "created_utc": 1612630747, "company": "google"}, {"body": "Leave RACE OUT OF IT support AMERICAN", "score": 0, "created_utc": 1612630418, "company": "google"}, {"body": "I glad that i found in my young age. It's completely changed my life. Thanks Google", "score": 0, "created_utc": 1612630332, "company": "google"}, {"body": "Black-owned? Aren't you a MIXED-OWNED business?", "score": 0, "created_utc": 1612629612, "company": "google"}, {"body": "closing their music platform and making us migrate our music to is the biggest shitshow since Abbott was elected. Total crap!", "score": 1, "created_utc": 1612628466, "company": "google"}, {"body": "my gmail was hacked for the THIRD TIME and now I cant get back in. There's no option to sign my account out of the other device either so cheers for that.", "score": 9, "created_utc": 1612628242, "company": "google"}, {"body": "changed their font on their search page and it is tripping me out.", "score": 0, "created_utc": 1612628080, "company": "google"}, {"body": "I just was informed that my credit card info was stolen and used I had just used my card at but for less then the amount they informed me of I had just uses the first link on Google search that said ad that's the only way they could of got my info", "score": 2, "created_utc": 1612627918, "company": "google"}, {"body": "no one can solve my issue, 1 month waiting my order....", "score": 1, "created_utc": 1612627676, "company": "google"}, {"body": "I know there's an ulterior motive for making it so hard to just delete messages... maybe I'm ignorant. But default to archive(across platforms and companies seems opposite of good. Didn't want to say nefarious, but I couldn't think of a better term.", "score": 1, "created_utc": 1612627669, "company": "google"}, {"body": "Maps for the win for these 2nd graders as we visit the Ponce Inlet Lighthouse. Next stop Statue of Liberty. #CCEstem #ottersmatter", "score": 0, "created_utc": 1612626636, "company": "google"}, {"body": "Hello", "score": 0, "created_utc": 1612626558, "company": "google"}, {"body": "Looks like that \"black owned\" sales pitch bit you right on the black ass", "score": 0, "created_utc": 1612626547, "company": "google"}, {"body": "I will be affected by a terrible psychological impact ..... ??Cartoon House ..... satellite monitoring And hacking on the network of lights .... lighting and extinguishing ............ etc. Algeria ???? Not even an American ... ??? pimp??? Just an immigrant ......", "score": 0, "created_utc": 1612626269, "company": "google"}, {"body": "Thats so rascist", "score": 0, "created_utc": 1612625903, "company": "google"}, {"body": "Good it's about time", "score": 0, "created_utc": 1612625652, "company": "google"}, {"body": "President Trump helped many.", "score": 2, "created_utc": 1612625409, "company": "google"}, {"body": "I prefer White owned business.", "score": 1, "created_utc": 1612625053, "company": "google"}, {"body": "Since when is chili a side dish?", "score": 0, "created_utc": 1612624553, "company": "google"}, {"body": "Racist much?", "score": 0, "created_utc": 1612624298, "company": "google"}, {"body": "How racist", "score": 0, "created_utc": 1612624236, "company": "google"}, {"body": "how do you reach a person to help with email issues? Have tried to reach a person for 2 days. PLEASE someone reach out to me.", "score": 0, "created_utc": 1612624084, "company": "google"}, {"body": "can you confirm the popularity of \"chia seed coconut milk dessert\"?", "score": 1, "created_utc": 1612623952, "company": "google"}, {"body": "I will support no effort that makes itself about race. Race is completely irrelevant in a society whose focus is unity as in E pluribus unum -- out of the many, one --which has long been the motto of these UNITED States. Focusing on race takes us backward, divides us, reduces us.", "score": 0, "created_utc": 1612623591, "company": "google"}, {"body": "your bot detector is too damn sensitive please fix it.", "score": 0, "created_utc": 1612623227, "company": "google"}, {"body": "Tomorrow Sunday at 2PM mountain time?", "score": 0, "created_utc": 1612623064, "company": "google"}, {"body": "Wow never thought of looking for BBQ based on the race of the owner. I've never cared before. I just wanted great BBQ.", "score": 30, "created_utc": 1612623017, "company": "google"}, {"body": "please, include an anti-NSFW search function.", "score": 0, "created_utc": 1612622958, "company": "google"}, {"body": "What are you ppl searching? Some of these #foods I've never heard of! What's #charcuterieboard!? face_with_raised_eyebrow", "score": 0, "created_utc": 1612622950, "company": "google"}, {"body": "How about focusing on product and customer service, and stop being racist.", "score": 0, "created_utc": 1612622918, "company": "google"}, {"body": "Hi guys, I'm still waiting. If you could be so kind as to reach out to me, I would be grateful. I got my hopes up and really don't want to have them come crashing down again. Thank you red_heart", "score": 0, "created_utc": 1612622407, "company": "google"}, {"body": "She doesn't look black so do I order half from here and half from somewhere else?", "score": 1, "created_utc": 1612622204, "company": "google"}, {"body": "Not only does everyone in Iowa want crab rangoon, they're spelling it wrong with incredible consistency.", "score": 1, "created_utc": 1612622058, "company": "google"}, {"body": "has killed great work idiots", "score": 0, "created_utc": 1612621839, "company": "google"}, {"body": "why the fuck did you discontinue cloud print?", "score": 0, "created_utc": 1612621793, "company": "google"}, {"body": "The ever cosmopolitan Ohio and West Virginia", "score": 0, "created_utc": 1612620982, "company": "google"}, {"body": "Fix your search results spacing. It's garbage.", "score": 0, "created_utc": 1612620007, "company": "google"}, {"body": "\"To combat racism, I only support green people businesses,\" sneared the ridiculous person without any sense of self awareness.", "score": 3, "created_utc": 1612619959, "company": "google"}, {"body": "you gonna give us Tall Non-Tab view back for Android Chrome?", "score": 1, "created_utc": 1612619276, "company": "google"}, {"body": "Larry Page I still haven't been paid for my work getting you the Mandesmorium. $250,000.00", "score": 0, "created_utc": 1612618994, "company": "google"}, {"body": "If you can find the ones you did not help shut down for political reasons, sure!", "score": 0, "created_utc": 1612618784, "company": "google"}, {"body": "Someone ask Bernie about pork chow mein in Vermont face_with_raised_eyebrow", "score": 0, "created_utc": 1612618279, "company": "google"}, {"body": "seems to be fooling your search engine... Not sure what this site is for....", "score": 0, "created_utc": 1612618214, "company": "google"}, {"body": "for use your photos as wallpaper stock in their next flagship coz hot_face sign_of_the_horns_medium_skin_tone #googlepixel", "score": 14, "created_utc": 1612618160, "company": "google"}, {"body": "did dirty for this. Tighten up especially during Black History Month", "score": 2, "created_utc": 1612617692, "company": "google"}, {"body": "you show \"Processing Payment\" for 48hr. As these are instant payments,in such scenarios user need to pay Cash.If after X hrs,Google pay is successful then that becomes Duplicate.Shouldn't you keep a timeout?So user can either pay cash or pay from other source", "score": 0, "created_utc": 1612617660, "company": "google"}, {"body": "I am seriously questioning Montana's listed preference...Keto egg bites? face_with_tears_of_joy", "score": 3, "created_utc": 1612617456, "company": "google"}, {"body": "thank you for singing me happy birthday", "score": 0, "created_utc": 1612617355, "company": "google"}, {"body": "I give up", "score": 0, "created_utc": 1612617340, "company": "google"}, {"body": "Where is the prawn suit in subnautica", "score": 0, "created_utc": 1612617323, "company": "google"}, {"body": "Subnautica prawn suit location", "score": 0, "created_utc": 1612617301, "company": "google"}, {"body": "Prawn suit location subnautica", "score": 0, "created_utc": 1612617284, "company": "google"}, {"body": "ah, come on....I don't think there is ANY overlap in football watching Oklahomans and even a slum idea of what charcuterie is, let alone the ability to spell it", "score": 0, "created_utc": 1612617243, "company": "google"}, {"body": "i am the last person to ask anything about this i don't know anything about Twitter does anyone want this for $2.3 million tax free 3128413163", "score": 0, "created_utc": 1612617232, "company": "google"}, {"body": "Sure, I can see chicken wings in Michigan. But Wagyu beef in Arkansas? Charcuterie board in Oklahoma?", "score": 0, "created_utc": 1612617229, "company": "google"}, {"body": "i feel disgusted owning $goog stock here.", "score": 1, "created_utc": 1612616817, "company": "google"}, {"body": "Support small business no matter the skin color.", "score": 23, "created_utc": 1612616437, "company": "google"}, {"body": "Wagyu Beef in Arkansas? They are 49th in medium household income. I doubt the accuracy of this chart.", "score": 0, "created_utc": 1612616032, "company": "google"}, {"body": "This is racist. Imagine Search White Owned Stop playing into this stupidity. Let's look at Character.", "score": 0, "created_utc": 1612615865, "company": "google"}, {"body": "Illinois does not Cajun Boil.", "score": 0, "created_utc": 1612615491, "company": "google"}, {"body": "Another way to promote segregation", "score": 0, "created_utc": 1612615228, "company": "google"}, {"body": "Go away", "score": 0, "created_utc": 1612614927, "company": "google"}, {"body": "slide show in full screen not showing to audience in googlemeet. Has to shareeitherentire screen or slude show within window. Using it for months now but from lastweek facing the issue. #googlemeet", "score": 0, "created_utc": 1612614841, "company": "google"}, {"body": "Cuban sandwich in PA? Sorry Google. You got punked.", "score": 0, "created_utc": 1612614797, "company": "google"}, {"body": "thank you for scheduled sends #saturdays", "score": 0, "created_utc": 1612614754, "company": "google"}, {"body": "Montana and Mississippi went full blown coastal elitism winking_face", "score": 0, "created_utc": 1612614683, "company": "google"}, {"body": "This is bullshit. As a native of Hawaii and a resident of California I can tell you neither of these is true. They just randomly picked a food that exists in each place.", "score": 0, "created_utc": 1612614553, "company": "google"}, {"body": "I ordered a new pixel 5 almost 2 weeks ago. showed it was out for delivery 3 different days but I still have no phone. I've called Google 3 times with no resolution. Yesterday a supervisor was to call me back but no one ever did. Not acceptable!", "score": 2, "created_utc": 1612614479, "company": "google"}, {"body": "This just in GOOGLE IS RACIST! No kidding...", "score": 0, "created_utc": 1612614186, "company": "google"}, {"body": "Support a business just because of the color of the owners skin is racist. How about just \"Support ALL small business\"?", "score": 0, "created_utc": 1612613993, "company": "google"}, {"body": "what is being done about Google Classroom security issues? My son's account has been hacked and used to send messages.", "score": 2, "created_utc": 1612613698, "company": "google"}, {"body": "Who the hell needs a recipe to make nachos?", "score": 0, "created_utc": 1612613556, "company": "google"}, {"body": "As an Indiana native, I imagine everyone is googling Charcuterie because they have no idea what it is.", "score": 0, "created_utc": 1612613457, "company": "google"}, {"body": "Cuban Sandwich in PA? Chia seed coconut milk dessert in WY? I call bullsh*t on this data.", "score": 0, "created_utc": 1612613076, "company": "google"}, {"body": "I really don't care what race a business owner might be. If they are friendly, have quality goods and stand behind their products with great service I'm giving them my business.", "score": 0, "created_utc": 1612612966, "company": "google"}, {"body": "... so much wrong in a single Tweet.", "score": 2, "created_utc": 1612612958, "company": "google"}, {"body": "And what about hispanic owned? Asian owned? Indian owned?? Please stop with the racism! Blocked and reporting this promoted post as spam content", "score": 8, "created_utc": 1612612837, "company": "google"}, {"body": "Sounds like something the KKK would have come up with. Seems racist to me. A fine dining establishment would have been a better example than a stereotypical BBQ joint.", "score": 0, "created_utc": 1612612834, "company": "google"}, {"body": "Chocolate chip cookies in Texas?! Likes-BBQ or Queso. And there's no way Cuban sandwiches top a steak salad in Pa", "score": 0, "created_utc": 1612612694, "company": "google"}, {"body": "Buying something from someone just because of the color of your skin is nothing but racism. It suggests what leftists always believe about black people, leftists believe black people can't make it on their own merits. I believe anybody can make it if they work hard", "score": 0, "created_utc": 1612612679, "company": "google"}, {"body": "Why you still not updating iOS apps? Its over 2 months since last update. Should I ditch your services after about 10 years because I am not feeling save to use it anymore when you deliberately delaying updates? What about security?", "score": 2, "created_utc": 1612612415, "company": "google"}, {"body": "To register at the weseling company, you can register directly in this link", "score": 0, "created_utc": 1612612335, "company": "google"}, {"body": "Labneh in NE?? What the bloody hell is going on?", "score": 1, "created_utc": 1612612232, "company": "google"}, {"body": "I lived in NM for 8 yrs, never once ate, or even heard anyone mention a Cuban sandwich. Wth?", "score": 0, "created_utc": 1612612203, "company": "google"}, {"body": "WHY is everything about skin color to you people???? I don't know ANYONE who gives a damn about the color of anybody's skin!", "score": 0, "created_utc": 1612611380, "company": "google"}, {"body": "can we expect another city with google fiber added in another 4 years? Literally everyone I know would do anything to be able to get google fiber. The market is waiting for you. What are you waiting for?", "score": 0, "created_utc": 1612611282, "company": "google"}, {"body": "Giving honest reviews for visited places is a very risky thing today. Got threatened to be blacklisted from getting job in the state, because of a 3 star review. If this is how ratings are taken then what's the point?", "score": 0, "created_utc": 1612611101, "company": "google"}, {"body": "dear could you please help, Unfortunately Google couldn't verify that account is belong to you!!", "score": 0, "created_utc": 1612610877, "company": "google"}, {"body": "I should be able to report ads that promote fake science", "score": 0, "created_utc": 1612610680, "company": "google"}, {"body": "Why Google, why?!?!", "score": 0, "created_utc": 1612610474, "company": "google"}, {"body": "#updates #broad #match #modifier will be phased out as part of the change. The changes will start rolling out in upcoming weeks (1 or 2). #adspolitan #digitalmarketing #services", "score": 0, "created_utc": 1612610280, "company": "google"}, {"body": "Spamwhich", "score": 0, "created_utc": 1612610268, "company": "google"}, {"body": "Am I the only one that has no clue as to what a birria taco is made of?", "score": 0, "created_utc": 1612610109, "company": "google"}, {"body": "No way is West Virginia charcuterie board. They have to have something more like cocktail wieners.", "score": 0, "created_utc": 1612610100, "company": "google"}, {"body": "I call bullshit on 90% of what I see here", "score": 2, "created_utc": 1612609851, "company": "google"}, {"body": "If I were to solely support black owned businesses, doesn't that make me racist ? How about I support local businesses that do good?", "score": 0, "created_utc": 1612609838, "company": "google"}, {"body": "Does New Hampshire not know the Super Bowl is happening?", "score": 0, "created_utc": 1612609704, "company": "google"}, {"body": "I cannot understand why I'm unable to access my Gmail (with correct username/password). Why is there additional security features when entering the correct information? I need access to my Gmail account asap. Thank you", "score": 0, "created_utc": 1612609501, "company": "google"}, {"body": "In years past, the Google search home page has celebrated Black History Month. Why not in 2021?", "score": 0, "created_utc": 1612609389, "company": "google"}, {"body": "There is so much wrong with Hawaiian BBQ Chicken as a food'. Starting the the generic nature of the title. No locals ever say these words.", "score": 0, "created_utc": 1612609278, "company": "google"}, {"body": "I call bullshit on Keto anything in Montana!", "score": 0, "created_utc": 1612609126, "company": "google"}, {"body": "Seriously?? Chocolate Chip Cookies in Texas?? I don't think so. More like Wings, Chili, Pizza, Tacos, Sliders, Jalapeno Poppers, Chips, and lots of Beer. Now, we're ready for some football!!", "score": 0, "created_utc": 1612609038, "company": "google"}, {"body": "San Diego=fish tacos...come on", "score": 0, "created_utc": 1612608941, "company": "google"}, {"body": "Nah I think I'll be supporting White-owned businesses.", "score": 0, "created_utc": 1612608906, "company": "google"}, {"body": "Be like a fuckin ocean of cuban sandwiches in this PA household for the big game.....", "score": 2, "created_utc": 1612608666, "company": "google"}, {"body": "urgent information", "score": 7, "created_utc": 1612608663, "company": "google"}, {"body": "Yeah I call B.S. Who thinks the favorite game day snack in Texas is chocolate chip cookies?", "score": 0, "created_utc": 1612608284, "company": "google"}, {"body": "Inspired #Spruit Merchandise by at Letshoho Shopping Centre #EMABHODWENI #Katlehong #Spruit #Spyland #K1", "score": 14, "created_utc": 1612608150, "company": "google"}, {"body": "I'm no expert but I don't think anyone in Montana is eating Keto Egg Bites.", "score": 4, "created_utc": 1612608113, "company": "google"}, {"body": "I think they got Colorado and Wyoming swapped", "score": 0, "created_utc": 1612608017, "company": "google"}, {"body": "Keto egg bites?", "score": 0, "created_utc": 1612607972, "company": "google"}, {"body": "include multiple font colours on \"fit\". Put in pace instead of \"heart points\". Give the option of saving picture without sharing to other platforms.", "score": 0, "created_utc": 1612607912, "company": "google"}, {"body": "I refuse to believe that Texas was not focused on some meat or queso-based food", "score": 1, "created_utc": 1612607888, "company": "google"}, {"body": "I'm from mississippi and I have NO IDEA what birria tacos are...", "score": 1, "created_utc": 1612607680, "company": "google"}, {"body": "What is going on in rugged individual country Montana? Keto egg bites??", "score": 2, "created_utc": 1612607584, "company": "google"}, {"body": "No one in Wyoming eats anything with Chai seeds.", "score": 1, "created_utc": 1612607578, "company": "google"}, {"body": "Uhh Montana and Wyoming?", "score": 1, "created_utc": 1612607570, "company": "google"}, {"body": "Wait, PA - Cuban Sandwich? I love 'em, but not sure about this one.", "score": 1, "created_utc": 1612607564, "company": "google"}, {"body": "to bad they didn't spend as much time on taking control of big tech. CANCEL amazon and prime CANCEL FB and scrub it clean CANCEL apple itunes,iphones and i everything CANCEL google browser and go to firefox CANCEL twitter, oops cant cause they banned the alternative. CANCEL cnn", "score": 0, "created_utc": 1612607440, "company": "google"}, {"body": "Zero chance the preferred super bowl treat for Oregon is pasta fagioli.", "score": 11, "created_utc": 1612607415, "company": "google"}, {"body": "I can guarantee they aren't eating Chia Seed Coconut Milk Dessert in Wyoming.", "score": 15, "created_utc": 1612607358, "company": "google"}]}