{"data": [{"body": "If you have any issue at all with your greendot account concerning stimulus or any other please message this account", "score": 0, "created_utc": 1612840016, "company": "samsung"}, {"body": "If you have any issue at all with your greendot account concerning stimulus or any other please message this account", "score": 0, "created_utc": 1612840008, "company": "samsung"}, {"body": "If you have any issue at all with your greendot account concerning stimulus or any other please message this account", "score": 0, "created_utc": 1612840000, "company": "samsung"}, {"body": "get onboard with #btc like You don't want to be last!", "score": 0, "created_utc": 1612837079, "company": "samsung"}, {"body": "Worst service i have ever experienced. they opened their service centers to harrass customers. They only know how to make money from their customers? #worstservice #cheapqualityproducts", "score": 0, "created_utc": 1612836066, "company": "samsung"}, {"body": "I think you should make rechargeable remotes for your tv docking station or charger pad", "score": 0, "created_utc": 1612834616, "company": "samsung"}, {"body": "Why don't u try to avoid copying Apple first!", "score": 0, "created_utc": 1612833786, "company": "samsung"}, {"body": "the Samsung Galaxy s20FE 5G.......Split screen multitasking, Pop up notifications, a fan-damn-tastic camera. This phone is Spectacularly AWESOME", "score": 0, "created_utc": 1612832562, "company": "samsung"}, {"body": "we want to talk senior authority regarding microwave repair but no response.", "score": 0, "created_utc": 1612831136, "company": "samsung"}, {"body": "very poor pathetic service...daily I'm trying to call customer care but microwave part is not available.. same answer poor service and nobody is concerned about customer", "score": 0, "created_utc": 1612830840, "company": "samsung"}, {"body": "sooo I just got the Galaxy Buds Pro yesterday and I'm LOVING them. Just have ONE request The voice detect feature; is it in ANY WAY possible to have it NOT detect when I'm singing along with the music I'm playing? I don't wanna have Ambient More on during karaoke! xD", "score": 3, "created_utc": 1612829592, "company": "samsung"}, {"body": "this new update is horrible. Please please go back to the old way.", "score": 0, "created_utc": 1612824560, "company": "samsung"}, {"body": "Why don't you add any of those features to the phone from Galaxy S8 and S9 And of course the s10,,S20,S21", "score": 0, "created_utc": 1612824017, "company": "samsung"}, {"body": "Why don't you bring any of those phone padur", "score": 0, "created_utc": 1612823907, "company": "samsung"}, {"body": "Why not be Microsoft and re create the windows phone since you like to copy Other companies so much", "score": 1, "created_utc": 1612823857, "company": "samsung"}, {"body": "Next thing you know Samsung will be copying google and LG with those phones stop trying to be something you are not and that you will never be if u copy them and like them so much why don't u work for them Seing ur using Apple emojis as well anyways", "score": 1, "created_utc": 1612823824, "company": "samsung"}, {"body": "Call me please I want to inform to samsung his partner service center scam and thief with samsung my contac number 7007183460 and 9935882424 his service center in uttar pradesh pin code 232101 this service center is thief his service center always wrong and theif", "score": 0, "created_utc": 1612823652, "company": "samsung"}, {"body": "And tis", "score": 1, "created_utc": 1612823450, "company": "samsung"}, {"body": "Wtf do you guys copy apple no charger in the phone box wtf and no notch my but look at this", "score": 2, "created_utc": 1612823278, "company": "samsung"}, {"body": "Wtf is this not copying apple my ass content //com.android.chrome.FileProvider/images/screenshot/16128499569253198531953368647043.jpg And this content //com.android.chrome.FileProvider/images/screenshot/16128502426891549013195210620816.jpg Wtf not copying apple my ass.", "score": 0, "created_utc": 1612821543, "company": "samsung"}, {"body": "dissapointed by quality of High End Refrigerators of Samsung. In Just few years of Manufacturing defect showed up and Samsung has no remidy...", "score": 2, "created_utc": 1612821063, "company": "samsung"}, {"body": "Keep the SD Card SD Card Slot on the next Note and keep making the Note series!", "score": 1, "created_utc": 1612820690, "company": "samsung"}, {"body": "Did You All Roll Out An Update For The Series 7s Yet?", "score": 0, "created_utc": 1612820082, "company": "samsung"}, {"body": "I don't get enjoyment from my 5yr old Samsung TV. Quite the opposite. Find it frustrating when I hit the source button and just get a blue bar without it bringing up the actual sources. Or the clumsy system you designed for watching stuff recorded to a usb stick.", "score": 0, "created_utc": 1612819903, "company": "samsung"}, {"body": "2021 Once again, Kwon, Chairman Samsung rightfully behind bars min 2 yrs convicted of cheating fraud etc. Imagine state of Samsung since few years (1st time Leaders jailed 2016). No attention to quality or service Samsung suffers, &amp; makes its customers suffer.", "score": 0, "created_utc": 1612811022, "company": "samsung"}, {"body": "2021 Once again, Kwon, Chairman Samsung rightfully behind bars min 2 yrs convicted of cheating fraud etc. Imagine state of Samsung since few years (1st time Leaders jailed 2016). No attention to quality or service Samsung suffers, &amp; makes its customers suffer.", "score": 0, "created_utc": 1612810993, "company": "samsung"}, {"body": "trying to buy a Samsung phone on the Samsung website using my Sprint account is impossible. Support has not been able to help. Is there someone who can? It's been 9 days of back and forth. HELP", "score": 1, "created_utc": 1612805980, "company": "samsung"}, {"body": "Hi I have been looking for the S21 Ultra Laser Sensor type/characteristics (Laser Class and Safety for Eyes) but are missing in the User and Safety Manuals and and don't knoe either. Could you help me? Thanks!!", "score": 0, "created_utc": 1612804180, "company": "samsung"}, {"body": "= Android", "score": 0, "created_utc": 1612803776, "company": "samsung"}, {"body": "make #dogecoin possible for payment for Samsung products folded_hands", "score": 0, "created_utc": 1612795785, "company": "samsung"}, {"body": "your new update sucks! I don't want a black dot where my camera is.", "score": 0, "created_utc": 1612795233, "company": "samsung"}, {"body": "Your products are rubbish. Had enough of them. They either die of motherboard failure or just go bad. Would be so nice to actually be able to change the input source but no just the blue bar", "score": 2, "created_utc": 1612784904, "company": "samsung"}, {"body": "I am Come At Valsad service Center(Gujarat,India) for my Samsung U flax Bluetooth replacement but last 1 month he is not proper answer. he is provide not proper answer in ther side.And service Center pick my product without any JobSheet. Kindly Help My Problem", "score": 0, "created_utc": 1612781764, "company": "samsung"}, {"body": "I shouldn't need to download a third party app just to crop a video", "score": 0, "created_utc": 1612781219, "company": "samsung"}, {"body": "Credibility crisis products &amp; services.Awaiting replacement of within warranty #DefectiveSamsungGalaxy since 185 days.Service extort even from within warranty defect by flimsy excuses just to make out of warranty. Blot on", "score": 0, "created_utc": 1612778536, "company": "samsung"}, {"body": "Credibility crisis products &amp; services.Awaiting replacement of within warranty #DefectiveSamsungGalaxy since 185 days.Service extort even from within warranty defect by flimsy excuses just to make out of warranty. Blot on", "score": 0, "created_utc": 1612778500, "company": "samsung"}, {"body": "The S21 Ultra is by far the best looking phone that has ever been made. I absolutely love my phone. Thank you Samsung, for this is a work of art.", "score": 0, "created_utc": 1612778278, "company": "samsung"}, {"body": "this is how you give service to your customer.", "score": 3, "created_utc": 1612777678, "company": "samsung"}, {"body": "Not gud service and poor quality phone", "score": 0, "created_utc": 1612773207, "company": "samsung"}, {"body": ".I became a victim because of this phone.Sometimes not getting a call , nternet disconnect although it looks 4.5g.Repaired twice.I was left without a phone ten days.Please help me. +905073630663 Yavuz Selim Cetin", "score": 0, "created_utc": 1612767205, "company": "samsung"}, {"body": "Samsung galaxy note 10 lite is defective a mobile phone. Samsung turkey and authorized services aren't interested with my problem.There is network problem on my mobile phone but authorized services always reset my phone and send me.they are very indifferent.", "score": 0, "created_utc": 1612767180, "company": "samsung"}, {"body": "thanks for making it stressful for me not able to transfer apps to my SD Card on Galaxy A01 never knew it was for photos and videos only.", "score": 0, "created_utc": 1612766543, "company": "samsung"}, {"body": "Dear executives, stop harassing us since the last 2 months, build a TV but till now cannot be repaired.... what kind of service are you people having... Provide a solution soon...situation is really harsh now", "score": 2, "created_utc": 1612766052, "company": "samsung"}, {"body": "Why do your ice makers suck?", "score": 0, "created_utc": 1612763538, "company": "samsung"}, {"body": "Samsung Italy you buy an S21 on Samsung shop and after 20 days you have no news, great disappointment.", "score": 0, "created_utc": 1612761223, "company": "samsung"}, {"body": "I bought a tv model qe43ls03tauxxu. The wall mount doesn't have the fixing screws for a plasterboard wall - parts F and G. I have been informed that these are not supplied with this model. Can you explain why this is and what is the possibility of getting these parts?", "score": 0, "created_utc": 1612759485, "company": "samsung"}, {"body": "Plastic back shouldn't be standard in your next series of flagship. Use WQHD+ resolution and glass back in all three S series next year. Bring back more curved screens because the flat ones looks soo cheap. S10 series curves are perfect. Take an example of S10 series they were smiling_face_with_hearts", "score": 0, "created_utc": 1612759300, "company": "samsung"}, {"body": "And do not kill Note series yet. You foldables are far away from Note series here in Europe. Nobody want's to buy your foldables here, too pricy and usless.", "score": 0, "created_utc": 1612759083, "company": "samsung"}, {"body": "With non expandable storage sadly. pouting_face pouting_face face_with_symbols_on_mouth Bring back micro SD card otherwise you will lost more of your loyal customers!!!", "score": 0, "created_utc": 1612758977, "company": "samsung"}, {"body": "Never sell your products on flipkart ad they only deal with Defective refurbished and non returnable products #BoycottFlipkart&amp;Samsung", "score": 1, "created_utc": 1612755369, "company": "samsung"}, {"body": "has announced the much anticipated Galaxy S21. mobile_phone Lets have a look at how its predecessor the S20+ 5G, has performed! Read the full review on our website... battery #ViserMark#testing#ViserMarkLabel #batterylife#batteriefaible#testautomatique#Samsung", "score": 0, "created_utc": 1612753218, "company": "samsung"}, {"body": "Hi, I own the soundbar, HWK550 &amp; yesterday bought the SWA8500S speakers, but cannot get them to pair. I realise now that the compatible speakers are the SWA8000S, but these are no longer available. Will a firmware upgrade enable connection please?", "score": 0, "created_utc": 1612751751, "company": "samsung"}, {"body": "Thank you so much for bringing a new feature for cochlear implant users. normally this feature was only available on iphone. today is the happiest day of my life !! I can now listen to music through the hearing aid. thank you so much !! you made me my day! I'm crying loudly_crying_face red_heart", "score": 2, "created_utc": 1612751444, "company": "samsung"}, {"body": "hi, I've traded my old phone in but haven't received the pack. It has been 9 days and wondered when I will receive the pack? I've had no replies to my emails, text chat or anything. Not happy", "score": 0, "created_utc": 1612750136, "company": "samsung"}, {"body": "Keep the SD Card Slot on the next Note and keep making the Note series!", "score": 1, "created_utc": 1612747569, "company": "samsung"}, {"body": "I want to lay a complaint,I bought a Samsung smart TV in September last year at makro strubbans Valley in roodepoort, the TV was faulty, they gave me an exchange, the exchange was faulty,I went back and forth with Samsung customer care", "score": 3, "created_utc": 1612742543, "company": "samsung"}, {"body": "Useless service of Samsung. My refrigerator is not working and despite of several complaints no response from company.", "score": 0, "created_utc": 1612741685, "company": "samsung"}, {"body": "Hi Samsung, As I know Samsung is very reputed company to provide great services to the customer, but I'm suffering from this because for last few days my washing machine is not working and still I'm waiting for support.", "score": 3, "created_utc": 1612741367, "company": "samsung"}, {"body": "how do you turn the song off at the end of the wash cycle on a WA50R5200AW/US. I mean come on. That's ridiculous long and unnecessary.", "score": 1, "created_utc": 1612727674, "company": "samsung"}, {"body": "my smart TV will not connect to the internet anymore. Any suggestions? I reset everything. My WiFi is not the problem only the TV won't connect. Won't connect to my hotspot either. Do they burn out after a year?", "score": 1, "created_utc": 1612727165, "company": "samsung"}, {"body": "If you've been #watching... I can do the same I could do for transports for your phones. I could work as an #independantcontractor My fee is #20percent of the profits from what I figure out for you, and you #lease my #patents", "score": 1, "created_utc": 1612722578, "company": "samsung"}, {"body": "I bought a pair of earbuds and they are Buds Live. Any chance you can make custom size for me since I'm 26 and the ears of a child. My earbuds hurt my ears because they are too big for me.", "score": 0, "created_utc": 1612717983, "company": "samsung"}, {"body": "Cons of Galaxy S21 [ cross_mark ] does not support external memory card", "score": 0, "created_utc": 1612716186, "company": "samsung"}, {"body": "it looks better this way.", "score": 0, "created_utc": 1612712704, "company": "samsung"}, {"body": "every update makes me hate your phones even more. Why can't you leave it alone. Now I can't find old ring tone. What a piece of garbage.", "score": 0, "created_utc": 1612708916, "company": "samsung"}, {"body": "Not gud service for samsung", "score": 1, "created_utc": 1612692962, "company": "samsung"}, {"body": "I am Come At Valsad service Center for my Samsung U flax Bluetooth replacement but last 1 month he is not proper answer. he is provide not proper answer in ther side.And service Center pick my product without any Job Sheet. Kindly Help My Problem", "score": 1, "created_utc": 1612688832, "company": "samsung"}, {"body": "Why is the auto switch feature availavle only across samsung devices? Very disappointing I cannot auto switch with my laptop during working from home", "score": 0, "created_utc": 1612678899, "company": "samsung"}, {"body": "As an Indian, I take an oath that after today I will not buy any #Samsung product nor recommend anyone to buy. I boycott all samsung products. Until samsung stops discriminating against Indian customers. #BoycottSamsung #BoycottExynos", "score": 0, "created_utc": 1612676734, "company": "samsung"}, {"body": "for the cost of a 7+, just the tablet, I can get a gaming laptop that does 10x more or a Microsoft surface that does 10x more. Why would anyone spend over $800 on your tablet?", "score": 0, "created_utc": 1612675716, "company": "samsung"}, {"body": "As an Indian, I take an oath that after today I will not buy any Samsung product nor recommend anyone to buy. I boycott all Samsung products. Until Samsung stops discriminating against Indian customers. #BoycottSamsung #BoycottExynos", "score": 0, "created_utc": 1612673454, "company": "samsung"}, {"body": "Galaxy Wearable last update was Fucked frowning_face frowning_face", "score": 1, "created_utc": 1612672931, "company": "samsung"}, {"body": "#SamsungGalaxyS215GSeries Min Aung Hlaing's daughter, Khin Thiri Thet Mon, owns Seventh Sense, a media production business that makes big budget films and has exclusive contracts with Nay Toe!", "score": 0, "created_utc": 1612668015, "company": "samsung"}, {"body": "#SamsungGalaxyS21Series5G should suspend Collabortion with #Myanmar mega movie star #NayToe, who has been silient in #myanmarmilitarycoup. He has exclusive contract with Khin Thiri Thet Mon, a US targeted sanctioned who owns Seventh Sense, a media production business.", "score": 0, "created_utc": 1612667935, "company": "samsung"}, {"body": "Hey guys, I don't get prompted to use Google Assistant and the TV says it's fully up to date. Can't find manual updates either.", "score": 2, "created_utc": 1612666877, "company": "samsung"}, {"body": "GALAXY Check out Our new #Android #App #OZOOApps", "score": 0, "created_utc": 1612656703, "company": "samsung"}, {"body": "I have Ultra 21+ and it has a big issue and the agent's Saudi refuses to replace it I bought it on Juanuary 30", "score": 0, "created_utc": 1612656014, "company": "samsung"}, {"body": "It's incredible", "score": 0, "created_utc": 1612654293, "company": "samsung"}, {"body": "filters are beautiful. My rings in the black and white filter just takes my breath away. #ValenciaSM21 #blackandwhite", "score": 1, "created_utc": 1612637550, "company": "samsung"}, {"body": "u guys funny for mocking apple then taking the same route as them lol", "score": 0, "created_utc": 1612633411, "company": "samsung"}, {"body": "when will my tv samsung un55mu63od get Apple TV AirPlay?", "score": 0, "created_utc": 1612631069, "company": "samsung"}, {"body": "It's an atrocity that you don't have the app on your smart TVs. Please fix this. Please.", "score": 0, "created_utc": 1612629463, "company": "samsung"}, {"body": "Can u update s voice she doesn't respond when I launch it or hit the microphone button or with voice wake up and it's on the latest version wtf lol can u bring s voice to s8 and above plz thanks that would greatly be appreciated thanks", "score": 0, "created_utc": 1612629009, "company": "samsung"}, {"body": "when will there be a tino rangatiratanga flag available on your emoji keyboard? i don't want to use the nz flag.", "score": 0, "created_utc": 1612628452, "company": "samsung"}, {"body": "I'm still hoping you will make it right and replace my range that was only 3 weeks old with multiple broken components and needs a new mother board. This is a fire hazard and clearly defective.", "score": 0, "created_utc": 1612619461, "company": "samsung"}, {"body": "know how #security works! Cripple account security to keep older devices running thumbs_up", "score": 0, "created_utc": 1612618162, "company": "samsung"}, {"body": "i want my old lockscreen back, couldn't you have a choice not to change the entire look of the phone when updating loudly_crying_face", "score": 1, "created_utc": 1612618161, "company": "samsung"}, {"body": "Phones are doing well for Africans than can you believe that?", "score": 0, "created_utc": 1612617804, "company": "samsung"}, {"body": "broken TV that was less than 28 days old! Still no replacement a month later. Worst customer service ever!!!! Lockdown 2 kids no TV for them while we work from home. No bitesize revision or Joe wicks! Emailed and live chat no support! chargeback &amp; new TV now!", "score": 0, "created_utc": 1612617188, "company": "samsung"}, {"body": "happy to take my money but not help !!!", "score": 0, "created_utc": 1612612075, "company": "samsung"}, {"body": "The amount if features will never offset how poorly your customers are treated. Absolutely the worst company out there for how customers are treated. Will never buy one of your terrible products again.", "score": 2, "created_utc": 1612609603, "company": "samsung"}, {"body": "Does Samsung also makes hearing devices?", "score": 0, "created_utc": 1612609261, "company": "samsung"}, {"body": "just see how irritating this sound is.. in the middle of night..! I don't know where to contact so i just try to contact you here.. it's just 1 year old fridge.. hope you help soon.. Thanks red_heart", "score": 0, "created_utc": 1612607878, "company": "samsung"}, {"body": "customer support is the best. They were helping prepare a refund for hubs missing earbuds so we could order another pair. Then a kind, honest person that his earbuds got delivered to brought them to us. Now Samsung support is working hard to help fix everything", "score": 1, "created_utc": 1612607568, "company": "samsung"}, {"body": "please integrate the Theta protocol in Samsung TVs. I have two and I want to earn $TFUEL while I watch Samsung+. There's millions of users waiting for it! And you save money on CDN costs, everybody wins! $THETA", "score": 2, "created_utc": 1612603533, "company": "samsung"}, {"body": "This a disastrous experience Samsung... Digital zoom between 6-7x in auto mode. Yes the light condition isn't the best, but serious look at this", "score": 1, "created_utc": 1612603009, "company": "samsung"}, {"body": "please you have to correct this urgently! This photo was taken with the digital zoom of the #SamsungGalaxyS21Ultra mode auto, between 6-7x. A complete disaster.", "score": 0, "created_utc": 1612602846, "company": "samsung"}, {"body": "launched LED back cover for Samsung galaxy S21+ #SamsungGalaxyS21 #Samsung", "score": 0, "created_utc": 1612601081, "company": "samsung"}, {"body": "I have Samsung TV model code UA46E8000R SN LFPP3DLD200028V with a spoiled screen how much will it cost to repair", "score": 0, "created_utc": 1612600699, "company": "samsung"}, {"body": "Might as well invite them as your ambassadors? They have 277k followers here!!! star-struck #MOMOLANDXCHROMANCE #WrapMeInPlastic", "score": 60, "created_utc": 1612600509, "company": "samsung"}, {"body": "I have a Galaxy Tab S3, that I use intermittently now. How to I change settings so I don't recieve a notifications for things received whilst the device is turned off? Thank you", "score": 0, "created_utc": 1612596403, "company": "samsung"}, {"body": "why do u suck", "score": 0, "created_utc": 1612589766, "company": "samsung"}, {"body": "Pathetic quality or mobile inspection, service head team. Listed around 10 visible issues, but still saying that device is perfectly fine and no technical issues. Approaching consumer court", "score": 2, "created_utc": 1612587300, "company": "samsung"}, {"body": "Hey, turns out snoring apparently counts as human voice and sleeping within a foot of my wife means the #BudsPro quiet my music I'm using to drown her out. Please update this if that's possible? Sincerely, someone who's been awake 2 hours now.", "score": 0, "created_utc": 1612586583, "company": "samsung"}, {"body": "Totally damage help", "score": 0, "created_utc": 1612586412, "company": "samsung"}, {"body": "Check check &amp; recheck products &amp; services. Awaiting replacement of #DefectiveSamsungGalaxy within warranty since 183 days. Service extorts even from within warranty defect by flimsy excuses just to make out of warranty. Blot on brand", "score": 0, "created_utc": 1612585802, "company": "samsung"}, {"body": "Check check &amp; recheck products &amp; services. Awaiting replacement of #DefectiveSamsungGalaxy within warranty since 183 days. Service extorts even from within warranty defect by flimsy excuses just to make out of warranty. Blot on brand", "score": 0, "created_utc": 1612585698, "company": "samsung"}, {"body": "Check check &amp; recheck products &amp; services. Awaiting replacement of #DefectiveSamsungGalaxy within warranty since 183 days. Service extorts even from within warranty defect by flimsy excuses just to make out of warranty. Blot on brand", "score": 0, "created_utc": 1612585672, "company": "samsung"}, {"body": "Check check &amp; recheck products &amp; services. Awaiting replacement of #DefectiveSamsungGalaxy within warranty since 183 days. Service extorts even from within warranty defect by flimsy excuses just to make out of warranty. Blot on brand", "score": 0, "created_utc": 1612585646, "company": "samsung"}, {"body": "Just upgraded to #GalaxyS21 and there is no outlet plug &amp; the cord is type A so does NOT fit in standard type B USB port that is available at every airport, airline and hotel. Also charging &amp; audio from same jack which sucks on a plane. These are pile_of_poo features.", "score": 0, "created_utc": 1612584377, "company": "samsung"}, {"body": "the new low cost control button you are using for un32m4500bf lacks functionality, it is clumsily designed with no consideration for the time it wastes for users.", "score": 0, "created_utc": 1612584139, "company": "samsung"}, {"body": "Electronics Co Ltd is considering Austin, Texas, as one of the sites for a new $17 billion chip plant that the South Korean firm said could create 1,800 jobs. #Samsung #Austin #Texas", "score": 0, "created_utc": 1612576812, "company": "samsung"}, {"body": "not impressed. Had a microwave for less than two years and it's broken because I opened the door. Proof it's less than two years coz ur sticker on the back is only just from two years ago. Any chance you'll replace it?", "score": 0, "created_utc": 1612573528, "company": "samsung"}, {"body": "I do not want unwanted apps everytime I update my phone. U idiots pouting_face pouting_face ...I have paid money for the device, haven't took it for free!!!", "score": 0, "created_utc": 1612572652, "company": "samsung"}, {"body": "SAMSUNG India is selling defective refurbished, non repairable and non returnable, products, you will be forced to visit Samsung service till warranty is expired. #SamsungUselessRefurbishedProducts.service ref no 4315916463", "score": 0, "created_utc": 1612562362, "company": "samsung"}, {"body": "SAMSUNG India is selling defective refurbished, non repairable and non returnable, products, you will be forced to visit Samsung service till warranty is expired. #SamsungUselessRefurbishedProducts.service ref no 4315916463", "score": 0, "created_utc": 1612562262, "company": "samsung"}, {"body": "hear me out let us be in a group chat with apple phone AND be allowed to name the groupchat", "score": 0, "created_utc": 1612562067, "company": "samsung"}, {"body": "Flipkart and Samsung keep trapping by showing offers sale discounts these are trap to clear their defective refurbished and useless products. Fraudulent business by Samsung and flipkart. Todat is 110 day of purchase.", "score": 0, "created_utc": 1612560867, "company": "samsung"}, {"body": "Flipkart and Samsung keep trapping by showing offers sale discounts these are trap to clear their defective refurbished products. Today is 110 day of purchase Samsung not able to provide solution Service ref no 4315916463.", "score": 1, "created_utc": 1612560496, "company": "samsung"}, {"body": "be better to your dealers! Why is it so hard to return a damaged tv?? If it's damaged you should pay for the shipping!!", "score": 0, "created_utc": 1612547648, "company": "samsung"}, {"body": "how about i report for duty next week monday?", "score": 0, "created_utc": 1612546547, "company": "samsung"}, {"body": "any comments?", "score": 0, "created_utc": 1612539081, "company": "samsung"}, {"body": "bought a 65inch tv and didn't turn on from day 1. Had two service calls, countless calls with Samsung Canada and I still don't have a working tv. The customer service is horrible. Unbelievable.", "score": 0, "created_utc": 1612537294, "company": "samsung"}, {"body": "make a plug the fits either way.", "score": 0, "created_utc": 1612533258, "company": "samsung"}, {"body": "I want the new one! come on flip 3 relieved_face", "score": 0, "created_utc": 1612529681, "company": "samsung"}, {"body": "Since I'm a skater/YouTuber my epic moment with the Samsung Galaxy s21 I would take really dope pics of the places I skate &amp; film at and Film awesome cinematic 8k videos of my cool skate tricks", "score": 0, "created_utc": 1612529458, "company": "samsung"}, {"body": "supervisor just asked me how I suppose liquid got in my watch? Hahahaha! That was MY question. But I'm learning that apparently pretty much every watch that gets sent in \"has liquid damage\" and isn't covered. #samsung #fail", "score": 0, "created_utc": 1612528136, "company": "samsung"}, {"body": "rep just informed me that their warranty is worthless. Apparently their water-resistant devices are not humidity-resistant.", "score": 0, "created_utc": 1612526841, "company": "samsung"}, {"body": "my s21 ultra is overheating when using the camera is this expected or normal? I'm not the only one experience it. is it just European version of the phone with issues", "score": 2, "created_utc": 1612522061, "company": "samsung"}, {"body": "Blood pressure was to be released yesterday according to your latest press release. In these times we need to keep track. Release ASAP!", "score": 0, "created_utc": 1612520119, "company": "samsung"}, {"body": "is looking for tax breaks before they'll build in a community. Tax sharing is something for the peons in society and not price gouging corporations.", "score": 0, "created_utc": 1612515022, "company": "samsung"}, {"body": "Hello! Nigerian customers can't fix Samsung TV when screens go bad? It normally comes more expensive than buying new one. I have sent email to for 3 days without reply. What is the fate of Samsung customers?", "score": 0, "created_utc": 1612509800, "company": "samsung"}, {"body": "is it possible to connect #GalaxyBudsLive with a PC and a smartphone *at the same time* ? Thanks.", "score": 0, "created_utc": 1612508243, "company": "samsung"}, {"body": "Plz respond and help your fans Why isnt galaxy tab s7+ not available i. Saudi arabia ? We need to know why", "score": 0, "created_utc": 1612504183, "company": "samsung"}, {"body": "Stop copying apple and put expandable storage and chargers back in S series we shouldnt have pay extra for a charger why mock someone then copy them stick with my s10+ till yall put micro card and chargers back", "score": 0, "created_utc": 1612501314, "company": "samsung"}, {"body": "Model plz", "score": 0, "created_utc": 1612498412, "company": "samsung"}, {"body": "I bought a phone in may '20 and on same network when i use (side by side) I can watch a 10 min YouTube vid in 12mins with redmi phone while it takes 16min on my M307F samsung. Very bad n/w pickup. Can U help?", "score": 0, "created_utc": 1612497969, "company": "samsung"}, {"body": "Samsung 24 inch (60.4 cm) IPS, 3 Side Bezel Less Flat LED Monitor (Dark Blue Gray) 75 Hz - LS24R356FHWXXL At just $123 or Rs. 8999 Link to buy", "score": 0, "created_utc": 1612494743, "company": "samsung"}, {"body": "Samsung 24 inch (60.4 cm) IPS, 3 Side Bezel Less Flat LED Monitor (Dark Blue Gray) 75 Hz - LS24R356FHWXXL At just $123 or Rs. 8999 Link to buy", "score": 0, "created_utc": 1612494732, "company": "samsung"}, {"body": "Samsung 24 inch (60.4 cm) IPS, 3 Side Bezel Less Flat LED Monitor (Dark Blue Gray) 75 Hz - LS24R356FHWXXL At just $123 or Rs. 8999 Link to buy", "score": 0, "created_utc": 1612494722, "company": "samsung"}, {"body": "Samsung 24 inch (60.4 cm) IPS, 3 Side Bezel Less Flat LED Monitor (Dark Blue Gray) 75 Hz - LS24R356FHWXXL At just $123 or Rs. 8999 Link to buy", "score": 0, "created_utc": 1612494712, "company": "samsung"}, {"body": "Samsung 24 inch (60.4 cm) IPS, 3 Side Bezel Less Flat LED Monitor (Dark Blue Gray) 75 Hz - LS24R356FHWXXL At just $123 or Rs. 8999 Link to buy", "score": 0, "created_utc": 1612494702, "company": "samsung"}, {"body": "Samsung 24 inch (60.4 cm) IPS, 3 Side Bezel Less Flat LED Monitor (Dark Blue Gray) 75 Hz - LS24R356FHWXXL At just $123 or Rs. 8999 Link to buy", "score": 0, "created_utc": 1612494693, "company": "samsung"}, {"body": "Samsung 24 inch (60.4 cm) IPS, 3 Side Bezel Less Flat LED Monitor (Dark Blue Gray) 75 Hz - LS24R356FHWXXL At just $123 or Rs. 8999 Link to buy", "score": 0, "created_utc": 1612494685, "company": "samsung"}, {"body": "Hi there. I love Samsung products,but why not Samsung send varieties in various products in Pakistan i.e Samsung Smart led TV T5300 in 40 inches, available in 43\".Very sad Samsung.Similarly in case of Android Mobiles.why??????", "score": 0, "created_utc": 1612492884, "company": "samsung"}, {"body": "Keep the SD Card Slot on the next Note and keep making the Note series!", "score": 0, "created_utc": 1612490960, "company": "samsung"}, {"body": "Please folded_hands pleading_face support watch this video Ideal", "score": 0, "created_utc": 1612488971, "company": "samsung"}, {"body": "Not gonna lie they pre view picture is a bit akward", "score": 0, "created_utc": 1612482686, "company": "samsung"}, {"body": "Keep the SD Card Slot on the next Note and keep making the Note series!", "score": 1, "created_utc": 1612481860, "company": "samsung"}, {"body": "hi, how can i get you guys to gift me #TheSero tv? i just seen it on tiktok and i'd love to have one.", "score": 0, "created_utc": 1612481087, "company": "samsung"}, {"body": "considers Austin for $17 billion chip plant, eyes tax breaks of at least $806 million - documents #WorldMarket #SamsungElectronicsCo", "score": 1, "created_utc": 1612474920, "company": "samsung"}, {"body": "Keep the SD Card Slot on the next Note and keep making the Note series!", "score": 2, "created_utc": 1612474213, "company": "samsung"}, {"body": "Samsung = Cheats --- Can you trust any company with Leaders are habitual cheaters?", "score": 0, "created_utc": 1612473671, "company": "samsung"}, {"body": "Samsung = Cheats --- Can you trust any company with Leaders are habitual cheaters?", "score": 0, "created_utc": 1612473657, "company": "samsung"}, {"body": "y'all better not be cancelling this year's note series #samsunggalaxy #samaunggalaxyS21", "score": 0, "created_utc": 1612465367, "company": "samsung"}, {"body": "Subscribe my channel", "score": 0, "created_utc": 1612464640, "company": "samsung"}, {"body": "This recent update makes picture-in-picture mode for apps like Google Maps, YouTube, and Netflix useless. Attempting to relocate them doesn't work, closing them still plays the audio, and switching apps causes my phone to go into a seizure", "score": 0, "created_utc": 1612463919, "company": "samsung"}, {"body": "wants $1 billion tax incentive for new #Austin plant that would create 1,800 jobs via", "score": 0, "created_utc": 1612463142, "company": "samsung"}, {"body": "I made an order since 20th January. Until now Nothing also bad responce through your call center", "score": 2, "created_utc": 1612459308, "company": "samsung"}, {"body": "I preordered the S21 ultra and Samsung cancelled my order for no reason and I did try chasing the customer service agents, but had no luck. Wrote to upper management they too gave me the cold shoulder. You have lost a faithful galaxy user!!", "score": 1, "created_utc": 1612456404, "company": "samsung"}, {"body": "So, I invested in your ultra quiet washer and dryer. Ironically, to turn the sound \"Off\" for its end of wash or dry cycle, it makes a very audible beeping noise. Thanks for that. Morons; just when I get the nephew to sleep too. Thanks.", "score": 0, "created_utc": 1612451328, "company": "samsung"}, {"body": "Good", "score": 0, "created_utc": 1612448889, "company": "samsung"}, {"body": "I just bought a Samsung smart tv. I was extremely disappointed that I could not get the peacock tv app on this tv. Why is that?", "score": 0, "created_utc": 1612446941, "company": "samsung"}, {"body": "Can you make a microwave that will heat up my food, not my plate?", "score": 2, "created_utc": 1612442280, "company": "samsung"}, {"body": "bought a new washer machine two months ago. Contacted support because of an issue. said they couldn't fix it would refund us. Then they sent a check for half of the purchase price, and lied saying we agreed to that amount when we did not.", "score": 2, "created_utc": 1612442099, "company": "samsung"}, {"body": "- if you create a product that has multiple components broken and needs a new mother board in its 1ST 3 WEEKS of ownership- you need to take accountability and replace it!!!", "score": 0, "created_utc": 1612436034, "company": "samsung"}, {"body": "product warranty continues. Can you help me?", "score": 0, "created_utc": 1612431921, "company": "samsung"}, {"body": "aint gotta worry about me buying another product from them", "score": 0, "created_utc": 1612431043, "company": "samsung"}, {"body": "Buy our DRONE QUADCOPTER WITH GPS. Shop Now #GroundhogDay #HATvFB #CalaABocaDoria #AsagiBakmayacagiz #PunxsutawneyPhil #DevletiminYanindayim #Gustavo #AsagiBakmayacagiz", "score": 0, "created_utc": 1612423578, "company": "samsung"}, {"body": "Thanks for making my galaxy A10e. It feels like a iphone 10 but only 10th the price", "score": 0, "created_utc": 1612420800, "company": "samsung"}, {"body": "2-3M dogs are tortured Every Year for 'men's' 'potions'- that science proved work the opposite as intended. -Boycott Hyundai Kia Samsung LG until this barbarity ends. Only country that farms dogs. STRONG people HELP all life. -Pls speak up", "score": 0, "created_utc": 1612420591, "company": "samsung"}, {"body": "hey can you help in getting the Samsung recovery solution", "score": 0, "created_utc": 1612420544, "company": "samsung"}, {"body": "As you celebrate the bond of marriage, wishing you a life of love and togetherness today and always.", "score": 1, "created_utc": 1612412743, "company": "samsung"}, {"body": "If your friend does not irritate you at times, then it is not genuine friendship.", "score": 0, "created_utc": 1612407971, "company": "samsung"}, {"body": "Big sucker for a sweetheart with brown eyes.", "score": 0, "created_utc": 1612407060, "company": "samsung"}, {"body": "The galaxy3 watch is dangerous! Your product has burnt my wrist and now left a scar! have called me today and offered me just a refund of my watch, for $38 less than what I paid for it!!! Your product has left me with injury and you offer a refund!!??", "score": 0, "created_utc": 1612405565, "company": "samsung"}, {"body": "A friendship that can end never really began !", "score": 0, "created_utc": 1612404720, "company": "samsung"}, {"body": "Some more stuff youve snuck on a phone?", "score": 0, "created_utc": 1612401745, "company": "samsung"}, {"body": "Seriously worth watching See this guys .. what's the matter", "score": 0, "created_utc": 1612401418, "company": "samsung"}, {"body": "The S21 is too expensive and the most shocking thing is you DO NOT GET A PLUG for charging but ONLY A LEAD!", "score": 0, "created_utc": 1612401386, "company": "samsung"}, {"body": "sir myself chandrashi from hyderabad Telangana state India I'm excited sales manager of f Phillips electronics for Andhra Pradesh and Telangana States for 6 years then I worked for T series electronics for 4 present working with organic electronics past 3 9502073722", "score": 0, "created_utc": 1612400930, "company": "samsung"}, {"body": "If I could pick the best brother, I would pick you.", "score": 0, "created_utc": 1612400603, "company": "samsung"}, {"body": "Lets fill our home with prayers and lights not with fumes and crackers", "score": 0, "created_utc": 1612400049, "company": "samsung"}, {"body": "New Telugu Horror Short Film Teaser Out Now fire backhand_index_pointing_down backhand_index_pointing_down backhand_index_pointing_down backhand_index_pointing_down backhand_index_pointing_down backhand_index_pointing_down backhand_index_pointing_down backhand_index_pointing_down backhand_index_pointing_down", "score": 0, "created_utc": 1612400045, "company": "samsung"}, {"body": "Hi, samsung pay does not work in Saudi Arabia! Can you please support?", "score": 2, "created_utc": 1612398837, "company": "samsung"}, {"body": "I thought the cashback offer will be as smooth as you mentioned it would but this seems to be a different case now.", "score": 1, "created_utc": 1612397168, "company": "samsung"}, {"body": "A true friend is someone who never gets tried of listening to your pointless dramas over and over again.", "score": 0, "created_utc": 1612396485, "company": "samsung"}, {"body": "I absolutely LOVE my #SamsungGalaxyS21 two_hearts the screen is so clear and it's definitely living up to the ads! Glad I had the trade up program and I'm glad I traded up smiling_face_with_smiling_eyes", "score": 0, "created_utc": 1612396407, "company": "samsung"}, {"body": "Sometimes I'm too scared to look into your beautiful eyes cause i don't want to fall even more in love with you.", "score": 0, "created_utc": 1612395758, "company": "samsung"}, {"body": "How about a similar tag for your ASCs - at the least you can track their hanky-panky first-hand and real time instead of waiting for them to frustrate and swindle customers ensuring that they don't buy your products at all.", "score": 0, "created_utc": 1612394139, "company": "samsung"}, {"body": "I've been waiting for at least 2 months for someone to contact me from your products team. Appalling service.", "score": 0, "created_utc": 1612393736, "company": "samsung"}, {"body": "northeast Indian boys react tumme jo maine dhekha song parody by vina fan parody video is super amazing n our reaction also gone super duper u should watch our reaction on this video Thanks for watching our video", "score": 0, "created_utc": 1612393485, "company": "samsung"}, {"body": "Check out Shivam thakur please follow me I give 100% follow back. It's my new account. Please retweet l support and like your ideology. thumbs_up Retweete", "score": 1, "created_utc": 1612393418, "company": "samsung"}, {"body": "It's very disappointing the kind of after service you people are providing. At the time of collecting money you report exactly within 2 hours. Without resolving issue you take money and then never return to complete the work even though it is under waranty.", "score": 0, "created_utc": 1612388786, "company": "samsung"}, {"body": "Being brother &amp; sister means being there for each other.", "score": 0, "created_utc": 1612387567, "company": "samsung"}, {"body": "WHEN MY BROTHER WITH ME, I WON'T AFRAID.", "score": 0, "created_utc": 1612384902, "company": "samsung"}, {"body": "Hey folks! Don't believe Samsung when they promise to replace your broken TV. They will drag the process out and not deliver on their promise. Garbage customer service and straight up liars.", "score": 0, "created_utc": 1612383501, "company": "samsung"}, {"body": "Just make a Note with MicroSD slot, 3.5mm socket, and no Bixby button. Oh and, I don't know, try designing it so the glass is subdued from the edge, so I don't need a phone case that doubles the thickness, and a metal back plate, so I don't have to worry about that.", "score": 0, "created_utc": 1612382821, "company": "samsung"}, {"body": "I'd rather have honest enemies than fake friends.", "score": 0, "created_utc": 1612381741, "company": "samsung"}, {"body": "After providing a pre-installed sceen protector on both the Galaxy S10 and S20 series I'm very disappointed to see that the new Galaxy S21 does not include one. This was a huge bonus to not have to spend extra money on a 3rd party protector and worry about installing it.", "score": 0, "created_utc": 1612381321, "company": "samsung"}, {"body": "iphone. aquarius is zodiac sign enjoy technology and scientific", "score": 0, "created_utc": 1612381091, "company": "samsung"}, {"body": "this is how your #customersupport Head - Prasant Kumar Sinha shares contact on email. Can you see? And btw if you figure it out 0120-3705031 Ext 41280, try calling - no one will pick!! Real crooks!! Horrendous #customerservice", "score": 0, "created_utc": 1612380961, "company": "samsung"}, {"body": "Rihanna's tweet in support to Indian farmers made me wonder, who does Indians support? Farmers? Or HitlerG aka ModG? Don't forget SabG is always more important than SaabG.", "score": 0, "created_utc": 1612380909, "company": "samsung"}, {"body": "Wandering alone [Memories of the East Sea] Relaxing piano music, Sleep music, Stress relief", "score": 0, "created_utc": 1612379199, "company": "samsung"}, {"body": "Fake News", "score": 0, "created_utc": 1612379083, "company": "samsung"}, {"body": "New Telugu Horror Short Film Teaser Out Now fire backhand_index_pointing_down backhand_index_pointing_down backhand_index_pointing_down backhand_index_pointing_down backhand_index_pointing_down backhand_index_pointing_down backhand_index_pointing_down backhand_index_pointing_down backhand_index_pointing_down .", "score": 0, "created_utc": 1612377413, "company": "samsung"}, {"body": "please help me figure out why my TV has been updating for 3 days. PLEASE. I've tried everything. I disconnected power, I force quit, literally nothing will interrupt this update worried_face", "score": 3, "created_utc": 1612376764, "company": "samsung"}, {"body": "Noted.", "score": 0, "created_utc": 1612375712, "company": "samsung"}, {"body": "The fact remains that since Leaders arrests for cheating swindling, quality and service is bad. Leader cheated convicted and now jailed again!", "score": 0, "created_utc": 1612374448, "company": "samsung"}, {"body": "The fact remains that since Leaders arrests for cheating swindling, quality and service is bad. Leader cheated convicted and now jailed again!", "score": 0, "created_utc": 1612374176, "company": "samsung"}, {"body": "The fact remains that since Leaders arrests for cheating swindling, quality and service is bad. Leader cheated convicted and now jailed again!", "score": 0, "created_utc": 1612374164, "company": "samsung"}, {"body": "Thich tam su", "score": 0, "created_utc": 1612373897, "company": "samsung"}, {"body": "you all need help us", "score": 0, "created_utc": 1612373455, "company": "samsung"}, {"body": "What happens when it's time to let go of something you can't live without?", "score": 0, "created_utc": 1612373422, "company": "samsung"}, {"body": "Follow smiling_face_with_hearts", "score": 1, "created_utc": 1612373244, "company": "samsung"}, {"body": "Happy New year XX.", "score": 0, "created_utc": 1612370862, "company": "samsung"}, {"body": "Are we going to see a note flagship this year?#fingerscrossed", "score": 0, "created_utc": 1612370228, "company": "samsung"}, {"body": "stop donating to Republicans who tried to overturn our democratic election waving racist flags. INTEGRITY is choosing your actions based on MORAL VALUES rather than PERSONAL GAIN. True patriots hold wrongdoers ACCOUNTABLE &amp; DO NOT blindly follow corrupt leaders.#DrainTheTraitors", "score": 0, "created_utc": 1612369583, "company": "samsung"}, {"body": "stop donating to Republicans who tried to overturn our democratic election waving racist flags. INTEGRITY is choosing your actions based on MORAL VALUES rather than PERSONAL GAIN. True patriots hold wrongdoers ACCOUNTABLE &amp; DO NOT blindly follow corrupt leaders.#DrainTheTraitors", "score": 0, "created_utc": 1612369553, "company": "samsung"}, {"body": "Hey Samsung, this is a serious problem for a lot of users. Are you ging to do something for that?", "score": 0, "created_utc": 1612358536, "company": "samsung"}, {"body": "I bought one and it sucks. pensive_face", "score": 0, "created_utc": 1612356545, "company": "samsung"}, {"body": "How much is this device?", "score": 0, "created_utc": 1612354408, "company": "samsung"}, {"body": "Someone's selling my ideas to Samsung", "score": 3, "created_utc": 1612351454, "company": "samsung"}, {"body": "Still waiting on a REAL replacement for the Galaxy Tab s 8.4 (from 2014!) I see nothing in the works, do I need to switch to Apple?", "score": 0, "created_utc": 1612349273, "company": "samsung"}, {"body": "This is fab.", "score": 0, "created_utc": 1612348417, "company": "samsung"}, {"body": "Pls do Ads with Actor fans crazy for", "score": 0, "created_utc": 1612346980, "company": "samsung"}, {"body": "OVER PRICE TOYS", "score": 0, "created_utc": 1612346703, "company": "samsung"}, {"body": "backhand_index_pointing_right WATCH HERE Japanese_symbol_for_beginner Get the new #Samsung_Galaxy_S21 Ultra 5G check_mark_button red_circle OK_button desktop_computer laptop mobile_phone With a 5 day free trial with Dirtgame backhand_index_pointing_down OK_button backhand_index_pointing_right", "score": 0, "created_utc": 1612344743, "company": "samsung"}, {"body": "please, I want to buy DVD - 878D and to know how many speak can I connect it with using auxiliary input, because I want to connect it with my Tall Boys (speakers). My DVD (Home Theatre is bad).", "score": 0, "created_utc": 1612342183, "company": "samsung"}, {"body": "Check out Samsung Galaxy M51 (Electric Blue, 6GB RAM, 128GB Storage) by Samsung via #SamsungGalaxyM51 #AmazonSpecialsDeal #AmazonGreatRepublicDaySale #SamsungGalaxy #RepublicDaySale", "score": 0, "created_utc": 1612340946, "company": "samsung"}, {"body": "Wow copying Apple tags before they're released face_with_rolling_eyes face_with_tears_of_joy", "score": 2, "created_utc": 1612340856, "company": "samsung"}, {"body": "Samsung Galaxy S7 best regards", "score": 0, "created_utc": 1612339930, "company": "samsung"}, {"body": "Credibility crisis products &amp; services.Awaiting replacement of within warranty #DefectiveSamsungGalaxy since 181 days.Service extort even from within warranty defect by flimsy excuses just to make out of warranty. Blot on", "score": 2, "created_utc": 1612338922, "company": "samsung"}, {"body": "Do you have a covert one for untrustworthy girlfriends?", "score": 0, "created_utc": 1612337998, "company": "samsung"}, {"body": "deleting tweets that mock apple after you followed along? clown_face", "score": 0, "created_utc": 1612337283, "company": "samsung"}, {"body": "My brother is my best friend. You stand by me when I am alone, you make feel happy when I am low. Thanks for being there for me always Dear Brother.", "score": 0, "created_utc": 1612337177, "company": "samsung"}, {"body": "I have a fault with my machine ongoing since March last year despite several engineer visits, several parts being replaced, several conversations with Samsung? Still you say the machine is repairable!?! If that's the case please come and fix it for good!", "score": 1, "created_utc": 1612336702, "company": "samsung"}, {"body": "Credibility crisis products &amp; services.Awaiting replacement of within warranty #DefectiveSamsungGalaxy since 181 days.Service extort even from within warranty defect by flimsy excuses just to make out of warranty. Blot on", "score": 0, "created_utc": 1612335262, "company": "samsung"}, {"body": "My phone mobile_phone Samsung new phone 2month old screen problem pls change my phone", "score": 2, "created_utc": 1612335086, "company": "samsung"}, {"body": "Bookmark kr lia", "score": 0, "created_utc": 1612334463, "company": "samsung"}, {"body": "I'll attach this to my younger brother, he's such a troublemaker", "score": 0, "created_utc": 1612334309, "company": "samsung"}, {"body": "I cannot find voice assist on my tv Samsung UE75TU7020 75\" Smart 4K Ultra HD TV there is no voice section in settings", "score": 1, "created_utc": 1612334274, "company": "samsung"}, {"body": "Doge tracker", "score": 0, "created_utc": 1612333114, "company": "samsung"}, {"body": "That's a dog not a furry troublemaker", "score": 1, "created_utc": 1612333031, "company": "samsung"}, {"body": "Do you want to grow your Business ONLINE Free of cost", "score": 0, "created_utc": 1612332415, "company": "samsung"}, {"body": "Respect hundred_points", "score": 1, "created_utc": 1612332007, "company": "samsung"}, {"body": "This is Boogie Down, Boogie Down, Boogie Down Boogie Down Boogie Down Produc-tions Jump around be the one is the function.", "score": 0, "created_utc": 1612331404, "company": "samsung"}, {"body": "How dare you offer a 49 inch PRODUCTIVITY monitor with Full-HD resolution only?!?", "score": 4, "created_utc": 1612331381, "company": "samsung"}, {"body": "Fake meteorite dropped in Australia (Queensland school) NASA study the meteorite and get angry on Mark allen(the principle of northen Queensland school).. the meteorite is made up of charcoal face_with_tears_of_joy face_with_tears_of_joy face_with_tears_of_joy face_with_tears_of_joy", "score": 0, "created_utc": 1612329534, "company": "samsung"}, {"body": "Is there anyway you could track my galaxy buds pro i kinda need em face_with_tears_of_joy", "score": 0, "created_utc": 1612329479, "company": "samsung"}, {"body": "New Telugu Horror Short Film Teaser Out Now fire backhand_index_pointing_down backhand_index_pointing_down backhand_index_pointing_down backhand_index_pointing_down backhand_index_pointing_down backhand_index_pointing_down backhand_index_pointing_down backhand_index_pointing_down backhand_index_pointing_down .", "score": 0, "created_utc": 1612329271, "company": "samsung"}, {"body": "#_ Keeping the human life away from goodwill by complicating human life in alcohol and other disorders is a well-planned trick of the times. The naive public is getting caught up in the trick of Kaal Butcher. For more information, visit Satlok", "score": 1, "created_utc": 1612329193, "company": "samsung"}, {"body": "#_ Keeping the human life away from goodwill by complicating human life in alcohol and other disorders is a well-planned trick of the times. The naive public is getting caught up in the trick of Kaal Butcher. For more information, visit Satlok Ashram Youtube", "score": 1, "created_utc": 1612328748, "company": "samsung"}, {"body": "Win these cool stuff", "score": 1, "created_utc": 1612328165, "company": "samsung"}, {"body": "No thanks...its just the next step to get us used to tracking humans..by the cult...get lost!", "score": 1, "created_utc": 1612327542, "company": "samsung"}, {"body": "I've been unable to find my prime minister. He keeps running off. Can the SmartTag be detected even when it's inside a refrigerator?", "score": 21, "created_utc": 1612327140, "company": "samsung"}, {"body": "This is a great step forward but how ethical and eco friendly is the cobalt/coltan in your mobile phones?", "score": 1, "created_utc": 1612326896, "company": "samsung"}, {"body": "Robinhood increases the trading limit on five companies including GameStop Find More #Robinhood #GameStop #AMC #Entertainment #Stocks #Sharemarket #trading", "score": 0, "created_utc": 1612326729, "company": "samsung"}, {"body": "The project's 2nd Claim $hSOV2 campaign has begun. - Contract on HECO 0x8f80ffe983802c230f9a0950cbd654ed04fef789 - Claim on #airdrop #Defi #NFT", "score": 0, "created_utc": 1612326264, "company": "samsung"}, {"body": "lmao what if....", "score": 2, "created_utc": 1612326259, "company": "samsung"}, {"body": "Iam absolutely unhappy with your high end phones as i think is much better than you", "score": 1, "created_utc": 1612326064, "company": "samsung"}, {"body": "samsung is the biggest company in the world They should have their own logo of samsung like apple and Tesla I can give u some ideas", "score": 0, "created_utc": 1612324833, "company": "samsung"}, {"body": "Now#q", "score": 0, "created_utc": 1612324151, "company": "samsung"}, {"body": "Hello", "score": 0, "created_utc": 1612323195, "company": "samsung"}, {"body": "Delivering new products is ok, but your mobile service is very poor in all over the world, I think you make all your products as use and throw models in this world. Your products and your name is going to disappear in coming years because of your poor service and waste products.", "score": 3, "created_utc": 1612323105, "company": "samsung"}, {"body": "so funny D", "score": 1, "created_utc": 1612322931, "company": "samsung"}, {"body": "My Samsung new phone 2 month old mobile_phone M51 screen problem pls help me team", "score": 0, "created_utc": 1612319834, "company": "samsung"}, {"body": "hi ineed toknow if these airbuds are original or fake", "score": 0, "created_utc": 1612319147, "company": "samsung"}, {"body": "front glass broke in less than a year and Samsung wants $400 to replace it", "score": 2, "created_utc": 1612314248, "company": "samsung"}, {"body": "when you ask for the manager of customer solutions to call you back (Rachel) why do you ignore the customer's request after you've promised a callback?!? I've called x3this week!!! Your customer service is diabolical!!?? #shit #samsungtreatspeoplewithnorespect", "score": 0, "created_utc": 1612313052, "company": "samsung"}, {"body": "Fedup waiting fromnlrom last 4 months and everytime hearing the same lame excuses. Yesterday this associate told me that he will call me before 5.30 and till today didn't get call back and nor even the extension is getting connected..I want a proper update for the same.", "score": 2, "created_utc": 1612312586, "company": "samsung"}, {"body": "I am consumer of various Samsung Products. However, refrigerator I purchased is not of any utility rather a burden on me. It is nothing more than a shoe rack, which had not been repaired after so many complaints. #consumerservices", "score": 2, "created_utc": 1612312075, "company": "samsung"}, {"body": "Keep the SD Card Slot on the next Note and keep making the Note series!", "score": 0, "created_utc": 1612305087, "company": "samsung"}, {"body": "can you please do something about One UI Home draining my battery?! I have done everything I can to optimize my battery life and since the last update it's always the number one thing that drains my battery!", "score": 0, "created_utc": 1612303359, "company": "samsung"}, {"body": "we purchased sumsung refrigerator 314 ltr 24-01-21, But your technician(Bijoy) not came yet for giving demo of the machine, every day he giving different type of excuse, please check and send technician for giving demo", "score": 1, "created_utc": 1612302485, "company": "samsung"}, {"body": "do I have to keep waiting now??? How should I reach you? Your #customersupport team is not responding. I can't reach him ever on the number he shared. Is this all #fraud??? What are you guys upto??", "score": 2, "created_utc": 1612300764, "company": "samsung"}, {"body": "sounds amazing thank you so much. folded_hands_medium-light_skin_tone folded_hands_medium-light_skin_tone", "score": 0, "created_utc": 1612300753, "company": "samsung"}, {"body": "explain? how does that make sense? apple is slowing there phones and make them drain power like crazy, you fill the storage internally or what is happening?", "score": 1, "created_utc": 1612300235, "company": "samsung"}, {"body": "I've been waiting my reimbursement for over a month can you speed this process, I've contacted your support multiple times. Thank you.", "score": 2, "created_utc": 1612294964, "company": "samsung"}, {"body": "tv plus is pretty cool. Might just cancel direct rolling_on_the_floor_laughing", "score": 0, "created_utc": 1612294833, "company": "samsung"}, {"body": "Just let me get rid of this piece of cancer!", "score": 0, "created_utc": 1612291519, "company": "samsung"}, {"body": "why does the s21 have the s pen ? The note series has the s pen exclusively. ( I'm disappointed that the note series is going. (", "score": 0, "created_utc": 1612291021, "company": "samsung"}, {"body": "I wonder where I've seen this before?", "score": 0, "created_utc": 1612289360, "company": "samsung"}, {"body": "Have you taken a stand to stop donations to the whose members lied to incite a murderous insurrection? Or will our $$$ become #GOPBloodMoney? Let us know by Feb. 8. - Prospective Customers #HoldThemAccountable #DrainTheTraitors #ONEV1", "score": 17, "created_utc": 1612281741, "company": "samsung"}, {"body": "my A50 updated the other night and eat all the words I taught it, and now the dictionary does not know words like \"form\" and anything in quotes it thinks is not spelled right. Fix you \"update\".", "score": 2, "created_utc": 1612271929, "company": "samsung"}, {"body": "I pre-ordered S21 Ultra, told all my friends about your great promo. Got a phone that doesn't work and have to return phone and promo items. Have to return it to you and buy it all again for more money? No thanks. Where is customer service?", "score": 1, "created_utc": 1612268943, "company": "samsung"}, {"body": "how's things", "score": 0, "created_utc": 1612268698, "company": "samsung"}, {"body": "My Galaxy Watch Active, (still in warranty) which is listed as water resistant up to 50m, costs me another galaxy watch in service because I took a shower with it! They said water resistant does not mean resistant to water! My most unfortunate purchase and aftersales experience!", "score": 0, "created_utc": 1612268270, "company": "samsung"}, {"body": "My Galaxy Watch Active, (still in warranty) which is listed as water resistant up to 50m, costs me another galaxy watch in service because I took a shower with it! They said water resistant does not mean resistant to water! My most unfortunate purchase and aftersales experience!", "score": 0, "created_utc": 1612268218, "company": "samsung"}, {"body": "My Galaxy Watch Active, (still in warranty) which is listed as water resistant up to 50m, costs me another galaxy watch in service because I took a shower with it! They said water resistant does not mean resistant to water! My most unfortunate purchase and aftersales experience!", "score": 0, "created_utc": 1612268182, "company": "samsung"}, {"body": "My Galaxy Watch Active, (still in warranty) which is listed as water resistant up to 50m, costs me another galaxy watch in service because I took a shower with it! They said water resistant does not mean resistant to water! My most unfortunate purchase and aftersales experience!", "score": 0, "created_utc": 1612268151, "company": "samsung"}, {"body": "My Galaxy Watch Active, (still in warranty) which is listed as water resistant up to 50m, costs me another galaxy watch in service because I took a shower with it! They said water resistant does not mean resistant to water! My most unfortunate purchase and aftersales experience!", "score": 0, "created_utc": 1612268087, "company": "samsung"}, {"body": "hi kindly advise which SOuth African store has the following product - samsung swa-8500s. Or is there a replacement. I want to add speakers onto my soundbar", "score": 0, "created_utc": 1612262839, "company": "samsung"}, {"body": "when you edit the actual file and not a copy you screw up the date of the file. Go back to editing a copy of the original please. Automatically.", "score": 0, "created_utc": 1612260670, "company": "samsung"}, {"body": "our double door fridge keeps making this rattling noises and it's really disturbing. Please what could be the cause?", "score": 0, "created_utc": 1612260663, "company": "samsung"}, {"body": "dastardly scammers, do not deceive people, I ate headphones from Samsung for two days on credit and did not keep my word shame on you Klarna en Samsung wanted to make a gift to my girlfriend, I'm in the hospital now big expenses greedy bastards", "score": 0, "created_utc": 1612258556, "company": "samsung"}, {"body": ".dastardly scammers, do not deceive people, I ate headphones from Samsung for two days on credit and did not keep my word shame on you Klarna en Samsung wanted to make a gift to my girlfriend, I'm in the hospital now big expenses greedy bastards", "score": 0, "created_utc": 1612258438, "company": "samsung"}, {"body": "Could you please send me an email adress of any customer services representative. I fell cheated by I want to let you know about the process.", "score": 0, "created_utc": 1612256183, "company": "samsung"}, {"body": ", WHO SAID THAT I'M NOT ?!?!?!?!", "score": 0, "created_utc": 1612249901, "company": "samsung"}, {"body": "Flipkart and Samsung keep trapping by showing offers sale discounts these are trap to clear their defective refurbished and useless products. Fraudulent business by Samsung and flipkart. Service ref no 4315916463.", "score": 0, "created_utc": 1612249868, "company": "samsung"}, {"body": "Any chance there's someone in your support dept that understands RFI and FCC regulations, and would be willing to help fix this issue?", "score": 1, "created_utc": 1612248894, "company": "samsung"}, {"body": "I pre ordered s21 ultra on 28 of jan , It still not here , It's all over the shops , why is pre order taking more time than the order Itself, , Someone from Samsung need to contact me , I'll give them the order number", "score": 0, "created_utc": 1612246701, "company": "samsung"}, {"body": "do all fridges come with such cheap door shelves. New fridge and practically all shelves are broke. Even the replaced shelves have broken. This thing is junk", "score": 2, "created_utc": 1612246574, "company": "samsung"}, {"body": "dastardly scammers, do not deceive people, I ate headphones from Samsung for two days on credit and did not keep my word shame on you Klarna en Samsung wanted to make a gift to my girlfriend, I'm in the hospital now big expenses greedy bastards", "score": 0, "created_utc": 1612245029, "company": "samsung"}, {"body": "and can you guys pls add twitch on smart tvs so i can actually watch twitch kthxbye", "score": 0, "created_utc": 1612244983, "company": "samsung"}, {"body": "please include DeX in the next update for Tab S6 Lite tysm", "score": 0, "created_utc": 1612242873, "company": "samsung"}, {"body": "How can we stop the samsung accessory service bug it's very aggervate me constantly coping images and files can you help with this I have a samsung galaxy S20 owner", "score": 0, "created_utc": 1612239878, "company": "samsung"}, {"body": "What's the point of this cable?", "score": 1, "created_utc": 1612238767, "company": "samsung"}, {"body": "any updates 3rd day over no technician visited yet for installation", "score": 0, "created_utc": 1612238368, "company": "samsung"}, {"body": "What a company, should be ashamed of itself.", "score": 1, "created_utc": 1612235511, "company": "samsung"}, {"body": "Please start a trad in program for your watches!", "score": 0, "created_utc": 1612836629, "company": "samsung"}, {"body": "Hi Samsung I am a loyal android user from my first Galaxy S to now. I just purchased the two newest s21 &amp; s21+. But after spending $1500+ I am disappointed that chargers w/wall plugs and maybe even ear buds are not included. Take care of your customers.", "score": 0, "created_utc": 1612836176, "company": "samsung"}, {"body": "Not gud service for samsung and not sporting to customer", "score": 0, "created_utc": 1612835978, "company": "samsung"}, {"body": "how dare you remove the hide front camera feature from s10+? it's really ugly as fuck, you know? I've decided to buy the phone cuz this feature. So disappointed expressionless_face", "score": 0, "created_utc": 1612835681, "company": "samsung"}, {"body": "repair team very good. Quick to get through to on the phone and next morning doorstep pick up in the snow. Impressive", "score": 0, "created_utc": 1612834318, "company": "samsung"}, {"body": "anyday any time the only best phone in the world", "score": 0, "created_utc": 1612833668, "company": "samsung"}, {"body": "Hi guys, I would recommend a great Solar Lights seller on Amazon which I bought from and used for years, really got great fun and charming lighting atmosphere around house. Here is the beautiful solar post cap lights I like so much", "score": 0, "created_utc": 1612831812, "company": "samsung"}, {"body": "Unless you're in an exynos region! Then your phone can cook eggs after just minutes of gaming. Excellent job Samsung.", "score": 1, "created_utc": 1612830157, "company": "samsung"}, {"body": "Samsung Galaxy s 20 FE on Exynos 990 is a scamm of your customers. It's a expensive hand warmer!", "score": 0, "created_utc": 1612829543, "company": "samsung"}, {"body": "Why did you change everything with this update? Everything about it should have been an option to change to not force it on everyone. SHIT IS TRASH", "score": 0, "created_utc": 1612827482, "company": "samsung"}, {"body": "have purchased mobile model M31S 8 August 2020 Showing lining in screen Please do needful", "score": 0, "created_utc": 1612824745, "company": "samsung"}, {"body": "After 3.0 Android 11 on S10plus my phone runs like having android on nokia symbian smartphones. Please fix this folded_hands", "score": 0, "created_utc": 1612823860, "company": "samsung"}, {"body": "stop your racial profiling it's a turn off who won't buy your products", "score": 0, "created_utc": 1612822605, "company": "samsung"}, {"body": "what's up with the black guy running around in circles in your commercial is spinning around what's the what's the deal with this shit with the black people they're just people like everybody else they're not special", "score": 0, "created_utc": 1612822590, "company": "samsung"}, {"body": "Hi guys, I would recommend a great Solar Lights seller on Amazon which I bought from and used for years, really got great fun and charming lighting atmosphere around house. Here is the beautiful Solar deck post lights I like so much", "score": 0, "created_utc": 1612820120, "company": "samsung"}, {"body": "Hi!!! I badly wanted to buy the S21 Ultra/ S21+ during the prebook sale.I didn't have much money at that time.i started to save some cash for it and now I have money to buy it but the offer is gone!!I am a student.Pls in need of offer", "score": 1, "created_utc": 1612819326, "company": "samsung"}, {"body": "Looks amazing", "score": 0, "created_utc": 1612817466, "company": "samsung"}, {"body": "When will #OneUI3 will be available for A series phones??", "score": 0, "created_utc": 1612816479, "company": "samsung"}, {"body": "Is that what 12 Gigs of RAM is for?", "score": 0, "created_utc": 1612815838, "company": "samsung"}, {"body": "Dark red, plum or dark pastel green", "score": 0, "created_utc": 1612815395, "company": "samsung"}, {"body": "Hey you should add the app lock function", "score": 0, "created_utc": 1612815231, "company": "samsung"}, {"body": "we don't need ur exynos in india. We need only snapdragon in samsung mobile", "score": 0, "created_utc": 1612815225, "company": "samsung"}, {"body": "Atleast care to reply to your customers", "score": 1, "created_utc": 1612813365, "company": "samsung"}, {"body": "Welcome to my video today presentation this mobile review all time update video please subscribe Thanks I wish you all the best in your love", "score": 0, "created_utc": 1612813348, "company": "samsung"}, {"body": "Next time you design flip cover cases, PLEASE take into account that screen protectors are a millimeter thick these days. This just doesn't cut it.", "score": 0, "created_utc": 1612813121, "company": "samsung"}, {"body": "Hi, will we see non-contact CGM in a near-future watch? Thank you.", "score": 0, "created_utc": 1612812935, "company": "samsung"}, {"body": "I have been using my #S21Ultra for no more than a week . Planned a trip to the beach and wasnt able to take too many picsy s21 needed to cool down please fix this asap or I will request a refund , this is not worth $1400 #overheating", "score": 1, "created_utc": 1612811964, "company": "samsung"}, {"body": "2021 Once again, Kwon, Chairman Samsung rightfully behind bars min 2 yrs convicted of cheating fraud etc. Imagine state of Samsung since few years (1st time Leaders jailed 2016). No attention to quality or service Samsung suffers, &amp; makes its customers suffer.", "score": 0, "created_utc": 1612811376, "company": "samsung"}, {"body": "2021 Once again, Kwon, Chairman Samsung rightfully behind bars min 2 yrs convicted of cheating fraud etc. Imagine state of Samsung since few years (1st time Leaders jailed 2016). No attention to quality or service Samsung suffers, &amp; makes its customers suffer.", "score": 0, "created_utc": 1612811340, "company": "samsung"}, {"body": "2021 Once again, Kwon, Chairman Samsung rightfully behind bars min 2 yrs convicted of cheating fraud etc. Imagine state of Samsung since few years (1st time Leaders jailed 2016). No attention to quality or service Samsung suffers, &amp; makes its customers suffer.", "score": 0, "created_utc": 1612811317, "company": "samsung"}, {"body": "2021 Once again, Kwon, Chairman Samsung rightfully behind bars min 2 yrs convicted of cheating fraud etc. Imagine state of Samsung since few years (1st time Leaders jailed 2016). No attention to quality or service Samsung suffers, &amp; makes its customers suffer.", "score": 0, "created_utc": 1612811300, "company": "samsung"}, {"body": "2021 Once again, Kwon, Chairman Samsung rightfully behind bars min 2 yrs convicted of cheating fraud etc. Imagine state of Samsung since few years (1st time Leaders jailed 2016). No attention to quality or service Samsung suffers, &amp; makes its customers suffer.", "score": 0, "created_utc": 1612811081, "company": "samsung"}, {"body": "2021 Once again, Kwon, Chairman Samsung rightfully behind bars min 2 yrs convicted of cheating fraud etc. Imagine state of Samsung since few years (1st time Leaders jailed 2016). No attention to quality or service Samsung suffers, &amp; makes its customers suffer.", "score": 0, "created_utc": 1612810967, "company": "samsung"}, {"body": "why have Australians been dumped with an inferior chipset that runs a reasonable deal slower and a lot hotter with far worse image processing capabilities? Yet you call it the same name as the snapdragon varient which is faster cooler and has better rendering.", "score": 0, "created_utc": 1612808558, "company": "samsung"}, {"body": "Everyone wants a full version of the song from the commercial. Make it happen.", "score": 0, "created_utc": 1612806601, "company": "samsung"}, {"body": "why android 11 not working with wifi direct , it seems also after 3.5 mm jack to through samsung , without earphone we can live with bluetooth for ling time and nkw wifi direct issue what is this", "score": 0, "created_utc": 1612805422, "company": "samsung"}, {"body": "contacted the AG &amp; will be filing a complaint with Mass DOR for taxing sale items at retail rates and refusing to refund. Looking forward to the class action when others catch wind. This is criminal.", "score": 0, "created_utc": 1612805238, "company": "samsung"}, {"body": "What is the name of this song?! So many of us are going insane not knowing! So catchy! #samsungs21 #DanceParty", "score": 0, "created_utc": 1612805229, "company": "samsung"}, {"body": "if I am using a 21 Ultra I really don't need to see and advert for it in the Health app. Looks like it's refund time and back to using one plus device.", "score": 0, "created_utc": 1612803779, "company": "samsung"}, {"body": "Just got my son a new S21. Can we get some of that fast charging offers? S21 is decent overall but my 4500 mAh battery in my one plus 65 watt fast charges 0-100% in 37 minutes. That being said, OnePlus apparently puts potatoes in their phones for cameras", "score": 0, "created_utc": 1612803292, "company": "samsung"}, {"body": "Great phone but the experience is marred with your decision to serve ads in stock apps Will be returning for a refund.", "score": 0, "created_utc": 1612803088, "company": "samsung"}, {"body": "Bunch of thieves . Don't fall prey to it. No customer service. Neither Samsung CEO is capable of handling customers complaints despite several communication", "score": 0, "created_utc": 1612802637, "company": "samsung"}, {"body": "Bunch of thieves . Don't fall prey to it. No customer service. Neither Samsung CEO is capable of handling customers complaints despite several communication", "score": 0, "created_utc": 1612802622, "company": "samsung"}, {"body": "Bunch of thieves . Don't fall prey to it. No customer service. Neither Samsung CEO is capable of handling customers complaints despite several communication", "score": 0, "created_utc": 1612802609, "company": "samsung"}, {"body": "Bunch of thieves . Don't fall prey to it. No customer service. Neither Samsung CEO is capable of handling customers complaints despite several communications.", "score": 1, "created_utc": 1612802590, "company": "samsung"}, {"body": "It's amazing one and hard to compare with Galaxy S20 ultra. helps me lot to..", "score": 0, "created_utc": 1612798229, "company": "samsung"}, {"body": "My reaction upon seeing the S21 Ultra doesn't have expandable storage", "score": 0, "created_utc": 1612797381, "company": "samsung"}, {"body": "When is samsung going to stop with the exynos bullshit. My worst regret in my 33 year on earth is buying the s20 ultra and I feel sorry for all the ppl who got the s21 ultra with the exynos chipset. I'm looking forward to getting rid of this crap phone in a months time. Oneplus", "score": 0, "created_utc": 1612796961, "company": "samsung"}, {"body": "9 days so far", "score": 0, "created_utc": 1612796658, "company": "samsung"}, {"body": "I'd like to draw your attention to the service repair process in Mexico which is absolutely ridiculous. They've had my Galaxy Tab S7+ for a month and I'm clueless regarding its current repair state, absolutely terrible service pouting_face", "score": 0, "created_utc": 1612795019, "company": "samsung"}, {"body": "i have got idea who your customer service agents are but they need to be traned properly. Shame on Samsung. I used to love samsung, but i guess apple doesn't just have a name in the afterall for nothing. #bulling", "score": 0, "created_utc": 1612790526, "company": "samsung"}, {"body": "Can you personalised Samsung users As Chat/Tweet with Samsung? Just like iPhone users.. #SamsungChatCustomization", "score": 0, "created_utc": 1612790398, "company": "samsung"}, {"body": "needs to stop this exynox vs snapdragon bullshit. My friend bought a s10+ directly from Samsung and now she doesn't have Android 11 because fucking exynox. And this information was not communicated. There needs to be lawsuits Samsung is lying to it's customers", "score": 0, "created_utc": 1612790351, "company": "samsung"}, {"body": "Nice trick, order places never received confirmation neither cancelation still have a loan somehow, called to confirm after a month just to know the order has been cancelled nice business u got yourself there.", "score": 0, "created_utc": 1612789263, "company": "samsung"}, {"body": "No doubt I m using sumsung mobile last 3 years back but worst service of Samsung Care !!", "score": 0, "created_utc": 1612786281, "company": "samsung"}, {"body": "hi Is there anyway I could unlock a pattern pass code on a note 10 without knowing it....Long story", "score": 0, "created_utc": 1612784547, "company": "samsung"}, {"body": "I sent a dm", "score": 0, "created_utc": 1612784533, "company": "samsung"}, {"body": "your new software update for S10 lags a bit. I regret updating my phone now sleepy_face", "score": 0, "created_utc": 1612784260, "company": "samsung"}, {"body": "give me the option to rollback to android 10 on my s10 plus. If I get any damages to my phone I will be getting legal actions. It's so broken and my phone is getting dangerously hot", "score": 0, "created_utc": 1612783284, "company": "samsung"}, {"body": "should give us Twitter for Samsung Abeg...Enough of everyday disrespect from iPhone 6 users loudly_crying_face", "score": 9, "created_utc": 1612782733, "company": "samsung"}, {"body": "Multiple hours. calls and chats, asking questions about S10 + and Ultra, including how has stability and technology improved from S20 Ultra, to prevent having to reboot multiple times daily. Nobody has answers.", "score": 1, "created_utc": 1612781865, "company": "samsung"}, {"body": "really seems like a strange choice to move the media controls higher up on the screen in OneUI 3. Hopefully a good lock module could return it to its normal place underneath the brightness slider soon. Not a good first impression of OneUI 3 so far.", "score": 0, "created_utc": 1612781725, "company": "samsung"}, {"body": "My Samsung phone screen is shattered broken_heart broken_heart loudly_crying_face loudly_crying_face", "score": 0, "created_utc": 1612780478, "company": "samsung"}, {"body": "Im unable to reset my Samsung Galaxy A02s.Please assist.", "score": 0, "created_utc": 1612778043, "company": "samsung"}, {"body": "I reset my Samsung Galaxy A02s but im unable to complete the resetting process.I received a message that there is no network.", "score": 0, "created_utc": 1612777908, "company": "samsung"}, {"body": "#Samsung unpacked", "score": 0, "created_utc": 1612777878, "company": "samsung"}, {"body": "Unchi Dukaan Fike Pakwaan #stopconsumerharassment Got defected new samsung tab Allegedly used product #shameful #refundmymoney #consumercourt #disrespectingcostomerstime NS Enterprises G.Ngr Jmu refused to take the ownership #shame", "score": 10, "created_utc": 1612776759, "company": "samsung"}, {"body": "&amp; announce a record #PreOrder sales in the #UKMarket for #GalaxyS21_5G_Series, with #S21Ultra_5G accounting for more than 50% of the orders placed, beating previous records held by #GalaxyS20 &amp; #GalaxyS10 #SBTelecoms", "score": 0, "created_utc": 1612776096, "company": "samsung"}, {"body": "voice recorder not working in many phones. Why? #fix it.", "score": 0, "created_utc": 1612775823, "company": "samsung"}, {"body": "Does Samsung Galaxy M31/F41 get 3 years major OS &amp; Security update like S series? #Samsung #Galaxy #F41 #SamsungGalaxy #GalaxyF41 #SamsungGalaxyF41 #GalaxyM31 #Android #AndroidHelp", "score": 0, "created_utc": 1612774310, "company": "samsung"}, {"body": "HOW MANY TIMES DO I HAVE TO FUCKING SAY THIS!? EVERYTIME I STOP RECORDING, THE LIMIT GETS LOWER!! FIX IT ALREADY &gt; ( &gt; ( &gt; ( I DONT WANNA MAKE MY FAN MADE ROBLOX MOVIE WITH THIS SHIT, AGAIN, MY PHONE IS THE SAMSUNG GALAXY S7, THATS WHERE U FIX IT. FIX THIS SHIT!!!", "score": 0, "created_utc": 1612771285, "company": "samsung"}, {"body": "It has been well over a year. Why does talk to text still not recognize the word covid?", "score": 0, "created_utc": 1612770935, "company": "samsung"}, {"body": "I have s21 ultra and this is for your chip exynos 2100 middle_finger what a bad experience", "score": 0, "created_utc": 1612769527, "company": "samsung"}, {"body": "why wifi direct is not working damnit", "score": 0, "created_utc": 1612769363, "company": "samsung"}, {"body": "What's the next samsung is eliminating for box thinking_face", "score": 0, "created_utc": 1612768492, "company": "samsung"}, {"body": "No charger no ear buds", "score": 0, "created_utc": 1612768277, "company": "samsung"}, {"body": "let me down no charger or headphones with the new s21", "score": 0, "created_utc": 1612766872, "company": "samsung"}, {"body": "Samsung unpacked", "score": 0, "created_utc": 1612766264, "company": "samsung"}, {"body": "Meanwhile your pre-order deal states it takes up to 7 days for a response back once registered, 10 days for me and still nothing!", "score": 0, "created_utc": 1612766167, "company": "samsung"}, {"body": "Why would you remove the microSD card support? I like saving all of my pictures to a microSD card in case my phone ends up breaking, and no I don't want to pay for a cloud service when I can just use a microSD.", "score": 0, "created_utc": 1612766016, "company": "samsung"}, {"body": "Please donate and share!", "score": 0, "created_utc": 1612764085, "company": "samsung"}, {"body": "my phone is still faulty and its the 3rd repair. Samsung have spoken to the person that told me this information and have apologised for the mis information and still will not change my phone now it has to be repaired 7 times", "score": 0, "created_utc": 1612763468, "company": "samsung"}, {"body": "between and Samsung i have received a disgusting service. I have a S10 which has is faulty and has been sent off 3 times for repair. I have asked to access my warranty to change it. I was told by samsung i can after 3 repairs.", "score": 0, "created_utc": 1612763386, "company": "samsung"}, {"body": "WTH, why are you making your apps billboards for your new phones now. Are your older phones instantly garbage when you release something new? Perhaps I should consider another brand.", "score": 0, "created_utc": 1612760548, "company": "samsung"}, {"body": "Bring back Micro SD card.", "score": 0, "created_utc": 1612759482, "company": "samsung"}, {"body": "Please revert the latest update. This latest UI update has ruined my phone. It's horrible. Why fix what isn't broken.", "score": 0, "created_utc": 1612758829, "company": "samsung"}, {"body": "that's why people bother to buy your phone and buy from another brands like Mi, Oppo, Vivo coz they provide better specs with service, I was also planning to buy a Samsung phone but now I'm not gonna buy.", "score": 2, "created_utc": 1612757861, "company": "samsung"}, {"body": "Love my S21 ultra...", "score": 0, "created_utc": 1612757494, "company": "samsung"}, {"body": "Just downloaded the newest update for my galaxy s10, my phone is all of a sudden markedly slower..... also you removed the option to change screen resolution from the swipe down menu, to just a battery save mode. Why????", "score": 0, "created_utc": 1612756315, "company": "samsung"}, {"body": "want 170 to replace my battery in a 2yo A70 that is perfect, other than fast draining battery. Why are we allowing these companies, incl to make phones that a simple battery swap can't be carried out by users? What a waste! What greed!", "score": 0, "created_utc": 1612755957, "company": "samsung"}, {"body": "Have you got a date when #SamsungGalaxyA51 will get #Android11", "score": 0, "created_utc": 1612754212, "company": "samsung"}, {"body": "hey I have #Samsunggalaxyj72016 phone. But it only one 4G supportive and second slot always in emergency mode. Now There is no option of using dual 4G sim on this device.", "score": 1, "created_utc": 1612752454, "company": "samsung"}, {"body": "your S8, S9, S10 models were so perfectly sized and beautiful. Why on earth did you replace them with the utterly common, long-tail appearance of the S20, S21. Keep that for your A-series, not for the premium line. Youre not youre better than that!", "score": 0, "created_utc": 1612752217, "company": "samsung"}, {"body": "why do you people give exynos processor in Indian version of your Galaxy phones and snapdragon processor in US models! Are we Guinea pigs for your processor experimentation!", "score": 0, "created_utc": 1612750383, "company": "samsung"}, {"body": "I visited service center today to get my phone repaired.. assigned person had pathetic behaviour towards me and without checking properly said motherboard will be changed at cost of 15k.he did not even usd any I/O device.he checked issues magically at one glance.", "score": 3, "created_utc": 1612750257, "company": "samsung"}, {"body": "My galaxy note 9 is showing discoloration issue.. and there are number of other Samsung note and s user facing same problem. Please fix it soon... #galaxy #note9 #note10 #s21", "score": 0, "created_utc": 1612749955, "company": "samsung"}, {"body": "exynos needs retirement please", "score": 0, "created_utc": 1612747562, "company": "samsung"}, {"body": "Please use bts ad in india also", "score": 0, "created_utc": 1612745045, "company": "samsung"}, {"body": "Hi guys, I would recommend a great Solar Lights seller on Amazon which I bought from and used for years, really got great fun and charming lighting atmosphere around house. Here is the beautiful solar post lights outdoor I like so much", "score": 0, "created_utc": 1612744355, "company": "samsung"}, {"body": "It would be great if you stopped using the infinity displays on phones. There's no great case to be made for them and it makes it more challenging for protective covers to work effectively. Further, this design is, literally, a weak point in the structure.", "score": 0, "created_utc": 1612743639, "company": "samsung"}, {"body": "anybody listening there?? read this review?? I know you will be working on it... But till then please show us how to go back to one ui 2.5... Pls help this is very irritating...", "score": 1, "created_utc": 1612743610, "company": "samsung"}, {"body": "My request is to useSamsung's mobileMediaTek processor GMsub mobile that all mobileshang. I will requestSamsung companynot to use MediaTek processor", "score": 0, "created_utc": 1612741944, "company": "samsung"}, {"body": "my mobile Samsung m2 core MediaTek processor to be hanged for mobiles I requirement not for use MediaTek processor any mobile Samsung phone media tek processer heating problems angry_face angry_face angry_face angry_face", "score": 1, "created_utc": 1612741272, "company": "samsung"}, {"body": "my new #M51 is getting switched off. Is my my #broken? #help me in this.", "score": 0, "created_utc": 1612740462, "company": "samsung"}, {"body": "I'm trying to buy more storage but I cannot get off this page, I press BUY and nothing happens.", "score": 0, "created_utc": 1612739309, "company": "samsung"}, {"body": "Hi guys, I would recommend a great Solar Lights seller on Amazon which I bought from and used for years, really got great fun and charming lighting atmosphere around house. Here is the beautiful Solar fence post lights I like so much", "score": 0, "created_utc": 1612738008, "company": "samsung"}, {"body": "OH WOW OH WOW OH WOW", "score": 0, "created_utc": 1612735163, "company": "samsung"}, {"body": "You guys have my complete thanks for making this majestic leather case exist, just absolutely beautiful and I can't wait for the patina to come in.", "score": 1, "created_utc": 1612733991, "company": "samsung"}, {"body": "I hate everything you've done with this new One UI nonsense. The split screen redesign especially. This is awful.", "score": 1, "created_utc": 1612733379, "company": "samsung"}, {"body": "Why there is such an ugly black box in dialer screen of one ui 3?", "score": 0, "created_utc": 1612733279, "company": "samsung"}, {"body": "Credibility crisis products &amp; services.Awaiting replacement of within warranty #DefectiveSamsungGalaxy since 185 days.Service extort even from within warranty defect by flimsy excuses just to make out of warranty. Blot on", "score": 0, "created_utc": 1612731643, "company": "samsung"}, {"body": "Credibility crisis products &amp; services.Awaiting replacement of within warranty #DefectiveSamsungGalaxy since 185 days.Service extort even from within warranty defect by flimsy excuses just to make out of warranty. Blot on", "score": 0, "created_utc": 1612731607, "company": "samsung"}, {"body": "Credibility crisis products &amp; services.Awaiting replacement of within warranty #DefectiveSamsungGalaxy since 185 days.Service extort even from within warranty defect by flimsy excuses just to make out of warranty. Blot on", "score": 0, "created_utc": 1612731570, "company": "samsung"}, {"body": "Credibility crisis products &amp; services.Awaiting replacement of within warranty #DefectiveSamsungGalaxy since 185 days.Service extort even from within warranty defect by flimsy excuses just to make out of warranty. Blot on", "score": 0, "created_utc": 1612731536, "company": "samsung"}, {"body": "your note10+ latest software update is soo half baked. Applications literally take atleast 15 seconds to respond properly and randomly crashes/halts, i am barely torelating my phone now", "score": 0, "created_utc": 1612731405, "company": "samsung"}, {"body": "are the best thumbs_up . needs to learn from it. face_with_tears_of_joy face_with_tears_of_joy", "score": 1, "created_utc": 1612730415, "company": "samsung"}, {"body": "Recently installed new update for Galaxy M21 and it broke the device to function properly. Cust care asked to visit service centre for fix and data would be deleted. Why you people pushed this update even though it is buggy.", "score": 2, "created_utc": 1612730337, "company": "samsung"}, {"body": "I would love if you would offer the ultra in that red pleading_face pleading_face . I want red so bad but want the ultra cameras.", "score": 0, "created_utc": 1612729542, "company": "samsung"}, {"body": "great work on the latest update, especially all the UI changes are frickin cool", "score": 1, "created_utc": 1612729400, "company": "samsung"}, {"body": "How many years it will take for BIXBY to learn name and pronunciation ? I love samsung but I'm exhausted weary_face .", "score": 0, "created_utc": 1612728606, "company": "samsung"}, {"body": "why did you get rid of 'Edge Lighting' after the new software update!?!? I can't find it anywhere!!!! How sad, taking that feature away from customers. I hope you guys bring that back.", "score": 0, "created_utc": 1612728555, "company": "samsung"}, {"body": "What?", "score": 0, "created_utc": 1612727605, "company": "samsung"}, {"body": "this is the condition in just 2 weeks ! Bought the cover with mobile same day and whole plastic inside of cover and screen gaurd of the mobile is full of scratches! Is this is ur quality?", "score": 2, "created_utc": 1612727553, "company": "samsung"}, {"body": "Hi Verfication code didnt sent to me What should i do", "score": 0, "created_utc": 1612725203, "company": "samsung"}, {"body": "I definitely need one of these...", "score": 0, "created_utc": 1612723884, "company": "samsung"}, {"body": "I bought this s21 ultra 5g 3 days ago and this phone is very heating up like a hell , and battery drain in just 2 or 3 hours ,standby mode is also very poor , I thought I got damage piece but when I ask other user who has same phone , he also facing same issue , please fix this.", "score": 3, "created_utc": 1612723525, "company": "samsung"}, {"body": "The Greatest 8 Megapixel Photograph In The World SAMSUNG DEVICE - Unaltered Photograph, Only Sat And Hue, Impressionism Photography #samsung #photography #photograph #MartinBalogh13 #impressionism #art #landscape", "score": 2, "created_utc": 1612720048, "company": "samsung"}, {"body": "can you 2 make a collab project to make a completely waterproof phone for this girl, face_with_tears_of_joy face_with_tears_of_joy face_with_tears_of_joy #iPhone", "score": 1, "created_utc": 1612719595, "company": "samsung"}, {"body": "Hi I'm LOGO Designer Do you have a company or business?To make your business more beautiful?Let's make a logo for your business at affordable prices. 100% satisfaction is my first priority Let's Discuss about your LOGO Fiverr", "score": 0, "created_utc": 1612718735, "company": "samsung"}, {"body": "Hi I'm LOGO Designer Do you have a company or business?To make your business more beautiful?Let's make a logo for your business at affordable prices. 100% satisfaction is my first priority Let's Discuss about your LOGO Fiverr", "score": 0, "created_utc": 1612718729, "company": "samsung"}, {"body": "Hi I'm LOGO Designer Do you have a company or business?To make your business more beautiful?Let's make a logo for your business at affordable prices. 100% satisfaction is my first priority Let's Discuss about your LOGO Fiverr", "score": 0, "created_utc": 1612718724, "company": "samsung"}, {"body": "Hi I'm LOGO Designer Do you have a company or business?To make your business more beautiful?Let's make a logo for your business at affordable prices. 100% satisfaction is my first priority Let's Discuss about your LOGO Fiverr", "score": 0, "created_utc": 1612718716, "company": "samsung"}, {"body": "Hi I'm LOGO Designer Do you have a company or business?To make your business more beautiful?Let's make a logo for your business at affordable prices. 100% satisfaction is my first priority Let's Discuss about your LOGO Fiverr", "score": 0, "created_utc": 1612718709, "company": "samsung"}, {"body": "Who cares,, Just buy DOGECOIN", "score": 0, "created_utc": 1612718422, "company": "samsung"}, {"body": "when ONE UI 3 will be released for Samsung Galaxy M30S??", "score": 1, "created_utc": 1612718238, "company": "samsung"}, {"body": "Why don't I have the new update on my note 10+ UI 3.0 loudly_crying_face or should I wait or when is it coming!!!", "score": 1, "created_utc": 1612716412, "company": "samsung"}, {"body": "please add options change fingerprint and charge animations", "score": 0, "created_utc": 1612715719, "company": "samsung"}, {"body": "thank you for making the S21s camera so well. Now I get to keep this memory forever. #NorthernLights #alberta #canada", "score": 1, "created_utc": 1612714720, "company": "samsung"}, {"body": "thanks for making the S21's camera so well smiling_face_with_heart-eyes now i get to hold on to this memory forever. #NorthernLights #alberta #canada", "score": 0, "created_utc": 1612714130, "company": "samsung"}, {"body": "LOVING MY S21 ULTRA BEST PHONE EVER double_exclamation_mark double_exclamation_mark double_exclamation_mark", "score": 1, "created_utc": 1612713848, "company": "samsung"}, {"body": "IM ASKING MYSELF THO WHY AM I SO BROKE RN loudly_crying_face", "score": 0, "created_utc": 1612713165, "company": "samsung"}, {"body": "Need to bring back SD card slot!!!", "score": 1, "created_utc": 1612711754, "company": "samsung"}, {"body": "Let's do this american_football trophy", "score": 1, "created_utc": 1612710241, "company": "samsung"}, {"body": "When codes one ui 3.1 on s20 ultra ??", "score": 0, "created_utc": 1612710091, "company": "samsung"}, {"body": "needs to work on their portrait mode in their next Ultra.", "score": 0, "created_utc": 1612709961, "company": "samsung"}, {"body": "once again left everyone behind #S21Ultra #GalaxyxBTS #Samsung", "score": 1, "created_utc": 1612707483, "company": "samsung"}, {"body": "launches the #GalaxyS21 #5G Series of #smartphones for the #UAE market. Galaxy S21 Series smartphone priced from AED 3,199 to AED 5,399. Read more about it -", "score": 2, "created_utc": 1612703412, "company": "samsung"}, {"body": "paid more than 2500$ for a Samsung z fold 2 and when I contacted Samsung to have their 5$ screen protector replaced... It was too much to ask for... VERY DISAPPOINTED sad_but_relieved_face", "score": 0, "created_utc": 1612701774, "company": "samsung"}, {"body": "TWO WAY STREET OUT NOW double_exclamation_mark double_exclamation_mark Available on streaming platforms", "score": 0, "created_utc": 1612701367, "company": "samsung"}, {"body": "TWO WAY STREET OUT NOW double_exclamation_mark double_exclamation_mark Available on streaming platforms", "score": 0, "created_utc": 1612701233, "company": "samsung"}, {"body": "TWO WAY STREET OUT NOW double_exclamation_mark double_exclamation_mark Available on streaming platforms", "score": 0, "created_utc": 1612701228, "company": "samsung"}, {"body": "TWO WAY STREET OUT NOW double_exclamation_mark double_exclamation_mark Available on streaming platforms", "score": 0, "created_utc": 1612701223, "company": "samsung"}, {"body": "TWO WAY STREET OUT NOW double_exclamation_mark double_exclamation_mark Available on streaming platforms", "score": 0, "created_utc": 1612701215, "company": "samsung"}, {"body": "TWO WAY STREET OUT NOW double_exclamation_mark double_exclamation_mark Available on streaming platforms", "score": 0, "created_utc": 1612701209, "company": "samsung"}, {"body": "TWO WAY STREET OUT NOW double_exclamation_mark double_exclamation_mark Available on streaming platforms", "score": 0, "created_utc": 1612700848, "company": "samsung"}, {"body": "it seems samsung is making worst phone i agree , no 3.5mm jack is also for thier loss in market because made fool to customers but why wifi direct is not working after update ? what non sense is this.", "score": 0, "created_utc": 1612698882, "company": "samsung"}, {"body": "hi. Dunno which of you this is. I've got restricted MMS but someone sent 2 videos &amp; they came through. Why? And will this cost me money?", "score": 1, "created_utc": 1612698189, "company": "samsung"}, {"body": "your s10+ ruined the phone, go back to the old ui this new one is slower and god awful", "score": 0, "created_utc": 1612697547, "company": "samsung"}, {"body": "Getting every coin in our pockets.. face_with_tears_of_joy", "score": 0, "created_utc": 1612696445, "company": "samsung"}, {"body": "please add heptic feedback while clicking heart on insta twitter tumblr facebook really like it on iphone", "score": 0, "created_utc": 1612693705, "company": "samsung"}, {"body": "my I please have the S21 ultra phantom black ? Sharing is caring.. thank you in advance ;)", "score": 0, "created_utc": 1612692754, "company": "samsung"}, {"body": "You have taken the cost,but given option do not work. writting for last 2 yrs,no one bothers #J7Max.smartview dies not work", "score": 1, "created_utc": 1612692238, "company": "samsung"}, {"body": "Phantom Violet or Black. #GalaxyS21", "score": 0, "created_utc": 1612692175, "company": "samsung"}, {"body": "users beware! After the last update When you edit an image &amp; save.... grimacing_face Your original is gone FOREVER! weary_cat Sami the Cat is NOT impressed pouting_cat ????", "score": 0, "created_utc": 1612690930, "company": "samsung"}, {"body": "the heat caused my front lens to blackout. For phone the flip is useless without its external lens.", "score": 0, "created_utc": 1612690353, "company": "samsung"}, {"body": "my Samsung Flip's exterior lens just went black. It was scary hot and that was the price I had to pay.", "score": 0, "created_utc": 1612690266, "company": "samsung"}, {"body": "As long as you are okay with your watch faces going missing on your Galaxy watch 3 and no one at Samsung willing to help you, the S21U is a good phone.", "score": 0, "created_utc": 1612690043, "company": "samsung"}, {"body": "I love the pictures but why did covered JK's ) tattoos? They are beautiful! purple_heart", "score": 0, "created_utc": 1612689796, "company": "samsung"}, {"body": "#portraitmode on my #S21Ultra5G camera is still causing #flawed blurring of background. Ur laser is not working and AI needs more improvements.", "score": 0, "created_utc": 1612689486, "company": "samsung"}, {"body": "Phantom Brown artist_palette  You usually have to wait for that which is worth waiting for patiently waiting for mine relieved_face", "score": 0, "created_utc": 1612689452, "company": "samsung"}, {"body": "my mobile s9 plus flickering sine update what to do", "score": 0, "created_utc": 1612686784, "company": "samsung"}, {"body": "love my Galaxy A41. Keep hearing i should have received or claimed ear buds. Any info", "score": 0, "created_utc": 1612685945, "company": "samsung"}, {"body": "ATEEZ is having a comeback on March 1st!", "score": 0, "created_utc": 1612685729, "company": "samsung"}, {"body": "Check out the new OnePlus 9. All the details and specifications of the new OnePlus 9 and also about the OnePlus9 pro and OnePlus 9 lite", "score": 0, "created_utc": 1612684344, "company": "samsung"}, {"body": "Till now i did not received my Buds pro more than 15 days waiting", "score": 0, "created_utc": 1612682244, "company": "samsung"}, {"body": "#Donate please 5168755108167020 revolving_hearts revolving_hearts Thank you folded_hands_medium_skin_tone", "score": 0, "created_utc": 1612681984, "company": "samsung"}, {"body": "#Donate please 5168755108167020 revolving_hearts revolving_hearts Thank you folded_hands_medium_skin_tone", "score": 0, "created_utc": 1612681978, "company": "samsung"}, {"body": "#Donate please 5168755108167020 revolving_hearts revolving_hearts Thank you folded_hands_medium_skin_tone", "score": 0, "created_utc": 1612681970, "company": "samsung"}, {"body": "#Donate please 5168755108167020 revolving_hearts revolving_hearts Thank you folded_hands_medium_skin_tone", "score": 0, "created_utc": 1612681964, "company": "samsung"}, {"body": "#Donate please 5168755108167020 revolving_hearts revolving_hearts Thank you folded_hands_medium_skin_tone", "score": 0, "created_utc": 1612681957, "company": "samsung"}, {"body": "#Donate please 5168755108167020 revolving_hearts revolving_hearts Thank you folded_hands_medium_skin_tone", "score": 0, "created_utc": 1612681950, "company": "samsung"}, {"body": "#Donate please 5168755108167020 revolving_hearts revolving_hearts Thank you folded_hands_medium_skin_tone", "score": 0, "created_utc": 1612681942, "company": "samsung"}, {"body": "#Donate please 5168755108167020 revolving_hearts revolving_hearts Thank you folded_hands_medium_skin_tone", "score": 0, "created_utc": 1612681931, "company": "samsung"}, {"body": "#Donate please 5168755108167020 revolving_hearts revolving_hearts Thank you folded_hands_medium_skin_tone", "score": 0, "created_utc": 1612681861, "company": "samsung"}, {"body": "y'all out here scamming Mf's givin em a charging cord with no block.. AND It's a double sided type-C charger so I have to buy a special one face_with_steam_from_nose expressionless_face expressionless_face", "score": 0, "created_utc": 1612681856, "company": "samsung"}, {"body": "#s21ultra's Phantom black and #iphone12promax's Gold-white colours are the best simple colours right now in my opinion.", "score": 2, "created_utc": 1612680839, "company": "samsung"}, {"body": "Samsung the new exynos chip is performing great but still i think it need some improvement on its performance during long term usage.", "score": 0, "created_utc": 1612680005, "company": "samsung"}, {"body": "Why Google Play Services is draining battery 12-15% on my Galaxy S20 (Exynos) daily even after clearing caches. Is there any solution for this.", "score": 0, "created_utc": 1612679891, "company": "samsung"}, {"body": "i purchase new samsung mobile A71 before 1 month Now a time i have problem of media sound suddenly sound is stop after re start the mobile sound is again come back please solve this issue and help me before 10 Yr's i use only samsung mobile", "score": 0, "created_utc": 1612678551, "company": "samsung"}, {"body": "SERIOUSLY? SAMSUNG WE INDIANS NEED QUALCOMM SD OR ATLEST HIRE SOME BRILLIANT MINDS clapping_hands clapping_hands", "score": 0, "created_utc": 1612678086, "company": "samsung"}, {"body": "Hey #samsung.. you know why I'm leaving your brand after 10 years.. because your word autocorrect is terrible on my s10+.. something so simple..", "score": 0, "created_utc": 1612677918, "company": "samsung"}, {"body": "I am upset with my Current Samsung S21 Ultra 512 GB. I am S Series Buyer on Launch day since S8 Flag Ship Phone. No Charger, no cover no headphones is not at all acceptable.Disappointed. PHONE GETS OVERHEATED EVERY TIME WHEN USED CAMERA OR GAME.", "score": 0, "created_utc": 1612677648, "company": "samsung"}, {"body": "Bring back or give us the option for the 44 grid size for folders. One UI 3.0's 34 folder grid is painful to use and look at! #12AppsIsNotEnough", "score": 0, "created_utc": 1612677606, "company": "samsung"}, {"body": "you seriously force users on Mobile Print app to install Microsoft garbage in order to print something by cell phone? Why can't I just use the Mobile Print itself? I don't even have any Microsoft apps, OS or devices here!", "score": 0, "created_utc": 1612677527, "company": "samsung"}, {"body": "Sooo I pre-ordered the S21 and after 3 days of confirming my pre-order I was approved for the $100 credit, but once I verified my order I was then told that I'd receive the $100 credit in 4 to 6 weeks. That's bullshit.. Apple's deal is much more customer friendly.", "score": 0, "created_utc": 1612676811, "company": "samsung"}, {"body": "I dont recommend anyone to buy it .. I have one and it has a big problem and the agent refuses to replace it .. I bought it 30-Junary", "score": 0, "created_utc": 1612671284, "company": "samsung"}, {"body": "i did s21 ultra preorder in UAE. Still haven't received the phone(order 46051665004). And the phone is available in stores with a better offer. I had to pay for the fast charger in preorder. Now its free in stores. Whats the point of preorder. Really frustrating", "score": 0, "created_utc": 1612668903, "company": "samsung"}, {"body": "Iv waited nearly 2 months. Whats the hold up? Your promotions team keep sending me the same email. So no point asking them.", "score": 1, "created_utc": 1612668435, "company": "samsung"}, {"body": "Hey Samsung, life long customer here, I just noticed the EU vesions of your phones don't include the better US snapdragon processors and stopped my order for the s21. Will never purchase from you again unless I can get the best version!", "score": 0, "created_utc": 1612667376, "company": "samsung"}, {"body": "Thanks for the S10+ update bricking my phone. As the battery's non-removable - more thanks for that user-focused decision - I NOW have to run my battery down for X hours &amp; hope I can reboot then. #NotImpressed #BuggyUpdates It better not need a factory reset. /", "score": 0, "created_utc": 1612664631, "company": "samsung"}, {"body": "Ohmy God my cute guys nice just love it too alwayslol keepwell an besafe too love is great enjoy your day godbless love you lots my 4 prince enjoy love it", "score": 0, "created_utc": 1612663825, "company": "samsung"}, {"body": "please change the display settings/software update back! If i wanted a iPhone i would buy one! Fix it", "score": 0, "created_utc": 1612662958, "company": "samsung"}, {"body": "When i retweet your tweets it's because of my BESTIES PICS no more.", "score": 0, "created_utc": 1612662776, "company": "samsung"}, {"body": "Hello samsung. I bought a samsung galaxy s20 fe and i feel scammed! Lost 17% of battery life in 45 minutes of use by just messaging!! Why do you sell this to people?? In my country i cant exchange it, i cant get a refound. I just lost my money for your greed!", "score": 1, "created_utc": 1612662259, "company": "samsung"}, {"body": "Today I received the Android 11 update on my GALAXY Xcover Pro. I'm happy with this update YET still disappointed, AGAIN there is not Always On option available. Why is this function not available on this model?", "score": 2, "created_utc": 1612661514, "company": "samsung"}, {"body": "I have more ways to improve the Samsung company if u are willing to hear dm me what's app me on 08085654253 or email me", "score": 0, "created_utc": 1612661176, "company": "samsung"}, {"body": "i want just replace my new mobile", "score": 0, "created_utc": 1612661021, "company": "samsung"}, {"body": "Give updates to all smartphone you fools", "score": 0, "created_utc": 1612658503, "company": "samsung"}, {"body": "yes the issue in the s10+ has been fixed to an extent with the with the new android 11 update. But still it's an issue and I still believe its a software issue.", "score": 0, "created_utc": 1612657677, "company": "samsung"}, {"body": "maybe take care of the existing bugs on the s20 ultra before releasing something that ain't finished once again,my s20 ultra keeps saying moisture detected in usb port even though it never touched water and it started after I unplugged it and plugged back in , $1500!!!!!!!!!!!!!!", "score": 0, "created_utc": 1612657660, "company": "samsung"}, {"body": "you have some serious optimising to do. Wth happened to RAM management!?", "score": 2, "created_utc": 1612656299, "company": "samsung"}, {"body": "Thank you ! I will buy it next mouth ! smiling_face_with_heart-eyes", "score": 1, "created_utc": 1612655397, "company": "samsung"}, {"body": "why after update I can't connect to 5G WiFi and my mobile data is only on H+, not usual 4G?", "score": 0, "created_utc": 1612654470, "company": "samsung"}, {"body": "Improve speed", "score": 0, "created_utc": 1612653127, "company": "samsung"}, {"body": "I'm trading in my phone. I did a factory reset but forgot to log out of my Gmail, yahoo, samsung account. Will that be an issue? When I reset I had to put in my password in order to proceed.", "score": 0, "created_utc": 1612652974, "company": "samsung"}, {"body": "so I just learned my device maintenance was removed in a sleezy attempt to force me to get a new phone...I can assure you that you have lost a customer for life. I will be looking into non samsung phones from nown on.", "score": 0, "created_utc": 1612652297, "company": "samsung"}, {"body": "the new update has totally ruined the notification experience on the phone. It covers up the entire screen. Volume notification is wrong way! Yuck! Help? Change it back?", "score": 1, "created_utc": 1612652255, "company": "samsung"}, {"body": "Galaxy M30s mobile in Any software update one UI 2.1/2.5/3.0?? Another M21, M31, M31s, M51 fast update. Please give us a faster update for M30s.", "score": 1, "created_utc": 1612651570, "company": "samsung"}, {"body": "I had the s9 and just upgraded my phone. But now I can't group message with more than 10 recipients. Why is that?? And when is it going to be fixed??? This is making me want to go back to my old phone expressionless_face", "score": 0, "created_utc": 1612650881, "company": "samsung"}, {"body": "MY OS or hardware not working securely YOUR local authorised service centre N dealer not supporting genuinely At 414003 REFER DM TO YOU FOR MY CONTACT DETAILS", "score": 0, "created_utc": 1612650274, "company": "samsung"}, {"body": "with the new update I am facing issue with my keyboard as the app keep getting stopped..kindly check.. #Samsung #issue", "score": 1, "created_utc": 1612649352, "company": "samsung"}, {"body": "I bought Samsung M31 last year on July. It worked well until this January. The screen automatically is sensing, and is lagging ...I have to wipe it everytime with a dry cloth. I was bearing it up until the lower portion of screen got a little scratch", "score": 2, "created_utc": 1612649316, "company": "samsung"}, {"body": "When we get the UI 3.0 MEANS ANDROID 11 update in m30s", "score": 0, "created_utc": 1612647116, "company": "samsung"}, {"body": "I am very highly disappointed with the Samsung service center in Rishikesh. They try to cheating me and your VOC Team support in case. Job sheet-4317603238", "score": 0, "created_utc": 1612646949, "company": "samsung"}, {"body": "Galaxy buds pro When is the release date in Japan", "score": 0, "created_utc": 1612645332, "company": "samsung"}, {"body": "Hlo we are using Samsung A50 mobile from 6months in a smooth manner.Even the mobile doesn't have any crack on it.even it didn't fall on the floor. Suddenly the mobile is dead now.. In, samsung service centre they are saying that the complaint is with the motherbord", "score": 0, "created_utc": 1612643415, "company": "samsung"}, {"body": "WHY are you NOT addressing Samsungs incredibly huge fail in getting our S21s to us on time?? Preordered #S21Ultra256gb from Release was Jan 29th. It's now 9 days AFTER launch &amp; a VERY large # of ppl don't have any information AT ALL about receiving them.", "score": 1, "created_utc": 1612642296, "company": "samsung"}, {"body": "I'm trading in my phone. Backed up my data and files and did factory reset. But forgot to log out of accounts like samsung, Gmail, yahoo. Will that be an issue?", "score": 0, "created_utc": 1612642113, "company": "samsung"}, {"body": "ever since I updated my phone. It's been running slower than ever. phones looking real tasty right now", "score": 0, "created_utc": 1612641905, "company": "samsung"}, {"body": "Bring back or give us the option for the 44 grid size for folders. One UI 3.0's 34 grid is painful to use and look at! #12AppIsNotEnough", "score": 0, "created_utc": 1612640878, "company": "samsung"}, {"body": "you are killing it with s21 ultra. call_me_hand call_me_hand fire", "score": 0, "created_utc": 1612640453, "company": "samsung"}, {"body": "when does the 3.0 one u.i. update come out for the note 20 ultra SM N9860??", "score": 1, "created_utc": 1612639310, "company": "samsung"}, {"body": "should bring an update to rectify the heating in #GalaxyS21Ultra Back of the phone heats even during normal usage viz; Twitter, WhatsApp etc.", "score": 0, "created_utc": 1612638249, "company": "samsung"}, {"body": "HOW DO YOU GET RID OF THIS ANNOYING NOTIFICATION", "score": 0, "created_utc": 1612636745, "company": "samsung"}, {"body": "is not interested in birds??? How about windmills for your wallpaper??? #SamsungGalaxyS21 #samsungmobile #samsungindia", "score": 0, "created_utc": 1612635398, "company": "samsung"}, {"body": "TWO WAY STREET OUT NOW double_exclamation_mark double_exclamation_mark Available on streaming platforms", "score": 0, "created_utc": 1612634869, "company": "samsung"}, {"body": "TWO WAY STREET OUT NOW double_exclamation_mark double_exclamation_mark Available on streaming platforms", "score": 0, "created_utc": 1612634701, "company": "samsung"}, {"body": "TWO WAY STREET OUT NOW double_exclamation_mark double_exclamation_mark Available on streaming platforms", "score": 0, "created_utc": 1612634694, "company": "samsung"}, {"body": "TWO WAY STREET OUT NOW double_exclamation_mark double_exclamation_mark Available on streaming platforms", "score": 0, "created_utc": 1612634688, "company": "samsung"}, {"body": "TWO WAY STREET OUT NOW double_exclamation_mark double_exclamation_mark Available on streaming platforms", "score": 0, "created_utc": 1612634681, "company": "samsung"}, {"body": "TWO WAY STREET OUT NOW double_exclamation_mark double_exclamation_mark Available on streaming platforms", "score": 0, "created_utc": 1612634644, "company": "samsung"}, {"body": "what is the song used in the Meet the new face of Galaxy commercial? PLEASE tell me", "score": 0, "created_utc": 1612634155, "company": "samsung"}, {"body": "Samsung please improve this, already purchased exynos 2100 model OTA plz", "score": 0, "created_utc": 1612633539, "company": "samsung"}, {"body": "WORST COMPANY EVER. Their warranty program sucks! New phone only 45 days old. They wont replace the phone. I guess its time to move to I-Phone", "score": 0, "created_utc": 1612631833, "company": "samsung"}, {"body": "Definitely different than the s20 cause that one came WITH A CHARGER face_screaming_in_fear", "score": 0, "created_utc": 1612631131, "company": "samsung"}, {"body": "Do they know that it DOESN'T come with a CHARGER????", "score": 0, "created_utc": 1612631086, "company": "samsung"}, {"body": "How exactly do you \"fight gender inequality\" outside of genetically engineering new humans to erase millions of years of evolution that resulted in human sexual dimorphism? By giving females super privileges? Please stop doing this insane gibberish and focus on f**king phones.", "score": 0, "created_utc": 1612631082, "company": "samsung"}, {"body": "What color is the charger? OH WAIT it doesn't come with one thumbs_down_light_skin_tone", "score": 0, "created_utc": 1612631001, "company": "samsung"}, {"body": "A freaking electronic device should come with a freaking CHARGER !!!!!", "score": 0, "created_utc": 1612630884, "company": "samsung"}, {"body": "But no charger.... WTF????", "score": 0, "created_utc": 1612630819, "company": "samsung"}, {"body": "fix the bug in the s10 moisture detected my ring", "score": 0, "created_utc": 1612630582, "company": "samsung"}, {"body": "dear fcktards...how about you warn us with a persistent notification that the device is \"not registered on a network\" so that we realise there is an ongoing problem with calls and SMS! Surely you can do this BEFORE we attempt a call 12hrs later.... #fail #samdung", "score": 0, "created_utc": 1612627269, "company": "samsung"}, {"body": "There better be a note 21 uptra this year if not I'm switching Lol", "score": 0, "created_utc": 1612625850, "company": "samsung"}, {"body": "your ANC is garbaggio beans. Do better.", "score": 0, "created_utc": 1612620816, "company": "samsung"}, {"body": "your messaging app is terrible", "score": 0, "created_utc": 1612620282, "company": "samsung"}, {"body": "sort out your damn keyboard correcting every fucking correct word", "score": 0, "created_utc": 1612618874, "company": "samsung"}, {"body": "WTF? Screw you Samsung. Galaxy S21 Samsung didn't bring back the headphone jack and here's why - CNET", "score": 0, "created_utc": 1612618599, "company": "samsung"}, {"body": "I was going to upgrade my pixel 3 to a Galaxy 21 until I saw No headphone jack. No charger. No headphones? At $800 you should be able to include these! WTF Samsung???? STOP COPYING APPLE. I don't buy their products either. #BoycottSamsungMobile", "score": 0, "created_utc": 1612618447, "company": "samsung"}, {"body": "You want me to wait till 15th February 2021 (are you sure on 15th February?) to get my charger? Provide me solution or refund d amount. I will return my phone Galaxy ultra 21 and accessories back to Samsung Canada for full refund.#poorservice", "score": 0, "created_utc": 1612617709, "company": "samsung"}, {"body": "Is One UI 3.1 going to be released on S20 device?", "score": 0, "created_utc": 1612615107, "company": "samsung"}, {"body": "i believe in you", "score": 0, "created_utc": 1612610132, "company": "samsung"}, {"body": "how come there is no trash for deleted voice-mails on my Note 20 Ultra ?", "score": 0, "created_utc": 1612607531, "company": "samsung"}, {"body": "Samsung S10 #samsungsponsorship hopes, goals, wishes, dreams, desires.... Asheville, NC area 10/22/2020 and 1/21/2020 More at 60,000 photo archive available of ships, beings, otherworldly phenomena in our skies....", "score": 0, "created_utc": 1612606259, "company": "samsung"}, {"body": "that Note stylus is the greatest thing ever. Please keep it (in the device)", "score": 0, "created_utc": 1612605653, "company": "samsung"}, {"body": "competes with While Galaxy Note 8 2017 Q4 device still have Android 9 (came in 2018). iPhone 8 2017 device will get iOS 15 (2021) OS. Shameful. #samsung #Apple #SamsungGalaxy #ios #android Except for prize nothing matches.", "score": 4, "created_utc": 1612604505, "company": "samsung"}, {"body": "thanks for being super cheap and no longer including a wall charger. Never thought in 2021 you would get a new electronic without a charger #cheap", "score": 0, "created_utc": 1612600806, "company": "samsung"}, {"body": "LOWER THE NOISE REDUCTION ON THE EXYNOS VERSION, YOU ARE LITERALLY DESTROYING THE PICTURES AND VIDEOS WITH YOU TERRIBLE NOISE REDUCTION SMEARING.", "score": 0, "created_utc": 1612600255, "company": "samsung"}, {"body": "Why are your exynos version comparibly worse on low light videos? I mean a TON worse. Whoever got put on the camera software for the exynos version has done terrible work. PLEASE DIAL THE NOISE REDUCTION DOWN ON ALL MODES, GRAIN ARE DETAILS", "score": 0, "created_utc": 1612599964, "company": "samsung"}, {"body": "my phone has updated with Android 11 &amp; now It won't connect to my broadband? I feel like a stranger in my own house #Android11 #android11wifi", "score": 1, "created_utc": 1612599124, "company": "samsung"}, {"body": "Design is Good but It's very uncomfortable in the ear My ear Hurts.", "score": 0, "created_utc": 1612595931, "company": "samsung"}, {"body": "I request to you that, we are paying about Rs 30000 for a Normal Mobile Phone, so please give atleast 1 meter Data cable to Charge that Phone, We are ready to pay Rs 1000 extra but plz provide 1Meter Data Cale.           ", "score": 0, "created_utc": 1612595901, "company": "samsung"}, {"body": "The note 20 ultra 5g does not disappoint. WOW. I liked my S8 well enough but this thing is incredible.", "score": 0, "created_utc": 1612595401, "company": "samsung"}, {"body": "phone I have bought recently come with Flipboard Briefing app preinstalled. This app highlightes political news in Turkey from biased media. It is not possible to UNINSTALL it. Please don't force us to use this kind of untrusted news applications.", "score": 2, "created_utc": 1612593922, "company": "samsung"}, {"body": "Hallo, just want to let you know that the finger sensor in the new #GalaxyS21 is working really bad with glass 9H screen protector, even the more sensitivity sensor option is on. I tryied allrady 3 different glasses and is the same. #SamsungGalaxyS21", "score": 0, "created_utc": 1612593472, "company": "samsung"}, {"body": "sad to know when u start following the competitor blindly how can u remove headfone jack and not provide charger while old charger is 15W and S21Ultra has 25W battery... what a shame being loyal for a decade to Samsung its time to switch to Huawei #GalaxyS21Ultra", "score": 0, "created_utc": 1612593380, "company": "samsung"}, {"body": "Dear Samsung, Today I compared my Galaxy A7 2018 Indian variant with the Kuwait variant of Galaxy A7 2018, you have provided metal frame body design to that phone in Kuwait, and in India you are providing plastic frame.", "score": 1, "created_utc": 1612592725, "company": "samsung"}, {"body": "We don't have any issue unlocking our phones with masks on.", "score": 0, "created_utc": 1612592666, "company": "samsung"}, {"body": "sometimes my S21 ultra will play a message tone when I receive a text and other times it will only vibrate... I've been through all sound settings and everything is set to loud... is this a software issue?", "score": 0, "created_utc": 1612592027, "company": "samsung"}, {"body": "apparently this is a common issuesfor the #galaxybudsplus. All kind of fixes done and still the same shit. So what now?", "score": 0, "created_utc": 1612591826, "company": "samsung"}, {"body": "wat happen to galaxy", "score": 0, "created_utc": 1612591248, "company": "samsung"}, {"body": "galaxy f41 heating problem after the android 11 update battery drain faster than before ,after restart the phone the phone suddenly heat very high everytime..", "score": 1, "created_utc": 1612587926, "company": "samsung"}, {"body": "add a mic to the S Pen smiling_face_with_smiling_eyes especially for this new age of online calls, it would be a great function folded_hands_medium-dark_skin_tone", "score": 0, "created_utc": 1612587493, "company": "samsung"}, {"body": "can you please tell me what the connection distance is between the galaxy buds pro and a mobile device ?? Airpods apparently the top far connection distance of 100 feet .... What is galaxy buds pro ?? 10 feet ?", "score": 0, "created_utc": 1612587360, "company": "samsung"}, {"body": "How long does it take someone to look at a picture? Been over a week since my registration was summited and the email I received said it should of taken 24 hours....", "score": 0, "created_utc": 1612587273, "company": "samsung"}, {"body": "I never wanted to write you guys here but now I'm really disappointed from your service. I can't explain how upset I'm. I use Samsung Galaxy Note 10 and there was some issue in display.", "score": 1, "created_utc": 1612587213, "company": "samsung"}, {"body": "Thankyou fr most disgusting experience. Placed ord for #S21 on 2Feb and you guys cancelled it on 6th, afta a day da discount ofr ended. Reasn area nt serviceable, though portal prechecked by pincode. Shd dis b last tym m buying something #Samsung", "score": 1, "created_utc": 1612586352, "company": "samsung"}, {"body": "Hi guys, I would recommend a great Solar Lights seller on Amazon which I bought from and used for years, really got great fun and charming lighting atmosphere around house. Here is the beautiful solar flame lights I like so much", "score": 0, "created_utc": 1612584335, "company": "samsung"}, {"body": "What a great purchase Note20 Ultra was... No thanks,", "score": 0, "created_utc": 1612583305, "company": "samsung"}, {"body": "have i mentioned lately how awful the A50 is? How the Smart Unlock only works in my car like once every 3 months and never at my home where the settings are set to. Or how the fingerprint scanner has never worked.", "score": 2, "created_utc": 1612581416, "company": "samsung"}, {"body": "bought #tabS6Lite and now a sufferer. I want a replaced product or my money back. #refundmymoney Bought on #30thjan21 but a note was already in tab of #11thjan21. The #Spen was also not working fine. The tab is with showroom now #zeroconcernforus", "score": 5, "created_utc": 1612581255, "company": "samsung"}, {"body": "I have been unable to charge my phone for 2 days now, as it says there is water droplets around the charge port. My phones been nowhere near water and I have dried it multiple times with cold are blow in the port. Yet it still won't let me charge. Any suggestions.", "score": 1, "created_utc": 1612581241, "company": "samsung"}, {"body": "Such premium phones and such great quality! hundred_points Unlike iPhones who's colour fades off in less than 3 months and then refuses to replace the defective device. Samsung is truly the epitome of luxury phones. #shameonapple", "score": 0, "created_utc": 1612580641, "company": "samsung"}, {"body": "is Galaxy S21 series launched in a hurry. Pathetic service. I bought a device couple of days back. Trying to buy charger adapter n back cover for my S21+ for last 2 days thru ur online store. It sucks. Too many issues. Plz help. #poorcustomerservice", "score": 1, "created_utc": 1612578858, "company": "samsung"}, {"body": "We can see only in videos only face_with_tears_of_joy", "score": 0, "created_utc": 1612576510, "company": "samsung"}, {"body": "Omg it's dream phone.", "score": 0, "created_utc": 1612576494, "company": "samsung"}, {"body": "So handsome. Simply ending all models career", "score": 0, "created_utc": 1612576418, "company": "samsung"}, {"body": "Nice video I like your style", "score": 2, "created_utc": 1612576383, "company": "samsung"}, {"body": "i don't waste money on color combination.. i spend money on performance, optimized &amp; powerfull processor. Which is S21 Ex not.", "score": 0, "created_utc": 1612575678, "company": "samsung"}, {"body": "tiktok button are burned into my phone screen. How can this be fixed? And the bad thing is that it's on my daughter's phone too.", "score": 0, "created_utc": 1612574914, "company": "samsung"}, {"body": "How on earth did I miss this", "score": 0, "created_utc": 1612574797, "company": "samsung"}, {"body": "Mine is M31 the text part on the app &amp; chrome has a text stroke, how to remove, also suggest way to improve call quality (volume) voice for outgoing &amp; incoming the voice is very very low", "score": 0, "created_utc": 1612574691, "company": "samsung"}, {"body": "Think my Notes will be my last Samsung mobile until they change to Snapdragon processor in UK. I will change to best in market with Snap 888 this year. Goodbye Samsung...", "score": 0, "created_utc": 1612573876, "company": "samsung"}, {"body": "Why don't you offer your tizen to huawei and xiaomi", "score": 0, "created_utc": 1612573783, "company": "samsung"}, {"body": "Please tell me how to completely disable the Bixby voice assistant on your phones, my god it's awful", "score": 0, "created_utc": 1612573591, "company": "samsung"}, {"body": "might as well get #WENDY as your endorser blue_heart blue_heart", "score": 2, "created_utc": 1612572785, "company": "samsung"}, {"body": "when is the Samsung Galaxy Watch #Active3 coming out?", "score": 0, "created_utc": 1612571700, "company": "samsung"}, {"body": "you're new update has ruined my Samsung face_with_tears_of_joy app notification colours have gone everything is one colour thinking_face", "score": 0, "created_utc": 1612571429, "company": "samsung"}, {"body": "I just started using the exynos version of the s21 ultra. And once gain reviews online shows you have sold to Europe an inferior product compared to the snapdragon version. We pay more technically and you sell us the lesser product.", "score": 0, "created_utc": 1612569598, "company": "samsung"}, {"body": "samsung pay with when ??", "score": 0, "created_utc": 1612569174, "company": "samsung"}, {"body": "That is why apple is far better than u guys,the screen will never fail and even if it fails it cheap to replace", "score": 0, "created_utc": 1612568631, "company": "samsung"}, {"body": "I want to use this opportunity to tell u guys that u are fraud. How can I buy a phone for $1000 and screen will be messing up,do u guys think we pick money on the floor or what.i have a note 9 that is messing upyou guys should change don't 419 us with fake screen", "score": 0, "created_utc": 1612568311, "company": "samsung"}, {"body": "you hear mes", "score": 3, "created_utc": 1612567242, "company": "samsung"}, {"body": "Sir . I am use samsung s10 plus I am tirupur have change display after paid service but ip 68 not work I have test water In 5 minutes my mobile camara not work mobile Front camera back camera full water service center poor quality plsss help me my call", "score": 0, "created_utc": 1612563669, "company": "samsung"}, {"body": "Hi guys, I would recommend a great Solar Lights seller on Amazon which I bought from and used for years, really got great fun and charming lighting atmosphere around house. Here is the beautiful Solar fence post lights I like so much", "score": 0, "created_utc": 1612562173, "company": "samsung"}, {"body": "SAMSUNG India is selling defective refurbished, non repairable and non returnable, products, you will be forced to visit Samsung service till warranty is expired. #SamsungUselessRefurbishedProducts.service ref no 4315916463", "score": 0, "created_utc": 1612561675, "company": "samsung"}, {"body": "SAMSUNG India is selling defective refurbished, non repairable and non returnable, products, you will be forced to visit Samsung service till warranty is expired. #SamsungUselessRefurbishedProducts.service ref no 4315916463", "score": 0, "created_utc": 1612561652, "company": "samsung"}, {"body": "we got impressed by seeing improvement you have did. But still need to get more. Hope it to be solved with AMD", "score": 1, "created_utc": 1612559674, "company": "samsung"}, {"body": "Nice product best in class but connectivity issue with Galaxy watch 3.", "score": 0, "created_utc": 1612559518, "company": "samsung"}, {"body": "very Good brand very fond of samsung mobile since user of this brand but now facing issue with latest Galaxy watch 3 and buds pro connectivity,same issue was with My old gear sports and buds connectivity not happy with this.", "score": 0, "created_utc": 1612559210, "company": "samsung"}, {"body": "**when can we expect the custom colors in INDIA?** in direct conversion USA S21 Ultra with Custom color cost $1250 that's approx INR 90K and the one in india with 2 color options is for INR 105K OR $1,442 and still we don't have this custom color option.", "score": 0, "created_utc": 1612557018, "company": "samsung"}, {"body": "Y'all make some shitty ass phones fr fire hundred_points", "score": 0, "created_utc": 1612556349, "company": "samsung"}, {"body": "how to place order for the custom colored s21 ultra?", "score": 0, "created_utc": 1612555705, "company": "samsung"}, {"body": "Lo ve btsXarmy", "score": 0, "created_utc": 1612554709, "company": "samsung"}, {"body": "#Samsung Took this with your amazing camera on the Samsung galaxy s20 fe", "score": 0, "created_utc": 1612554445, "company": "samsung"}, {"body": "all of sudden my Galaxy watch 3 doesn't respond with my note 20 ultra. Now resetting watch. Not happy", "score": 0, "created_utc": 1612553585, "company": "samsung"}, {"body": "What's the use if the quality of the product is not good and everywhere cheater in Samsung who will try to get advantage if product stop working", "score": 0, "created_utc": 1612552888, "company": "samsung"}, {"body": "so i have the samsung galaxy s7 phone. but this issue just annoys me. everytime i stop recording on the camera app, the record limit gets shortwr and i rlly wanna record a movie. please fix it loudly_crying_face . make the limit just at least 1h and 8m. and no shoter limits", "score": 0, "created_utc": 1612552715, "company": "samsung"}, {"body": "why dont you guys send the charging box with the cable for the new 21+?????", "score": 0, "created_utc": 1612552010, "company": "samsung"}, {"body": "Please get us the Qualcomm", "score": 1, "created_utc": 1612551565, "company": "samsung"}, {"body": "has the worse battery in the industry currently. Phone is amazing,sleek thin and processing speed is great. Battery though is poor and connection and GPS is poor. Easily resolved. Please do a quick turn around!", "score": 0, "created_utc": 1612550583, "company": "samsung"}, {"body": "I wish all your phones and tablets had magnetometer built in them. Can't install and use any compasses. I just bought a Galaxy A10 and no magnetometer built in it, so I can't use any compasses from Google Play. That stinks!!!!!!", "score": 0, "created_utc": 1612550492, "company": "samsung"}, {"body": "I am disappointed with samsung services, bought #S21Ultra along with cover, by mistake I ordered S21+ cover now Samsung India says we do not take return ones deliver. What to do with 55USD Cover. I just want to return that cover.", "score": 1, "created_utc": 1612549762, "company": "samsung"}, {"body": "I find Bixby routines very useful and cool. It would be good if you can add a Bixby routine to change wallpaper.", "score": 0, "created_utc": 1612548187, "company": "samsung"}, {"body": "Stop scamming people with ur crappy exynos and deliver the same phone everywhere ffs!!!!!!", "score": 0, "created_utc": 1612547749, "company": "samsung"}, {"body": "You guys are making customers fool. Your service center is making customers fool. They way treat their customer is totally worthless. I am facing an issue from last 4 month and I am helpless.", "score": 0, "created_utc": 1612546069, "company": "samsung"}, {"body": "In India need to change return policy I bought S21 Ultra along with clear view cover worth 55USD, by mistake ordered S21+ cover now they says we do not take return goods ones deliver. What to do with that cover now?#S21Ultra #Samsungindia #SamsungGalaxyS21", "score": 0, "created_utc": 1612545619, "company": "samsung"}, {"body": "Why are selfies reversed left to right? How hard would it bee to fix that? Zoom does it by default.", "score": 0, "created_utc": 1612543670, "company": "samsung"}, {"body": "I can't even answer my phone now!!!! The new update sucks!!!", "score": 0, "created_utc": 1612541590, "company": "samsung"}, {"body": "can you please send me my new phone? pleading_face I know yall said end of February but maybe dont show so many commercials showing it", "score": 2, "created_utc": 1612540995, "company": "samsung"}, {"body": "Why do you keep using different CPU in the same phone?", "score": 0, "created_utc": 1612538727, "company": "samsung"}, {"body": "To say I am very unhappy is an understatement, as I have carried out an update for my S8 and the phone now constantly reboots. Believe me I am seething and this seems to happen quite often with your updates. Please have the decency to reply back.", "score": 0, "created_utc": 1612537053, "company": "samsung"}, {"body": "I picked the #PhantomNavy colour. Payed extra to have it delivered at the time and day I chose. Just received a text saying my #SamsungGalaxyS21Ultra will be arriving a day late. Where do I complain about it?", "score": 0, "created_utc": 1612536656, "company": "samsung"}, {"body": "your update broke my phone please fix it I have a note 10 I can't use the navigation bar or change things in settings.", "score": 0, "created_utc": 1612536520, "company": "samsung"}, {"body": "you are cool dab lol xd uwu", "score": 0, "created_utc": 1612536264, "company": "samsung"}, {"body": "NOBODY LOOKING AT YOUR DAMN PHONE face_with_rolling_eyes face_with_rolling_eyes face_with_rolling_eyes", "score": 0, "created_utc": 1612533569, "company": "samsung"}, {"body": "For God's sake #Samsung #stop_making_glass_phones", "score": 0, "created_utc": 1612533228, "company": "samsung"}, {"body": "bring back the retina scanner.", "score": 0, "created_utc": 1612530657, "company": "samsung"}, {"body": "Superb quality gem_stone OK_hand_medium-light_skin_tone # # #V # #Taehyung #BTSV # # # #KimTaehyung", "score": 0, "created_utc": 1612530114, "company": "samsung"}, {"body": "I pick phone with a charger", "score": 0, "created_utc": 1612524746, "company": "samsung"}, {"body": "Exceptional design with exceptional work by making the box smaller and copying other brands. Well done Samsung.", "score": 0, "created_utc": 1612524682, "company": "samsung"}, {"body": "shame samsung request u to improve &amp; update via OTA", "score": 0, "created_utc": 1612524588, "company": "samsung"}, {"body": "This is how you treat your customer? Making a fool out of their money?", "score": 0, "created_utc": 1612523510, "company": "samsung"}, {"body": "feel cheated by buying Samsung s21 plus phone. Its camera is very useless. Every member of my house has a Samsung mobile, their cameras are also better than s21plus. 7869007516.", "score": 0, "created_utc": 1612522735, "company": "samsung"}, {"body": "What a daunting experience. Apps do not sync in background. Erratic scroll. Annoying keyboard. Tons of useless Samsung malware. Bad performance. Bad battery life.", "score": 1, "created_utc": 1612522690, "company": "samsung"}, {"body": "feel cheated by buying Samsung s21 plus phone. Its camera is very useless. Every member of my house has a Samsung mobile, their cameras are also better than s21plus. 7869007516.", "score": 0, "created_utc": 1612522567, "company": "samsung"}, {"body": "very bad camera samsung S21plus", "score": 0, "created_utc": 1612522444, "company": "samsung"}, {"body": "#S21 Part 2", "score": 12, "created_utc": 1612522174, "company": "samsung"}, {"body": "You should make it so the phone does not dim at 5% also that shit is so annoying", "score": 0, "created_utc": 1612520905, "company": "samsung"}, {"body": "You should remove the volume warning at 75% that shit is so annoying", "score": 0, "created_utc": 1612520886, "company": "samsung"}, {"body": "I like how your support line just hangs up", "score": 0, "created_utc": 1612519315, "company": "samsung"}, {"body": "Exynos 2100 is great but needs sustained performance, which mostly can be attained by keeping the processor run cooler. Using same cooling solution, why SD888 runs cooler than Exynos 2100? Need to find!!", "score": 0, "created_utc": 1612518486, "company": "samsung"}, {"body": ", the day you bring Qualcomm enabled Ultra models in India .I will consider buying 1 . Till then NOPE.", "score": 0, "created_utc": 1612518442, "company": "samsung"}, {"body": "why does Samsung treat Europe like second class citizens? Give us Snapdragon already! Yeah it's better this year but still we pay more money for less performance then US", "score": 0, "created_utc": 1612517090, "company": "samsung"}, {"body": "The phone both looks well and performs well, if you are on the snapdragon version. This year's exynos is better than previous, but still much slower in sustained tests. Why can't we, the customers, be allowed to decide which version we want?", "score": 0, "created_utc": 1612516478, "company": "samsung"}, {"body": "Not letting hide notch on OneUI 3.0 is super annoying.", "score": 0, "created_utc": 1612516476, "company": "samsung"}, {"body": "You don't necessarily need an expensive phone to take great photos. My daughter took this on her Samsung Galaxy A51 today.", "score": 0, "created_utc": 1612516344, "company": "samsung"}, {"body": "Jin's too Hot!", "score": 0, "created_utc": 1612516262, "company": "samsung"}, {"body": "are you giving everyone 10 sets of earbuds? If so, I'd like to claim this please.", "score": 0, "created_utc": 1612516066, "company": "samsung"}, {"body": "what an actual joke. Phone delivery is 6 days late and no one can tell me where it is or what's going on? You were right I should have went iPhone", "score": 1, "created_utc": 1612515915, "company": "samsung"}, {"body": "And again where getting screwed with the inferior Exynos chip in the galaxy lineup. Yes after 15 years (my first mobile Samsung D600) my next phone won't be a Samsung.", "score": 0, "created_utc": 1612515601, "company": "samsung"}, {"body": "need to fix this data crap. I've been roaming for 3 days. WTF?? 5G is B.S.", "score": 0, "created_utc": 1612515316, "company": "samsung"}, {"body": "Why not plug an Ethernet to USB-C cable into you phone or tablet for improved speeds and no mobile data usage.", "score": 0, "created_utc": 1612514708, "company": "samsung"}, {"body": "the Galaxy Buds Pro frequently lower the vol of music playing as though there was a notification, but there is no notification... It would be cool if there was a \"Do Not Disturb during playback from these apps\" setting.", "score": 0, "created_utc": 1612514440, "company": "samsung"}, {"body": "Preordered this phone Jan 27 and I have call them 3 times because the phone has not shipped. If they do not have the model I ordered they should send me an upgrade. When I call no one has an explanation on why it has not shipped.", "score": 1, "created_utc": 1612514250, "company": "samsung"}, {"body": "I LOVE YOU.", "score": 3, "created_utc": 1612513475, "company": "samsung"}, {"body": "why can't I find the leather case for the S21 Ultra anywhere thinking_face thinking_face thinking_face I need that case expeditiously!", "score": 0, "created_utc": 1612513089, "company": "samsung"}, {"body": "it's not epic until I can buy with #dogecoin #doge #dogecoinarmy", "score": 1, "created_utc": 1612512618, "company": "samsung"}, {"body": "I chose Phantom Navy. It's stunning! Good job ! S21 Ultra is one stop away from perfection - you should keep microSD card slot. However I'm happy with my purchase )", "score": 7, "created_utc": 1612512428, "company": "samsung"}, {"body": "Get the Snapdragon variant everywhere and throw exynos in the bin.", "score": 2, "created_utc": 1612511291, "company": "samsung"}, {"body": "chuck exynos chipsets in the dustbin.", "score": 0, "created_utc": 1612511217, "company": "samsung"}, {"body": "Your Exynos is still inferior to Snapdragon and also has throttling issues like the previous chip. Please fix this or the sales will again drop rapidly", "score": 0, "created_utc": 1612510815, "company": "samsung"}, {"body": "The Exynos version of the S21 Ultra was designed to be used as an iron-box or a toaster? What's going on guys? person_facepalming_dark_skin_tone raising_hands_dark_skin_tone #GalaxyS21Ultra #Exynos #SamsungGalaxyS21Ultra #Samsung", "score": 0, "created_utc": 1612510358, "company": "samsung"}, {"body": "why is it showing a lock on my screen on games when i press the recent or back button and wont let me", "score": 0, "created_utc": 1612509682, "company": "samsung"}, {"body": "I got the ultra in navy and man, I can't wait til it arrives.", "score": 1, "created_utc": 1612509429, "company": "samsung"}, {"body": "Dear samsung, why did you put the hyung line at the back? Especially j-hope. I don't wanna sound a solo stan but the fact you just shows the maknae line as models instead of the hyung line. BTS is seven, if you don't admit it just pick other artist as your model.", "score": 1, "created_utc": 1612508756, "company": "samsung"}, {"body": "I'm sending you this video with my Samsung phone. The short meditation video check it out.", "score": 0, "created_utc": 1612508057, "company": "samsung"}, {"body": "I have an A40 mobile, 9 months old, still under warranty. How do I get in contact with someone with whom I can arrange a repair.? The chatbot options is sending me around in circles. I bought in on Amazon, but they won't help.", "score": 0, "created_utc": 1612507326, "company": "samsung"}, {"body": "just a heads up. assistant is fucked up after android 11 update. It won't understand simple commands as navigating. It keeps saying... I think you want to navigate or sorry I couldn't understand. fix it!!!! Galaxy S10+", "score": 0, "created_utc": 1612506268, "company": "samsung"}, {"body": "if snapdragon 888 best then why exynos 2100?", "score": 1, "created_utc": 1612505743, "company": "samsung"}, {"body": "Why do you never make the nice colors for the ultimate ultra version?? I want red. RED.", "score": 0, "created_utc": 1612505670, "company": "samsung"}, {"body": "just got my S10e upgraded to OneUi 3.0, great job but I really miss one feature that got removed. I like the edge notifications with the screen turned off, but not with the screen on. I had a choice before but not now, it's either on or off. Why?", "score": 0, "created_utc": 1612505647, "company": "samsung"}, {"body": "Give the option to buy Snapdragon version as it is reliable then Exynos", "score": 0, "created_utc": 1612505610, "company": "samsung"}, {"body": "give the option to buy Snapdragon version of s21 ultra as Exynos is not as reliable as Snapdragon", "score": 1, "created_utc": 1612505520, "company": "samsung"}, {"body": "the phantom pink or violet smiling_face_with_hearts smiling_face_with_hearts smiling_face_with_hearts smiling_face_with_hearts smiling_face_with_hearts purple_heart", "score": 0, "created_utc": 1612505441, "company": "samsung"}, {"body": "Secure Folder is logically pointless. When you add an apps into Secure Folder, you'll have TWO similar apps. The other one is the \"unsecure\" version in the regular apps list. Now you have to manage two with extra steps of \"securely\" login. Horrible #uxdesign", "score": 0, "created_utc": 1612505270, "company": "samsung"}, {"body": "Any explanations on this matter ? Selling faulty phones in Europe and many other places.", "score": 1, "created_utc": 1612504496, "company": "samsung"}, {"body": "Any explanations on this matter ? Selling faulty phones in europe and many places.", "score": 1, "created_utc": 1612504430, "company": "samsung"}, {"body": "Lmao, we're just watching your ads for bts so..", "score": 0, "created_utc": 1612504282, "company": "samsung"}, {"body": "Why are they all horrible and dull?", "score": 1, "created_utc": 1612504252, "company": "samsung"}, {"body": "you better get your shit together with your fucking 'smartphones' shit completely froze up for no reason pile_of_poo", "score": 0, "created_utc": 1612503934, "company": "samsung"}, {"body": "JIMIN'S LUXURY ACCESSORIES", "score": 0, "created_utc": 1612503905, "company": "samsung"}, {"body": "Jimin's bracelets are so luxurious just like himself sparkles gem_stone", "score": 0, "created_utc": 1612503902, "company": "samsung"}, {"body": "where is phantom red?", "score": 1, "created_utc": 1612503535, "company": "samsung"}, {"body": "Hey how about bringing back the SD card slot.", "score": 1, "created_utc": 1612502666, "company": "samsung"}, {"body": "That's a sick phone. But after buying iPhones for the last 11 years, I'm done with massively expensive phones. I just got an A51, my first Samsung since 2009 and I love it! TONS more features than the iPhone at a quarter of the price. And the camera... face_screaming_in_fear Wow!", "score": 4, "created_utc": 1612502533, "company": "samsung"}, {"body": "referral code D6N67JO REFERRAL REWARD Tala will give you PHP 200 for every friend you refer after they complete their first loan.", "score": 0, "created_utc": 1612502345, "company": "samsung"}, {"body": "At least ship them, still waiting on mine", "score": 1, "created_utc": 1612502269, "company": "samsung"}, {"body": "Red for Asian new year", "score": 0, "created_utc": 1612502194, "company": "samsung"}, {"body": "Red and pink are beautiful red_heart red_heart", "score": 1, "created_utc": 1612502124, "company": "samsung"}, {"body": "My fav is the blue on s21 ultra", "score": 0, "created_utc": 1612502116, "company": "samsung"}, {"body": "Love the ultra mobile_phone folded_hands OK_hand OK_hand OK_hand", "score": 1, "created_utc": 1612501947, "company": "samsung"}, {"body": "This super Epic mobile_phone_with_arrow loudly_crying_face crossed_fingers black_heart OK_hand folded_hands", "score": 0, "created_utc": 1612501923, "company": "samsung"}, {"body": "no charger, shame on you samsung", "score": 2, "created_utc": 1612501916, "company": "samsung"}, {"body": "The blue with carbon fiber looking camera looks nice.", "score": 1, "created_utc": 1612501805, "company": "samsung"}, {"body": "How about bringing the SD card back.", "score": 1, "created_utc": 1612501748, "company": "samsung"}, {"body": "Meet my Galaxy S21 Ultra in Phantom black smiling_face_with_hearts smirking_face You didn't gift me one face_with_raised_eyebrow", "score": 8, "created_utc": 1612501691, "company": "samsung"}, {"body": "Bring this RED COLOR in #SamsungGalaxyS21 ULTRA too!!! heart_suit", "score": 1, "created_utc": 1612501511, "company": "samsung"}, {"body": "Red is love red_heart", "score": 1, "created_utc": 1612501396, "company": "samsung"}, {"body": "Phantom Red S21+5G grinning_face", "score": 2, "created_utc": 1612501328, "company": "samsung"}, {"body": "I like the a51 tho", "score": 3, "created_utc": 1612501222, "company": "samsung"}, {"body": "stop sending Exynos shit to India !", "score": 1, "created_utc": 1612501180, "company": "samsung"}, {"body": "#GalaxyS21Ultra Phantom black_heart", "score": 1, "created_utc": 1612500978, "company": "samsung"}, {"body": "Still waiting on mine loudly_crying_face", "score": 1, "created_utc": 1612500219, "company": "samsung"}, {"body": "I wish the ultra was also available in Phantom Violet pleading_face", "score": 1, "created_utc": 1612500212, "company": "samsung"}, {"body": "#SamsungGalaxyS21 Ultra heart_suit defining the class.", "score": 2, "created_utc": 1612498533, "company": "samsung"}, {"body": "Ill prefer #S21Ultra and #S20plus bts edition victory_hand_light_skin_tone", "score": 1, "created_utc": 1612498176, "company": "samsung"}, {"body": "black", "score": 1, "created_utc": 1612498102, "company": "samsung"}, {"body": "I bought a phone in may '20 and on same network when i use (side by side) I can watch a 10 min YouTube vid in 12mins with redmi phone while it takes 16min on my M307F samsung. Very bad n/w pickup. Can U help?", "score": 0, "created_utc": 1612498059, "company": "samsung"}, {"body": "Wow. I love it smiling_face_with_heart-eyes smiling_face_with_heart-eyes smiling_face_with_heart-eyes they are just more beautiful...", "score": 1, "created_utc": 1612497972, "company": "samsung"}, {"body": "Of u give us so i pick whatever u give beaming_face_with_smiling_eyes beaming_face_with_smiling_eyes beaming_face_with_smiling_eyes beaming_face_with_smiling_eyes", "score": 1, "created_utc": 1612497909, "company": "samsung"}, {"body": "Give us pink pls", "score": 1, "created_utc": 1612497896, "company": "samsung"}, {"body": "Classy #GalaxyS21", "score": 4, "created_utc": 1612497680, "company": "samsung"}, {"body": "I prefer my samsung a51 using it rn", "score": 3, "created_utc": 1612497656, "company": "samsung"}, {"body": "Can't have good phones with better prices...", "score": 1, "created_utc": 1612497651, "company": "samsung"}, {"body": "any particular reason my phone constantly wants to update? I literally did an update this morning and now it wants to do another, getting rather annoying.", "score": 0, "created_utc": 1612497153, "company": "samsung"}, {"body": "how about y'all come up with an OS different from android..? I bet so many will run from #iPhone thinking_face thinking_face thinking_face", "score": 1, "created_utc": 1612494777, "company": "samsung"}, {"body": "So fine smiling_face_with_heart-eyes black_heart black_heart", "score": 0, "created_utc": 1612494229, "company": "samsung"}, {"body": "Handsome fire", "score": 0, "created_utc": 1612494179, "company": "samsung"}, {"body": "The new update (Android 11) is a lil glitchy on The Note 10 plus and 20 like really badly glitchy and slow?? Am I doing something wrong?!?!?", "score": 0, "created_utc": 1612494081, "company": "samsung"}, {"body": "hi.. i have samsung galaxy note3 2014 model and i very jappy for your service thank u", "score": 0, "created_utc": 1612492823, "company": "samsung"}, {"body": "Really no one cares because wife we got a phone we will not another one we aren't youtubers even your galaxy fit watch is the most fuck thing I ever known what is this", "score": 1, "created_utc": 1612490997, "company": "samsung"}, {"body": "what the is happening over here how can I fix this ????????????", "score": 0, "created_utc": 1612490796, "company": "samsung"}, {"body": "you need to swallow your pride and ask to help you with their camera technology. The camera on S10+ is atrocious. My old iPhone 7 takes better pictures than that one. I am really disappointed. such a high end phone", "score": 0, "created_utc": 1612490347, "company": "samsung"}, {"body": "Do yourselves people. Save 1000 dollars and get a used Pixel 3. Pixels have been superior to almost every other phone on the market for a couple years now. Sign up for Fi, and call it a day. Like most things network and app rated, Google did it better.", "score": 0, "created_utc": 1612488008, "company": "samsung"}, {"body": "Very disappointed from your services i buy device in 64k Samsung A71 and still not get Android 11 update and many Chinese device are already roll out Android 11 for all device and these are using Android 11", "score": 3, "created_utc": 1612487817, "company": "samsung"}, {"body": "Hello samsung we user of samsung s9 and note 9 series looking forward for one yi 3.0 update, kindly release one ui 3.0 update for s9 and note 9 series because its capable device and millioms comsumers still using it.", "score": 1, "created_utc": 1612487680, "company": "samsung"}, {"body": "hi Samsung can we except mid range mobiles Such as m31 m31S of 5G in year end", "score": 0, "created_utc": 1612486858, "company": "samsung"}, {"body": "forward to creating #S21EpicMoments as an upcoming model, thanks to #metrofmsabc for the platform for making this possible.", "score": 0, "created_utc": 1612484593, "company": "samsung"}, {"body": "if i win the #GalaxyS21 would watch those funny tik tok videos my friends have been talking about,on the #S21Display and that would be a #S21EpicMoments and it will be thanks to #MetroFM.", "score": 0, "created_utc": 1612483575, "company": "samsung"}, {"body": "Why has the S21 Ultra taken a hit on sharpness compared to the S20 Ultra!?", "score": 0, "created_utc": 1612482555, "company": "samsung"}, {"body": "Hey a lil help would be nice. My phone got stuck while updating and now it's on loop after I tried rebooting it.", "score": 0, "created_utc": 1612481727, "company": "samsung"}, {"body": "why s9 plus users won't get android 11??the phone is capable to run the android 11,this phone has lot of specs and where mid range got android 11 then why not s9 plus??it's very disappointing hope my appeal will not go in vein", "score": 0, "created_utc": 1612481226, "company": "samsung"}, {"body": "I would connect to all my visual classes and do all the research I need to do for my studies with my #GalaxyS21 effortlessly #S21EpicMoments grinning_face_with_big_eyes partying_face", "score": 0, "created_utc": 1612479334, "company": "samsung"}, {"body": "Not sure about you, yet.", "score": 0, "created_utc": 1612477251, "company": "samsung"}, {"body": "pre-ordered Galaxy Ultra s21 256gb black variant onJan 26. Got a whatsapp msg on Feb 3rd that your phone has arrived to store but store person says phone didn't come and they don't even know about availability.", "score": 2, "created_utc": 1612477177, "company": "samsung"}, {"body": "please add Galaxy J in ONE UI 3", "score": 0, "created_utc": 1612476370, "company": "samsung"}, {"body": "ur camera whitewashes me fix that shit loudly_crying_face loudly_crying_face loudly_crying_face", "score": 0, "created_utc": 1612476169, "company": "samsung"}, {"body": "i placed a order 19jan 2021 on samsung shop india. Its show delivered on 25jan but its can't delivered to me. I complain to samsung shop but no solution provider to me.", "score": 2, "created_utc": 1612474855, "company": "samsung"}, {"body": "Samsung = Cheats --- Can you trust any company with Leaders are habitual cheaters?", "score": 0, "created_utc": 1612473604, "company": "samsung"}, {"body": "Samsung = Cheats --- Can you trust any company with Leaders are habitual cheaters?", "score": 0, "created_utc": 1612473591, "company": "samsung"}, {"body": "Well, after making fun of apple, you followed in their footsteps. I've had nothing but Samsung phones since the S2, but think I'm going to jump ship now that you've gotten rid of the SD card slot and headphone jack. It's been fun Samsung. victory_hand", "score": 0, "created_utc": 1612473351, "company": "samsung"}, {"body": "kindly update Task Changer of Good Lock for Android 11 smiling_face_with_smiling_eyes", "score": 1, "created_utc": 1612472578, "company": "samsung"}, {"body": "how do I uninstall the most recent system update? This thing is more broken than the bastard child of Cyberpunk and Fallout 76.", "score": 0, "created_utc": 1612471526, "company": "samsung"}, {"body": "how can I use my exisitng S9 charger on #SamsungGalaxyS21 when you provide c port on both sides....I don't havw old cable but only plug...", "score": 1, "created_utc": 1612469524, "company": "samsung"}, {"body": "Samsung products are going down hill. My T.V. , I moved to a different one. My washer and my refrigerator are now Electrolux, and Bosche. And lastly my phone have been with Samsung phone products for 20 years from a flip phone to note 9. Note 9 worst.", "score": 0, "created_utc": 1612468412, "company": "samsung"}, {"body": "can we expect small screen phones in future from Samsung ? 5 to 5.5 inches screen size ??", "score": 0, "created_utc": 1612468134, "company": "samsung"}, {"body": "so who can compensate me for a s21 I ordered weeks ago and just got told it was back ordered even tho I got a pick up date wen I purchased? I'm not happy", "score": 1, "created_utc": 1612467586, "company": "samsung"}, {"body": "raised_fist raised_fist we want charger in the box raised_fist raised_fist #bringthechagerback", "score": 2, "created_utc": 1612463978, "company": "samsung"}, {"body": "yo, your new update absolutely trashed my phone's rotation system. i have the galaxy note 10+", "score": 2, "created_utc": 1612461836, "company": "samsung"}, {"body": "I bought the S21 Ultra this week and filled in a claim for my free ear buds. Could you let me know when to expect them. I live in Islamabad, Pakistan. Many thanks.", "score": 2, "created_utc": 1612461025, "company": "samsung"}, {"body": "where is the Android 11/One UI 3.0 update for the Galaxy Fold 2 in Australia? Not what I expected when I spent A$2999 on this. Disappointing! #GalaxyZFold2 #Samsung #Android #Android11 #OneUI", "score": 0, "created_utc": 1612460463, "company": "samsung"}, {"body": "when can we expect the active 3", "score": 0, "created_utc": 1612459953, "company": "samsung"}, {"body": "part 2 I see why Apple customer service is so much better because people understand English and they are not over in some 3rd world country. Still can't believe I haven't received an order that was placed January 12 for a cell phone case and air buds", "score": 0, "created_utc": 1612458171, "company": "samsung"}, {"body": "I will never order another phone or accessories from you again I pre ordered my s21 ultra I order cell phone case and the 2 pair of the buds pro on the release date I got the phone but nothing else and NO DAME BODY SPEAKS ENGLISH WHEN YOU CALL FOR HELP.", "score": 0, "created_utc": 1612457999, "company": "samsung"}, {"body": "This #GalaxyS21 is beautiful. The 120hz screen is to die for!", "score": 0, "created_utc": 1612457078, "company": "samsung"}, {"body": "please tell me why I paid $1000 for a phone that only came with a charger. No headphones, no expandable storage battery life under 24 hours You guys use to be the best in the game, from my S3 on. And now the customer gets nothing. What's up??", "score": 0, "created_utc": 1612456656, "company": "samsung"}, {"body": "Why s21 plus has not a 512 or 1 tb storage thumbs_down thumbs_down thumbs_down 1 Minute 8k recording will take about 500 mb Space. Very disappointed from samsung. We need more storage or micro sd card!", "score": 0, "created_utc": 1612456581, "company": "samsung"}, {"body": "i forgot my s9 password and dont want to lose my data... please please give us an option to reset device password from samsung account even if remote unlock is off ! You can do it samsung ( PLEASE !!!", "score": 1, "created_utc": 1612456579, "company": "samsung"}, {"body": "you guys aware that since the last update the picture in picture feature is completely bugged up the wazoo?", "score": 0, "created_utc": 1612454028, "company": "samsung"}, {"body": "I just played Halo 5 from my Galaxy s21 Ultra loudly_crying_face you guys are amazing!", "score": 0, "created_utc": 1612451633, "company": "samsung"}, {"body": "referral code D6N67JO REFERRAL REWARD Tala will give you PHP 200 for every friend you refer after they complete their first loan.", "score": 0, "created_utc": 1612450827, "company": "samsung"}, {"body": "Retweet/ repost these hashtags and comment on every post! ALL MEDIA AND NEWS OUTLETS!Social media takeover!! We will be heard! Flood all for president! #dogearmy #DOGE #dogecoin #dogecoinmovement #thepeoplescrypto #thepeoplescoin #elon4pres", "score": 0, "created_utc": 1612450171, "company": "samsung"}, {"body": "Looks Great", "score": 3, "created_utc": 1612446998, "company": "samsung"}, {"body": "so my galaxy 10e updated itself today and now my gear fit gen 1 watch no longer works. The update deleted the app from my phone too. What gives? It worked just fine before the update. Please help", "score": 0, "created_utc": 1612445737, "company": "samsung"}, {"body": "is trying SO hard to get me to convert with all of the ads, products etc. well done.", "score": 0, "created_utc": 1612443342, "company": "samsung"}, {"body": "watarfac rumenia tri cars of polis infront of mai haus", "score": 0, "created_utc": 1612442215, "company": "samsung"}, {"body": "ce t-am spus flacau?", "score": 0, "created_utc": 1612442188, "company": "samsung"}, {"body": "Our expectation from Samsung in 2022 It will come out Samsung galaxy S22 ultra I hope the battery issue will be addressed more 7000 mah battery and OS should be fast like F-22 raptor fighter jet", "score": 3, "created_utc": 1612441511, "company": "samsung"}, {"body": "Super disappointed in the Galaxy Premier Service. Needed a loner phone while I send my Galaxy Fold 2 in for a repair under warranty. Would you believe they want 13 HUNDRED dollars to hold while I use a temporary phone? I'm so insulted. #GalaxyZFold2 #samsung", "score": 0, "created_utc": 1612440907, "company": "samsung"}, {"body": "bring back the old S-view case with the square cut out for the S21ultra. When you get actually open the camera viewfinder with the case closed still #note7", "score": 0, "created_utc": 1612439899, "company": "samsung"}, {"body": "I have this watch and it is laggy as hell!", "score": 0, "created_utc": 1612439688, "company": "samsung"}, {"body": "Awesome !", "score": 0, "created_utc": 1612438989, "company": "samsung"}, {"body": "why does the battery life my new #S21Ultra5G go down to 93% over two hours when not doing ANYTHING and the screen off? wifi off, bluetooth on but not connected to anything.", "score": 0, "created_utc": 1612438741, "company": "samsung"}, {"body": "not too happy that you guys keep taking more things off your phones Expandable storage, charging brick, headphone Jack, etc. You're looking more like Apple every day.", "score": 0, "created_utc": 1612438433, "company": "samsung"}, {"body": "-I have a Samsung M30 phone which my son lost today- is there a way to locate my phone through IMEI number ? Also how can I get the phone blocked?", "score": 1, "created_utc": 1612437702, "company": "samsung"}, {"body": "You look Great grinning_face_with_sweat", "score": 1, "created_utc": 1612436587, "company": "samsung"}, {"body": "traded my S10 for S21. Loving it so far! )", "score": 2, "created_utc": 1612435259, "company": "samsung"}, {"body": "handsome blue_heart blue_heart", "score": 0, "created_utc": 1612433672, "company": "samsung"}, {"body": "handsome boys ever blue_heart blue_heart", "score": 0, "created_utc": 1612433655, "company": "samsung"}, {"body": "Apple &gt; Android", "score": 0, "created_utc": 1612433376, "company": "samsung"}, {"body": "I purchased the phone through your online store on Jan 15. You guys took the money but I have no phone to show for it. Everytime I contact cs they say they escalated my case. SERIOUSLY??? IM SO MAD. This isnt a few hundreds, I'm out more than 2000. Where is my phon", "score": 0, "created_utc": 1612432751, "company": "samsung"}, {"body": "As a potential buyer, this thread below is very concerning. Why are so many people having these overheating issues, and reporting it on your very own forum? Please respond. #GalaxyS21 #GalaxyS21Ultra", "score": 1, "created_utc": 1612432588, "company": "samsung"}, {"body": "get your advertisements out of MY phone! I will never purchase another Samsung phone ever again!", "score": 0, "created_utc": 1612432362, "company": "samsung"}, {"body": "I will never purchase a Samsung phone ever again! Get you samsung advertisements out of my phone!!!", "score": 0, "created_utc": 1612432238, "company": "samsung"}, {"body": "What's the difference between a Samsung phone and a steaming pile of shit ????? Optics.", "score": 0, "created_utc": 1612432183, "company": "samsung"}, {"body": "When the phone with almost  1,500 comes with a charger, headphones and the same chip as for the USA market (Snapdragon), when the phone with  1,500 has an FM radio - then I will continue to be your customer. Your EX S class customer", "score": 0, "created_utc": 1612431705, "company": "samsung"}, {"body": "your customer service is absolutely shocking! I haven't been able to sign in for 6 months and still you aren't able to help me. I'm disgusted and will never use you again!", "score": 0, "created_utc": 1612431642, "company": "samsung"}, {"body": "my mobile \"SAMSUNG GALAXY M21\" is getting stuck, switch off and not at all starting now, that too within 6 month of purchased date. Please rectify the issue as soon as possible.", "score": 0, "created_utc": 1612430838, "company": "samsung"}, {"body": "why your gaming service is bad And Pubg is not optimized", "score": 1, "created_utc": 1612430345, "company": "samsung"}, {"body": "my new mobile phone \"SAMSUNG M21\" is getting stuck, and switched off due to some software issue that to within a 6 month from the date of purchase. So please rectify this issue by replacing or by some other means as soon as possible.", "score": 1, "created_utc": 1612430337, "company": "samsung"}, {"body": "dear samsung spacebar or your key board is too much small when we use browser...its always click on . and www. please resovle it because i am usual to tap space baar in what's app and that position of taping come in ( . ) in browser keyboard", "score": 0, "created_utc": 1612429138, "company": "samsung"}, {"body": "How do we clear cache of ALL Android Apps (App Cache not Data) in One Move (Click)! Terrible Coders you have!", "score": 0, "created_utc": 1612428474, "company": "samsung"}, {"body": "my name is not Victor, unless you calling me a winner or something smirking_face", "score": 0, "created_utc": 1612427744, "company": "samsung"}, {"body": "latest #NotePhones have just received another update (h/t but don't expect much here. The new update brings the February 2021 #SecurityPatch to the unlocked #GalaxyNote20Ultra in the", "score": 0, "created_utc": 1612423810, "company": "samsung"}, {"body": "? Today ?", "score": 0, "created_utc": 1612423331, "company": "samsung"}, {"body": "I'm big fan of Samsung I use lot of samsung stuff more than any but I need note s20 mystic bronze edition cause I love the design but I can't afford it though would you consider this as a gift", "score": 0, "created_utc": 1612421980, "company": "samsung"}, {"body": "Today i got notification 4 update my S10+ from Android 10 to 11. After the successful installation of new version my phone is getting heated and continuesly hanging. Kindly check &amp; get it fixed.", "score": 2, "created_utc": 1612421956, "company": "samsung"}, {"body": ".... soo? I have a phone that I cannot charge. Switching from Apple. Already regretting. How can a phone come without a cable to charge it. Typing from an iPhone as my Samsung has died. Absolute joke.", "score": 0, "created_utc": 1612421233, "company": "samsung"}, {"body": "Can someone please contact me via DM?", "score": 0, "created_utc": 1612419947, "company": "samsung"}, {"body": "Bought mine 2day", "score": 0, "created_utc": 1612419241, "company": "samsung"}, {"body": "I bought my phone brand new(the phone came with a screen protector out of the box so there is a good chance it is previously used and whoever sold me the phone took the original) from about a year ago and now I am getting this glitch", "score": 2, "created_utc": 1612418471, "company": "samsung"}, {"body": "Can we use a samsung 45w type c to type c charger to charge samsung f41 to reduce charging time ??? And if we are able to reduce then how much time will it take to charge the phone???", "score": 1, "created_utc": 1612417037, "company": "samsung"}, {"body": "My S21 ultra is heating too much, when I gave it to the Samsung service center they informed me that the device is heating to 39 degree centigrade and said it's a normal heat for the device. I am burning my hands by spending 1.06 lakhs. No solution yet from Samsung", "score": 0, "created_utc": 1612415254, "company": "samsung"}, {"body": "Stunning!", "score": 0, "created_utc": 1612414358, "company": "samsung"}, {"body": "what's this? S21 ULTRA 5G. Had it since Monday, haven't dropped it nor gotten it wet.", "score": 1, "created_utc": 1612413199, "company": "samsung"}, {"body": "How can fix this issue? Not switch on since morning.", "score": 2, "created_utc": 1612412515, "company": "samsung"}, {"body": "Candy", "score": 0, "created_utc": 1612409207, "company": "samsung"}, {"body": "how can you guys jump from galaxy s10 to 21...I'm still at 7..that way I will never catch up.. sad_but_relieved_face grinning_face_with_sweat", "score": 0, "created_utc": 1612408768, "company": "samsung"}, {"body": "Hi. I have a folder on my S20 home screen. I'm unable to rename it, even when I click and hold etc. Doesn't let me edit or enter text. Please advise without saying 'Create a new folder and delete this one' Software and apps all upto date.", "score": 0, "created_utc": 1612408731, "company": "samsung"}, {"body": "Explore myself with its revolutionary camera experience.", "score": 0, "created_utc": 1612406151, "company": "samsung"}, {"body": "Samsung a71", "score": 0, "created_utc": 1612405728, "company": "samsung"}, {"body": "never stops me amazing. Given One UI 3 UPDATE for M21 today. #Android11", "score": 0, "created_utc": 1612404386, "company": "samsung"}, {"body": "1/2 Quite angry people here in Belgium regarding their pre-orders! A lot of bad posts on social medias. I am part of them! Pre-order is 6 days late and only partially delivered! I'll receive the travel adapter a week later than the phone! How do I charge?", "score": 1, "created_utc": 1612403827, "company": "samsung"}, {"body": "Samsung not to kill the Note series. Petition", "score": 0, "created_utc": 1612403580, "company": "samsung"}, {"body": ", do you have customer service? i am already giving up on you guys, last nail in the coffin.. After worst service, i am planning to throw your device out of window.. ACTIVE 2 watch already thrown, now this time mobile..Worst service", "score": 1, "created_utc": 1612401744, "company": "samsung"}, {"body": "Finally can afford the Galaxy S6+ partying_face", "score": 0, "created_utc": 1612399052, "company": "samsung"}, {"body": "what happened to the clock widget on my S9? The numbers of my (digital) clock are much smaller and can't be altered to previous size sad_but_relieved_face", "score": 2, "created_utc": 1612396726, "company": "samsung"}, {"body": "I lost my samsung account pass word please help me to recover it pls reply me inbox thanks Tariq Zaheer Karachi Pakistan", "score": 0, "created_utc": 1612396016, "company": "samsung"}, {"body": "when can we get a black lab emoji", "score": 0, "created_utc": 1612395999, "company": "samsung"}, {"body": "people will definitly NOT like to buy your exynos trash here. Suffered through Note 9 and now letting the S20 FE rot in a corner just because they s*#k in battery/performance! Now s21 ultra with new ginuea pig chipset that feels like below image", "score": 0, "created_utc": 1612394030, "company": "samsung"}, {"body": "Release today?", "score": 1, "created_utc": 1612393708, "company": "samsung"}, {"body": "can I have him with phone?", "score": 0, "created_utc": 1612390781, "company": "samsung"}, {"body": "Samsung has become non-responsive to their cunsumer. This is really pathetic to be proud on this brand now a days. confused_face confused_face", "score": 3, "created_utc": 1612390655, "company": "samsung"}, {"body": "please bring one UI update for galaxy ON MAX..it is largest selling phone and we hopeful for ONE UI... thanks", "score": 0, "created_utc": 1612390267, "company": "samsung"}, {"body": "why note 20 ultra ( bronze) is not available in bhubaneswar Odisha. Is there any issues with the mobile or anything else ? Hopefully I ll get a positive response from your side.", "score": 0, "created_utc": 1612387761, "company": "samsung"}, {"body": "I'm using Samsung mobile phones for many years I just wanted to share one thing I have taken new smart phone before one month now its not working I went to 3 customer service center but they don't have any resolution worst service I have ever face ill not buy again", "score": 0, "created_utc": 1612386897, "company": "samsung"}, {"body": "handsome", "score": 0, "created_utc": 1612386529, "company": "samsung"}, {"body": "I desperately need help. My Gal S7 screen stopped working and my charge port is also broken. My phone is also stuck on what i believe maybe the boot passcode screen, what I think you call secure start up. Please please help!", "score": 1, "created_utc": 1612386166, "company": "samsung"}, {"body": "Never buy Samsung phones they sold defective product low quality product and when you request them to replace it they refuse to replace it they just tell you to repair it. I mailed and called many times but they no one able to resolve my problem", "score": 2, "created_utc": 1612385851, "company": "samsung"}, {"body": "why my mobile screen has been turned into a billboard? Did you pay for my mobile? Are you paying me my mobile bills? Why SAMSUNG's stupidity and violation of privacy is forcing me to buy APPLE products?", "score": 0, "created_utc": 1612385597, "company": "samsung"}, {"body": "This phone broke after 8 months, the screen just went blank for no reason. Samsung service are charging 600$ for the repair, without any proof of faulty handling from my side... just \" their report\". Very very disappointed... Samsung Customer Care Kuwait are useless", "score": 1, "created_utc": 1612382782, "company": "samsung"}, {"body": "##guys don't believe on their product as I am suffering you will also #dont chose any Samsung product. Sapanraj 8200393873", "score": 1, "created_utc": 1612382662, "company": "samsung"}, {"body": "After providing a pre-installed sceen protector on both the Galaxy S10 and S20 series I'm very disappointed to see that the new S21 does not include one. This was a huge bonus to not have to spend extra money on a 3rd party protector and worry about installing it.", "score": 0, "created_utc": 1612381352, "company": "samsung"}, {"body": "For god's sake, add vertical scrolling to app screen and option to change app screen background to whichever background or solid color we need. Annoyed ULTRA user.", "score": 0, "created_utc": 1612380620, "company": "samsung"}, {"body": "When, we got that", "score": 0, "created_utc": 1612379658, "company": "samsung"}, {"body": "Got my new s21 today with no way to charge it. Thanks for not putting a charger box in the contents.", "score": 0, "created_utc": 1612379445, "company": "samsung"}, {"body": "Countless # of your customers including me ...Cannot receive mms messages on our Galaxy S20 ultra Are you ignoring us or RIPPING us off?? Please read your We need HELP !!!!", "score": 0, "created_utc": 1612377783, "company": "samsung"}, {"body": "hey Samsung..Why can't I receive or send messages messages on my extremely expensive Samsung Galaxy s20 ultra? ...Thousands of us stuck with the same problem I know this from visiting the Samsung Community. H. E. L.P. sending this to you as an S.O.S", "score": 0, "created_utc": 1612377395, "company": "samsung"}, {"body": "Hey is it possible to get a phone without facebook preinstalled and undeletable on your products? I would love to be able to use that storage space for other things. I dont understand why u choose which apps i have on MY phone.", "score": 0, "created_utc": 1612377216, "company": "samsung"}, {"body": "mobile hanging issue not resolved by your service center even after 5 visits. Now they are waiting for my warranty to expire. What kind of fucking customer service it is.What kind of service center it is. URGENT ATTENTION REQUIRED #FarmersProtest #Airtel #internet", "score": 0, "created_utc": 1612376336, "company": "samsung"}, {"body": "Samsung you really convinced me with Jimin as a model red_heart #JIMINxSAMSUNG #JiminKingOfBrandRanking #JIMIN", "score": 1, "created_utc": 1612376304, "company": "samsung"}, {"body": "Wait is over for S21 Series over..Wait beings for s21 FE face_with_tongue #smartphone #iphone #samsung #pro #android #apple #technology #xiaomi #tech #mobile #phone #oneplus #plus #s #instagood #huawei #gadget #ios #oppo #realme", "score": 1, "created_utc": 1612376044, "company": "samsung"}, {"body": "please, please delete my old number &amp; put my new one in. I've waited 5 days now. Let's go", "score": 0, "created_utc": 1612375541, "company": "samsung"}, {"body": "We know that you know that we know you see us. Watching through the camera of my phone. eyes I see you #SamsungUnpacked", "score": 0, "created_utc": 1612375356, "company": "samsung"}, {"body": "Add 3x telephoto support for Portrait mode on S21Ultra", "score": 2, "created_utc": 1612374328, "company": "samsung"}, {"body": "The fact remains that since Leaders arrests for cheating swindling, quality and service is bad. Leader cheated convicted and now jailed again!", "score": 0, "created_utc": 1612374149, "company": "samsung"}, {"body": "The fact remains that since Leaders arrests for cheating swindling, quality and service is bad. Leader cheated convicted and now jailed again!", "score": 0, "created_utc": 1612374135, "company": "samsung"}, {"body": "Love this phone", "score": 0, "created_utc": 1612370583, "company": "samsung"}, {"body": "How can someone look this good advertising a phone loudly_crying_face raised_hand", "score": 0, "created_utc": 1612370210, "company": "samsung"}, {"body": "I ordered phone and the case together. The case never arrived and I have been emailing orders support but no response from their end for a week now.", "score": 0, "created_utc": 1612369044, "company": "samsung"}, {"body": "Anyone who is listening, beware before buying S21 ultra. I have been using it for a week and it's getting really hot while using it. It gets so hot that hand gets sweaty and can't even hold it. And the customer service from Samsung is just useless. No one has even responded.", "score": 0, "created_utc": 1612368991, "company": "samsung"}, {"body": "just released their next rugged, field-ready #mobile tablet, the Galaxy Tab Active3. Learn more", "score": 0, "created_utc": 1612367462, "company": "samsung"}, {"body": "Congrats on all those fancy new phones, but... What the hell did you do with latest version of Clock widget and WHYYYY??", "score": 3, "created_utc": 1612364517, "company": "samsung"}, {"body": "loved your oneui3.0, but it's killing battery life like never before. Is it same propaganda like those chinese companies to push users to upgrade phones ? #CustomerExperience #Samsung #customersatisfaction #Battery #MakeInIndia #technology #hardware #malfunctions", "score": 0, "created_utc": 1612363616, "company": "samsung"}, {"body": "If only I could connect my controller to play games. It worked on my Note 8 now it doesn't with my S21 Ultra.", "score": 0, "created_utc": 1612363535, "company": "samsung"}, {"body": "I would like to know if you will apply the same Apple Privacy policy which will allow the consumer to select or not if they want their data to be tracked, if not, the purchase of my next equipment will be an iPhone, I like the companies take care of your consumers.", "score": 0, "created_utc": 1612362630, "company": "samsung"}, {"body": "So are you guys going to remove the USB-C port if apple removes the lightning ? You guys have so many chances to be different but you are apple fan boys. So why pay the same price to be an iPhone clone? I'll stick with iPhone and this is coming from someone who had Note 10 plus!", "score": 0, "created_utc": 1612360285, "company": "samsung"}, {"body": "#OneUI3 is terrible. The blue on the status pull down hurts the eyes as they have adjust at an awkward timeframe. It actually hurts my eyes. #fail no setting to remove it", "score": 0, "created_utc": 1612359687, "company": "samsung"}, {"body": "Just got a new S21 Ultra this phone is amazing great job clapping_hands", "score": 2, "created_utc": 1612359386, "company": "samsung"}, {"body": "My heart cannot take it", "score": 0, "created_utc": 1612359364, "company": "samsung"}, {"body": "Who the hell is lookin' at the phone hhhh", "score": 0, "created_utc": 1612358268, "company": "samsung"}, {"body": "Hello Samsung, I'm live in Azerbaijan.I want one Samsung mobile but not have money,in our country very big price for not good speaking in English. Possible help me one Samsung mobile FROM ? Thanks", "score": 0, "created_utc": 1612357298, "company": "samsung"}, {"body": "Hey Samsung! I love your technology and enjoy them every time I get one! lovingly, audi", "score": 0, "created_utc": 1612357145, "company": "samsung"}, {"body": "is it a known problem for Note10+ to warn of moisture in/on the charging point even when the phone has been dry since it was bought a year ago?", "score": 0, "created_utc": 1612356812, "company": "samsung"}, {"body": "does this count as saving the environment?? Having to buy chargers that come in separate boxes? Really saving the environment at least give a credit or an option to buy the charger and have it included. Especially when you change the charging brick...", "score": 0, "created_utc": 1612356069, "company": "samsung"}, {"body": "Hi, I just got the new S21 ultra a week ago and it's starting to have issues. It heats up while using and is not easy to keep in hands when it's hot. My older s9+ never had these issues. This is not a very good model but Samsung. Are you going to fix this issue or I need my money", "score": 0, "created_utc": 1612355250, "company": "samsung"}, {"body": "#Donate please for new #SamsungS21 5168755108167020 revolving_hearts revolving_hearts Thanks folded_hands_medium_skin_tone", "score": 0, "created_utc": 1612354610, "company": "samsung"}, {"body": "#Donate please for new #SamsungS21 5168755108167020 revolving_hearts revolving_hearts Thanks folded_hands_medium_skin_tone", "score": 0, "created_utc": 1612354585, "company": "samsung"}, {"body": "#Donate please for new #SamsungS21 5168755108167020 revolving_hearts revolving_hearts Thanks folded_hands_medium_skin_tone", "score": 0, "created_utc": 1612354572, "company": "samsung"}, {"body": "#Donate please for new #SamsungS21 5168755108167020 revolving_hearts revolving_hearts Thanks folded_hands_medium_skin_tone", "score": 0, "created_utc": 1612354562, "company": "samsung"}, {"body": "#Donate please for new #SamsungS21 5168755108167020 revolving_hearts revolving_hearts Thanks folded_hands_medium_skin_tone", "score": 0, "created_utc": 1612354555, "company": "samsung"}, {"body": "#Donate please for new #SamsungS21 5168755108167020 revolving_hearts revolving_hearts Thanks folded_hands_medium_skin_tone", "score": 0, "created_utc": 1612354548, "company": "samsung"}, {"body": "#Donate please for new #SamsungS21 5168755108167020 revolving_hearts revolving_hearts Thanks folded_hands_medium_skin_tone", "score": 0, "created_utc": 1612354540, "company": "samsung"}, {"body": "#Donate please for new #GalaxyxBTS #GalaxyS21Ultra 5168755108167020 revolving_hearts revolving_hearts Thanks folded_hands_medium_skin_tone", "score": 0, "created_utc": 1612354434, "company": "samsung"}, {"body": "what's going on lately, i love the update but i think there's a glitch.", "score": 0, "created_utc": 1612354231, "company": "samsung"}, {"body": "and still giving me the run around. If you can't fix what is under warranty give me a new phone! It's not that hard people.", "score": 0, "created_utc": 1612352192, "company": "samsung"}, {"body": "Bighit needs a new styling team so can u please let Seokjin have ur styling team? I will give u my kidneys pleading_face", "score": 2, "created_utc": 1612351426, "company": "samsung"}, {"body": "Rubbish customer service. New phone repaired twice, now needs another repair. 3rd in a month! Am at wits end", "score": 0, "created_utc": 1612350189, "company": "samsung"}, {"body": "You're stupid update got rid of my Edge lighting and messed up all my settings", "score": 0, "created_utc": 1612349414, "company": "samsung"}, {"body": "BTS just KNOWS they are hot and they are taking the opportunity!! UGH tired_face raised_hand_light_skin_tone", "score": 0, "created_utc": 1612349245, "company": "samsung"}, {"body": "Dear, I am facing \"yellow discoloration\" issue on my samsung galaxy phone s10e. It occured after an update from samsung. Looks like a software issue. It is expensive phone i purchased and my warranty is over. Request you to please help me on the same", "score": 1, "created_utc": 1612344860, "company": "samsung"}, {"body": "Not excited in the least when we literally have to brighten our screens up, zoom in and use editors to get a clear picture of members in the far back. Not expected of Samsung to provide us with photoshoots like this.", "score": 0, "created_utc": 1612344857, "company": "samsung"}, {"body": "please bring back custom color options for Edge lighting! Not a fan of how it is in One UI 3.0. I had texts set to a specific color and now almost all apps are blue. It helped me differentiate where my notifications were from.", "score": 0, "created_utc": 1612344720, "company": "samsung"}, {"body": "whoever, y'all REALLY need to make a 2TB phone. The more memory the better. No online saving capability, pure space on the actual device. Thanks!", "score": 0, "created_utc": 1612344388, "company": "samsung"}, {"body": "What is wrong with Samsung galaxy S9, after exactly one year the earpiece has to spoil. For you to hear any call you have to put it onloud speaker which really limits privacy. First it was with an S8 and now S9 i got has the same problem.", "score": 0, "created_utc": 1612344119, "company": "samsung"}, {"body": "Hi i am using M21... avid fan of samsung phones from beginning... from India.. inam used to indian number system... how can i get it in the samsung calculator... even i have set language preference to English india... help me out", "score": 0, "created_utc": 1612344013, "company": "samsung"}, {"body": "I'd like to be the phone in this photo Me search on Google how to become one of BTS's phone (hope I'll find an answer to my questions-)", "score": 0, "created_utc": 1612343608, "company": "samsung"}, {"body": "i dislike the look of the new update. I absolutely am uncomfortable by it. Its very disturbing for some reason. im currently looking for how to fix the look because its genuinely making me bothered. Just saying my stance. Hope you have a good day and stay safe.", "score": 1, "created_utc": 1612343202, "company": "samsung"}, {"body": "When will s21 + update to s20 ultra ? thinking_face", "score": 0, "created_utc": 1612343101, "company": "samsung"}, {"body": "I see what you're doing to my 2yo S8+ &amp; I must tell you face_with_symbols_on_mouth face_with_symbols_on_mouth face_with_symbols_on_mouth face_with_symbols_on_mouth face_with_symbols_on_mouth face_with_symbols_on_mouth face_with_symbols_on_mouth face_with_symbols_on_mouth face_with_symbols_on_mouth I can live without you as easily as you can live without me! You ever heard of 'outsourcing'? #Samsung trying to make your decisions for you middle_finger", "score": 0, "created_utc": 1612342786, "company": "samsung"}, {"body": "when ? This coming... Give now....Give", "score": 0, "created_utc": 1612342263, "company": "samsung"}, {"body": "Nice phone by all standards", "score": 0, "created_utc": 1612342156, "company": "samsung"}, {"body": "help. Videos I sent to my family are coming through on their device shortened and lacking sound. I am using an S20 and it's via the messenger app. If I look at my phone it shows 6 sec for a 47 sec clip but plays fully in my phone. Only started today. Ideas?", "score": 1, "created_utc": 1612340748, "company": "samsung"}, {"body": "I think samsung is the best phone but I was wrong redmi is better than samsung.I buy samsung m31 under 17000 thousand and starts play pubg then I realize redmi has better graphics than samsung", "score": 0, "created_utc": 1612339754, "company": "samsung"}, {"body": "Galaxy Buds Pro vs AirPods Pro... I wonder who takes the crown in this one? Check out the video below, and don't forget to share and drop a like! grinning_squinting_face RTs are appreciated! #youtuber #youtube #GalaxyS21", "score": 1, "created_utc": 1612339716, "company": "samsung"}, {"body": "the new update is BRUTAL!!!!! If I wanted similar to an iPhone, I'd have gone to Apple!!!!! This new look and functionality is horrible!!!!!", "score": 0, "created_utc": 1612339333, "company": "samsung"}, {"body": "my galaxy on 8 year 2019 screen is damaged, could you please share repairing estimate? Because since last 5years i'm continue using Samsung Mobile but after few days of using phone M30S response, camera performance become poor.", "score": 0, "created_utc": 1612339317, "company": "samsung"}, {"body": "has released its lineup of #GalaxyS21 phones a little earlier than usual this year, and it's clear they have newest phone in its sights.", "score": 0, "created_utc": 1612339233, "company": "samsung"}, {"body": "Don't you think it's insincere to not upgrade the Galaxy S9 to Android 11? It feels like an attempt to make me upgrade a working phone way too soon.", "score": 0, "created_utc": 1612338563, "company": "samsung"}, {"body": "Hi, my Samsung Galaxy A50 will not charge and I believe this is a motherboard issue. This issue began instantly when the phone was updated a couple of weeks ago. The phone is a year old and was working completely fine prior to update.", "score": 1, "created_utc": 1612338384, "company": "samsung"}, {"body": "mobile hanging issue not resolved by your service center even after 5 visits. Now they are waiting for my warranty to expire. What kind of fucking customer service it is. What kind of service center it is. URGENT ATTENTION REQUIRED", "score": 1, "created_utc": 1612338362, "company": "samsung"}, {"body": "thank you purple_heart purple_heart", "score": 0, "created_utc": 1612338122, "company": "samsung"}, {"body": "Dies from heart attack*", "score": 0, "created_utc": 1612335904, "company": "samsung"}, {"body": "Hello dear samsung please add side mounted fingerprint sensor in the m series smart phones.Thank you", "score": 0, "created_utc": 1612335692, "company": "samsung"}, {"body": "Bring back the free photo cards please !!!! woman_facepalming", "score": 0, "created_utc": 1612335515, "company": "samsung"}, {"body": "I don't have curve account anymore, making new account why doesn't it let me start new account. I want this Samsung pay card", "score": 1, "created_utc": 1612335288, "company": "samsung"}, {"body": "Can I take the device for free? winking_face winking_face", "score": 2, "created_utc": 1612332648, "company": "samsung"}, {"body": "The phone sucks it doesn't have a separate SD card slot which we all like", "score": 0, "created_utc": 1612332213, "company": "samsung"}, {"body": "stay away from the new Samsung phone it doesn't have a slot for a separate SD card so you have to buy the extra internal storage and you have no SD card that you can switch between other units. I think the new phone is a bad idea", "score": 0, "created_utc": 1612332191, "company": "samsung"}, {"body": "Phones are better than girlfriends, At least we can switch off!", "score": 0, "created_utc": 1612332173, "company": "samsung"}, {"body": "How about this 1_ get tizen os on your smartphones 2_ remove gapps and youll instantly become the best smartphone brand out there", "score": 0, "created_utc": 1612331140, "company": "samsung"}, {"body": "Taehyung is trying so hard to let us focus on the phone face_with_tears_of_joy", "score": 0, "created_utc": 1612331059, "company": "samsung"}, {"body": "Samsung has/ had all the alternative apps to google/Microsoft. I tell you what's wrong about Koreans... They're pussies. I dare you to remove gapps on your smartphones like huawei", "score": 0, "created_utc": 1612330969, "company": "samsung"}, {"body": "I think y'all looking for loyal endorser who didn't really use iOS grinning_face_with_big_eyes", "score": 1, "created_utc": 1612330444, "company": "samsung"}, {"body": "you know what to do winking_face", "score": 0, "created_utc": 1612330239, "company": "samsung"}, {"body": "Samsung why doYou keep removing my like n retweet", "score": 0, "created_utc": 1612329629, "company": "samsung"}, {"body": "your haptic is trash on the S21 and you removed MST. Might as well just switch to Xiaomi", "score": 0, "created_utc": 1612328004, "company": "samsung"}, {"body": "#faceid never works. Smh", "score": 0, "created_utc": 1612326935, "company": "samsung"}, {"body": "Why is my country asking me to buy THEIR PRODUCT!!??? And then they will give those photocards!!? Is it like a deal thing or are the photocards FREE!????", "score": 0, "created_utc": 1612326489, "company": "samsung"}, {"body": "Putting J-HOPE away like this ? That's why i will keep using iphone", "score": 0, "created_utc": 1612325761, "company": "samsung"}, {"body": "when are we getting a software update for Note 9's screen discoloration?", "score": 0, "created_utc": 1612325732, "company": "samsung"}, {"body": "Why is J-Hope placed in a very far corner? Do you think it is that long and bulky to put it in a far corner? I guess next time only a shadow will be applied !!!!", "score": 1, "created_utc": 1612324942, "company": "samsung"}, {"body": "Why 90% of the image area is for one member only While we have to use a microscope to see the rest of the organs What a unprofessional act? Does deal with beginners? I hated the way you deal with the rest of the members a lot", "score": 2, "created_utc": 1612324541, "company": "samsung"}, {"body": "suggestion or idea Instead of manual(catalog) on every mobile boxes we can make it digitally by using barcode to view information Go paperless, thank you", "score": 0, "created_utc": 1612324249, "company": "samsung"}, {"body": "yellow_heart red_heart yellow_heart red_heart yellow_heart PARK JIMIN # # # #JIMIN #ParkJimin #Jiminie #JIMIM", "score": 0, "created_utc": 1612323206, "company": "samsung"}, {"body": "You killing me! Illegal! oncoming_police_car", "score": 0, "created_utc": 1612322482, "company": "samsung"}, {"body": "Thanks for pulling an apple and making my battery life worse on my Note 10+ with the Android 11 update (in 10mins I lost 8% battery life). Also thanks for making some legacy apps and widgets that worked before completely incompatible now.", "score": 1, "created_utc": 1612322480, "company": "samsung"}, {"body": "Sorry for disturbing you folded_hands We strongly condemn Myanmar military coup over people elected government. #SaveMyanmar Myanmar_(Burma) #Save_Burma #WhatishappeninginMyanmar #AungSanSuuKyi_government", "score": 0, "created_utc": 1612321122, "company": "samsung"}, {"body": "I have samsung m31 mobile. one app icon add on main application page automatically . I just to remove but couldn't show an option . help me to remove it . app name is zipped apps .", "score": 0, "created_utc": 1612320753, "company": "samsung"}, {"body": "I will create and setup your Facebook business page professionally for just 5$ Do you have a company and you want to market in your company on Facebook? I will create and setup your Facebook business page professionally for just 5$ order now my Fiverr gig", "score": 0, "created_utc": 1612320540, "company": "samsung"}, {"body": "with this phone I can be able to capture clear photos and videos with the loved alberton.. #S21EpicMoments", "score": 2, "created_utc": 1612320245, "company": "samsung"}, {"body": "I am owning s20 since March 2020, there has been heating issues with the exynos processor, which caused the the back case getting peeled off due to the heat, I had given it for service yesterday at samsung authorized service center and they have applied a tape", "score": 0, "created_utc": 1612320039, "company": "samsung"}, {"body": "Please work with", "score": 0, "created_utc": 1612319540, "company": "samsung"}, {"body": "mobile is worst mobile ,that's lunched in few months ago Samsung A series (particularly A51 )..its not working properly..I think is best more then a Samsung .But im still Paying the EMI ...waste my money for this Mobile", "score": 0, "created_utc": 1612319536, "company": "samsung"}, {"body": "Namjoon looking like the guy who invented apple.", "score": 0, "created_utc": 1612318316, "company": "samsung"}, {"body": "Samsung thinks we are more interested in the phone rolling_on_the_floor_laughing no we interested in the handsome boys holding them rolling_on_the_floor_laughing loudly_crying_face", "score": 2, "created_utc": 1612315671, "company": "samsung"}, {"body": "bought Galaxy S20 3months back and went samsung service centre 2 times for the heating issue but issue not resolved till now......feeling cheated expressionless_face", "score": 0, "created_utc": 1612314304, "company": "samsung"}, {"body": "Wow JIMIN'S face! So cute", "score": 0, "created_utc": 1612313906, "company": "samsung"}, {"body": "Park Jimin! So pretty!", "score": 0, "created_utc": 1612313859, "company": "samsung"}, {"body": "Brand King PARK JIMIN crown #GalaxyxBts #JIMIN #Jiminie #ParkJimin", "score": 0, "created_utc": 1612313439, "company": "samsung"}, {"body": "Borahae BTS KEEP SAFE crown grinning_face_with_smiling_eyes", "score": 0, "created_utc": 1612313331, "company": "samsung"}, {"body": "jimin = perfect face_blowing_a_kiss face_blowing_a_kiss face_blowing_a_kiss", "score": 0, "created_utc": 1612312498, "company": "samsung"}, {"body": "wow, jimin is the best smiling_face_with_heart-eyes kissing_face_with_closed_eyes", "score": 0, "created_utc": 1612312476, "company": "samsung"}, {"body": "Excuse me sir but seeing them looking like hot vampires they r the only product I wanna buy.", "score": 0, "created_utc": 1612312220, "company": "samsung"}, {"body": "m21 update is awful,making some issues.....", "score": 0, "created_utc": 1612309499, "company": "samsung"}, {"body": "Proud wife here charr smiling_face_with_heart-eyes smiling_face_with_heart-eyes smiling_face_with_heart-eyes", "score": 0, "created_utc": 1612309375, "company": "samsung"}, {"body": "when will India get a stocks Samsung always late.", "score": 0, "created_utc": 1612308322, "company": "samsung"}, {"body": "y'all taking so seriously for a damn phone.....", "score": 0, "created_utc": 1612307711, "company": "samsung"}, {"body": "They look amazing loudly_crying_face ..I love you Samsung for this purple_heart", "score": 0, "created_utc": 1612307422, "company": "samsung"}, {"body": "Help Myanmar....We can't accept the history will be back again Must fall military coup Myanmar citizens have been suffering a lot It's enough #SaveMyanmar #AungSanSuuKyi_government #AungSanSuuKyiGovernment #RejectTheMilitary", "score": 0, "created_utc": 1612306643, "company": "samsung"}, {"body": "After Android 11 update, I am getting calculator app crashed every now and then.", "score": 1, "created_utc": 1612306151, "company": "samsung"}, {"body": "a whole \"open for surprise\" move right here samsung", "score": 0, "created_utc": 1612304140, "company": "samsung"}, {"body": "Love it..... fresh", "score": 0, "created_utc": 1612304100, "company": "samsung"}, {"body": "Fresh", "score": 0, "created_utc": 1612304060, "company": "samsung"}, {"body": "Please copy and tweet red_exclamation_mark #SaveMyammar Myanmar_(Burma) #SaveAungSanSuuKyi #RejectTheMililary #BringCoupMilitaryToTheCourt #SaveBurma Myanmar_(Burma)", "score": 3, "created_utc": 1612304031, "company": "samsung"}, {"body": "I have purchased Samsung A71 on 15th of January and it is creating problems from 2nd day of purchase. Service center is saying that they will repair the phone.but I don't want repaired device. Kindly replace my phone", "score": 0, "created_utc": 1612303956, "company": "samsung"}, {"body": "Perfect model Jimin He is so gorgeous", "score": 0, "created_utc": 1612303857, "company": "samsung"}, {"body": "Wow they look so good loudly_crying_face revolving_hearts", "score": 0, "created_utc": 1612302912, "company": "samsung"}, {"body": "BTS fans that use iPhones right now", "score": 0, "created_utc": 1612302707, "company": "samsung"}, {"body": "please resolve the issues with future OTA", "score": 0, "created_utc": 1612302626, "company": "samsung"}, {"body": "two_hearts 9 Years ago", "score": 0, "created_utc": 1612301974, "company": "samsung"}, {"body": "Ya las Photocards?", "score": 0, "created_utc": 1612301554, "company": "samsung"}, {"body": "In your next update, please stop notifications from coming across my screen like a text message. I'm positive there are plenty of people who could care less about having their show interrupted by a dumb ass Facebook notification. Really man??!!", "score": 0, "created_utc": 1612301461, "company": "samsung"}, {"body": "why dont you take your #SmartTag back and give me a charger. I dont have USB C charger and i dotn need a #SmartTag. So in SA with you give me a $30 thing that i need and will make me pay extra $40 for something i need?! Lets exchange Smattag for charger!", "score": 0, "created_utc": 1612301367, "company": "samsung"}, {"body": "Finally!!!!!", "score": 0, "created_utc": 1612301150, "company": "samsung"}, {"body": "Hey a friend sent me a used samsung from the united states to Nigeria since last year August, its a galaxy A20 and since it got here I have not been able to use the internet connection, it says SECURITY POLICY PREVENTS THE USE OF DATA ,I took it everywhere", "score": 0, "created_utc": 1612300709, "company": "samsung"}, {"body": "Jimin King of kpop #JIMIN Park Jimin", "score": 0, "created_utc": 1612300370, "company": "samsung"}, {"body": "I want a pic. for jk", "score": 0, "created_utc": 1612299116, "company": "samsung"}, {"body": "I bought a high range mobile. A galaxy note 9. I pay $ 80 per month, barely 1 year, the battery is dead despite i use it correctly. It's really not serious from samsung. They don't want to pay back. It's a shame face_vomiting face_vomiting", "score": 0, "created_utc": 1612298658, "company": "samsung"}, {"body": "I bought a high range mobile. A galaxy note 9. I pay $ 80 per month, barely 1 year, the battery is dead. It's really not serious from samsung. They don't want to pay back. It's a shame face_vomiting face_vomiting", "score": 0, "created_utc": 1612298563, "company": "samsung"}, {"body": "Omggggggggg Samsung", "score": 0, "created_utc": 1612298358, "company": "samsung"}, {"body": "why don't we in Australia get the January security patch. When the February one gas allready been released?? For the note 20 ultra ??", "score": 0, "created_utc": 1612297571, "company": "samsung"}, {"body": "Why can't you just edit the photos without leaving any members behind? Show their faces equally!", "score": 0, "created_utc": 1612297086, "company": "samsung"}, {"body": "Where is the phone all I see are attractive men woozy_face", "score": 0, "created_utc": 1612296786, "company": "samsung"}, {"body": "what problem do you have with j-hope? you contract them as your BA as a group so it's your job to give equal spot light to all members you could've done better for the photoshoot but you chose to did j-hope so dirty by putting so far in the back", "score": 2, "created_utc": 1612296374, "company": "samsung"}, {"body": "Oh..my..God..they look so good mashallah.", "score": 0, "created_utc": 1612296146, "company": "samsung"}, {"body": "Unique impeccable as always # # # #BTS #V #BTSV #KimTaehyung # #Taehyung", "score": 0, "created_utc": 1612296001, "company": "samsung"}, {"body": "Nice mobile i like you....", "score": 0, "created_utc": 1612295053, "company": "samsung"}, {"body": "This reminds of", "score": 0, "created_utc": 1612295050, "company": "samsung"}, {"body": "treat all 7 members as equal if you want to sell \"BTS is 7\" image instead of cheating fans with lies. Respect all members. Fix this with samsung. We are not buying any of these products.", "score": 3, "created_utc": 1612294936, "company": "samsung"}, {"body": "Is Samsung Galaxy S21 good?", "score": 0, "created_utc": 1612294853, "company": "samsung"}, {"body": "Where is the unlike button for this? Samsung turning into esquire. So did Bigshit tell you to be disrespectful and take lousy photos for your ad?", "score": 5, "created_utc": 1612294573, "company": "samsung"}, {"body": "Participate from here", "score": 1, "created_utc": 1612294106, "company": "samsung"}, {"body": "Want it to listen BTS song in these Sony premium headphones so participate here", "score": 1, "created_utc": 1612294067, "company": "samsung"}, {"body": "Wow. Wow. You got the right persons.", "score": 0, "created_utc": 1612293629, "company": "samsung"}, {"body": "Forget the phone I want TAEHYUNG", "score": 0, "created_utc": 1612292924, "company": "samsung"}, {"body": "Just wow! exploding_head", "score": 0, "created_utc": 1612291876, "company": "samsung"}, {"body": "You...yourself,can you take it easy? clown_face", "score": 0, "created_utc": 1612291275, "company": "samsung"}, {"body": "I need help. Lately anytime I unlock my S10 phone it automatically opens the Chrome app with some spam website on it. Any adjustments in settings doesn't do anything. Can you help?", "score": 0, "created_utc": 1612290738, "company": "samsung"}, {"body": "Jimin smiling_face_with_heart-eyes smiling_face_with_heart-eyes smiling_face_with_heart-eyes #JIMIN #RARKJIMIN #Jiminie", "score": 4, "created_utc": 1612290162, "company": "samsung"}, {"body": "They're all wearing black cuz I just died with all that smiling_face_with_heart-eyes #samsungknows #causeofdead #BTSARMY", "score": 0, "created_utc": 1612289471, "company": "samsung"}, {"body": "are you guys dropping the note 21 at all this year? I need to know", "score": 0, "created_utc": 1612289384, "company": "samsung"}, {"body": "Jimin is a perfect model. His pose and appearance make Galaxys21 stand out more !!!", "score": 2, "created_utc": 1612289001, "company": "samsung"}, {"body": "I see Park Jimin", "score": 1, "created_utc": 1612288685, "company": "samsung"}, {"body": "They all look so great!!! purple_heart purple_heart purple_heart #GalaxyxBTS #BTS", "score": 0, "created_utc": 1612288546, "company": "samsung"}, {"body": "Omg so hondsome purple_heart purple_heart we love you guys", "score": 1, "created_utc": 1612287864, "company": "samsung"}, {"body": "Dear BTS,Our Myanmar people love k-pop and South Korea coz you have firm democracy. Now in Myanmar military who isn't our real leader is bullying on Myanmar real leader , Myanmar people and democracy. We sad for democracy Please (really please) Could you stand with me as aforce.", "score": 1, "created_utc": 1612287298, "company": "samsung"}, {"body": "after the latest update on my S20 I cannot open my messages or phone book and notifications lock my screen when I click on them... please fix", "score": 0, "created_utc": 1612287240, "company": "samsung"}, {"body": "Okay but why is jungkook benttttt his face seems smushed sad_but_relieved_face ughh everyone looks so good either way downcast_face_with_sweat", "score": 0, "created_utc": 1612286828, "company": "samsung"}, {"body": "I hate to say this as a Samsung fan but I don't like the new update", "score": 0, "created_utc": 1612286423, "company": "samsung"}, {"body": "Ill buy one because the Park Jimin is endorsing it.", "score": 0, "created_utc": 1612286075, "company": "samsung"}, {"body": "Thank you relieved_face relieved_face relieved_face", "score": 0, "created_utc": 1612285801, "company": "samsung"}, {"body": "I have been using the phone since launch date and this is a true ultra by all means except for battery and heating. The camera is exceptionally good, especially the 10x. But disappointed since I'm not able to get the full experience because of battery and heating !", "score": 0, "created_utc": 1612285762, "company": "samsung"}, {"body": "just pls don't release a new bts phone or else I'm broke broke loudly_crying_face loudly_crying_face loudly_crying_face have mercy on my wallet", "score": 0, "created_utc": 1612285619, "company": "samsung"}, {"body": "P A P A S I T O S  My vote for Favorite Music Group at the #KCA is BTS #VoteBTS", "score": 1, "created_utc": 1612283555, "company": "samsung"}, {"body": "Ok but when can I get an BTS edition phone?? Everything else is irrelevant", "score": 0, "created_utc": 1612282111, "company": "samsung"}, {"body": "The arrows on photos I share from workouts started getting embedded since January 14, 2020. The arrows to the left side and right side of the photo which is used to select a image to be used.", "score": 0, "created_utc": 1612281410, "company": "samsung"}, {"body": "JIMIN purple_heart purple_heart purple_heart purple_heart purple_heart purple_heart purple_heart purple_heart Oh they are all cool. And Jimin is too graceful. #JIMIN #SUGA #JIN", "score": 0, "created_utc": 1612281306, "company": "samsung"}, {"body": "Like me black_heart crown", "score": 2, "created_utc": 1612278952, "company": "samsung"}, {"body": "Damn... That's f*cking hot.", "score": 0, "created_utc": 1612278297, "company": "samsung"}, {"body": "They look so fine weary_face smiling_face_with_heart-eyes but I'm never leaving my iPhone lol", "score": 0, "created_utc": 1612278154, "company": "samsung"}, {"body": "Buy and stream \" UP \" by Cardi B this Friday", "score": 0, "created_utc": 1612278007, "company": "samsung"}, {"body": "do you not have any 64gb phones in a 150-170 budget Also do you have the A21s in 64gb?", "score": 0, "created_utc": 1612276906, "company": "samsung"}, {"body": "JIMIN kissing_face_with_closed_eyes two_hearts sparkles", "score": 0, "created_utc": 1612276753, "company": "samsung"}, {"body": "Aint nobody paying attention to that that Ipad", "score": 0, "created_utc": 1612276356, "company": "samsung"}, {"body": "YOU'RE SO AMAZING #SUGA", "score": 0, "created_utc": 1612275907, "company": "samsung"}, {"body": "I'm broke but I want this phone so badly. I would ditch apple just for BTS if I had the money to buy the phone loudly_crying_face", "score": 0, "created_utc": 1612275744, "company": "samsung"}, {"body": "OMG I want one it is so pretty pleading_face red_heart smiling_face_with_heart-eyes", "score": 0, "created_utc": 1612275720, "company": "samsung"}, {"body": "Android Security Advisory  February 2021 Monthly Rollup. Number AV21-051 Date 2 February 2021 Android Security Bulletin.", "score": 0, "created_utc": 1612275700, "company": "samsung"}, {"body": "their visuals are so unreal i swear fire fire fire", "score": 0, "created_utc": 1612275633, "company": "samsung"}, {"body": "Phone of the Year #GalaxyS21", "score": 0, "created_utc": 1612275361, "company": "samsung"}, {"body": "Taehyung just keeps getting more perfect slightly_smiling_face broken_heart", "score": 0, "created_utc": 1612275171, "company": "samsung"}, {"body": "thanks for almost burning my house down and injuring my parents tonight with your defective battery samsung a10 with less than a year of use", "score": 14, "created_utc": 1612274373, "company": "samsung"}, {"body": "How many more of these do u guys have lying around? eye mouth eye Pls don't be shy, release some more", "score": 0, "created_utc": 1612273665, "company": "samsung"}, {"body": "#Jin He shines everywhere, anytime. # # # #JIN #SEOKJIN #BTSJIN", "score": 2, "created_utc": 1612273420, "company": "samsung"}, {"body": "Super Worldwide Handsome # # #JIN #SEOKJIN #BTSJIN", "score": 0, "created_utc": 1612273069, "company": "samsung"}, {"body": "I've recently sent in my old phone for trade-in but forgot to include my pack with my reference number on. What can I do to make sure the phone I posted is traded in to the right account?", "score": 0, "created_utc": 1612272060, "company": "samsung"}, {"body": "#S21EpicMoments Definitely downloading some Liverpool soccer games", "score": 0, "created_utc": 1612271851, "company": "samsung"}, {"body": "thank you samsung &lt;3", "score": 0, "created_utc": 1612271848, "company": "samsung"}, {"body": "Can you upload that hard drive onto a shareable Google drive folder and provide the link, please? pleading_face", "score": 0, "created_utc": 1612271726, "company": "samsung"}, {"body": "There should be an emergency Mute button on your phones. Almost blew out my eardrums when I accidentally turned the volume up to max while wearing ear buds.", "score": 0, "created_utc": 1612271104, "company": "samsung"}, {"body": "PARK JIMIN fire", "score": 0, "created_utc": 1612271018, "company": "samsung"}, {"body": "NOOOO WHY ATE THEY ALL SOOOOO HANDSOME AND PRETTY?! FUCK NOOO... sparkles BECAUSE sparkles THEY sparkles ARE sparkles BTS sparkles", "score": 0, "created_utc": 1612270666, "company": "samsung"}, {"body": "Samsung a71", "score": 0, "created_utc": 1612270653, "company": "samsung"}, {"body": "These photos are so incredibly powerful. Handsome BTS! purple_heart purple_heart purple_heart #GalaxyxBTS #BTS", "score": 2, "created_utc": 1612270647, "company": "samsung"}, {"body": "Why I'm so poor loudly_crying_face", "score": 0, "created_utc": 1612270629, "company": "samsung"}, {"body": "No-one looking at those fridges when you have a whole Kim Taehyung there! smiling_face_with_heart-eyes smiling_face_with_hearts", "score": 0, "created_utc": 1612269473, "company": "samsung"}, {"body": "Can I ask why my phone updates are getting worse no to mention I bought a powerbank cause I was using it alot, now it doesn't even charge it just stays on the same percent.", "score": 0, "created_utc": 1612268942, "company": "samsung"}, {"body": "Hot damn it!! smiling_face_with_heart-eyes", "score": 0, "created_utc": 1612268690, "company": "samsung"}, {"body": "THANK YOU purple_heart", "score": 0, "created_utc": 1612268684, "company": "samsung"}, {"body": "yellow_heart Park Jimin yellow_heart #GalaxyxBTS #JIMIN #Jiminie #JIMINS Jimins #ParkJimin PARK JIMIN #WeLoveYouJimin", "score": 1, "created_utc": 1612268349, "company": "samsung"}, {"body": "At this point I'm not even sure....Is Samsung promoting the phones or BTS? face_with_tears_of_joy face_with_tears_of_joy purple_heart purple_heart purple_heart purple_heart", "score": 0, "created_utc": 1612268266, "company": "samsung"}, {"body": "MORE J-HOPE MORE J-HOPE warning warning warning warning warning warning warning warning warning warning warning", "score": 1, "created_utc": 1612267618, "company": "samsung"}, {"body": "A perfect representation of army's priorities... Yall don't give af about hsk and it shows even ads are biased and so is bh but what's new...", "score": 5, "created_utc": 1612267554, "company": "samsung"}, {"body": "Now give hoseok a solo shot like wtf is this so disrespectful to push him at the back, we want to see Hoseok beautiful face and his cool look too angry_face angry_face", "score": 7, "created_utc": 1612267460, "company": "samsung"}, {"body": "it would be better if you put j-hope in a place where we can see him more clearly??? all of your pictures have him so \"far behind\" it's a joke", "score": 6, "created_utc": 1612267327, "company": "samsung"}, {"body": "Drop the full tea I can't wait anymore loudly_crying_face purple_heart #VoteBTS #KCA", "score": 4, "created_utc": 1612267280, "company": "samsung"}, {"body": "Can you please reply regarding my s21 order? My order number isn't working and I can track an order. I've sent a few tweets and your online chat isn't working.", "score": 1, "created_utc": 1612266608, "company": "samsung"}, {"body": "this has happened with no trauma, it seems to be a design fault as I can see it's happened to lots of people. I've only had the phone for 2 months.", "score": 1, "created_utc": 1612266543, "company": "samsung"}, {"body": "You can't write \"visual\" without V, wow beauty is out of this world smiling_face_with_heart-eyes", "score": 0, "created_utc": 1612266278, "company": "samsung"}, {"body": "The most beautiful boyband in the world purple_heart purple_heart I love BTS", "score": 0, "created_utc": 1612265917, "company": "samsung"}, {"body": "Amazing phones yeppp", "score": 0, "created_utc": 1612265651, "company": "samsung"}, {"body": "LOOOK THE PHONES ARE SO COOL MAN", "score": 0, "created_utc": 1612265637, "company": "samsung"}, {"body": "their power", "score": 0, "created_utc": 1612265274, "company": "samsung"}, {"body": "ain't no one looking at the phones", "score": 0, "created_utc": 1612265263, "company": "samsung"}, {"body": "just recieved my s21 + and the screen is so blurry. What can be done? Screen quality is terrible and planning to send back.", "score": 0, "created_utc": 1612265105, "company": "samsung"}, {"body": "if i record a video with galaxy s21, will I be able to record the audio using the buds ?", "score": 0, "created_utc": 1612264992, "company": "samsung"}, {"body": "Welcome to the world of Kenya for pre-order and Existing Samung Galaxy S21 ultra. #GalaxyxBTS", "score": 0, "created_utc": 1612264945, "company": "samsung"}, {"body": "WOAH fire", "score": 0, "created_utc": 1612264885, "company": "samsung"}, {"body": "I gotta mention The Park Jimin flushed_face exploding_head yellow_heart He's looking hottest fire yellow_heart #ParkJimin My heart rn pleading_face sneezing_face yellow_heart", "score": 16, "created_utc": 1612264843, "company": "samsung"}, {"body": "The BTS are glowing fire", "score": 1, "created_utc": 1612264768, "company": "samsung"}, {"body": "ayoo chill I'm just trying to enjoy my Twitter feed", "score": 1, "created_utc": 1612264760, "company": "samsung"}, {"body": "JIMIN heart_suit heart_suit heart_suit", "score": 0, "created_utc": 1612264407, "company": "samsung"}, {"body": "Jimin prince_light_skin_tone", "score": 1, "created_utc": 1612264278, "company": "samsung"}, {"body": "Kim Taehyung visual of the century", "score": 0, "created_utc": 1612264025, "company": "samsung"}, {"body": "Te Best models sparkles purple_heart purple_heart", "score": 0, "created_utc": 1612264010, "company": "samsung"}, {"body": "They're so handsome, I love them all so much", "score": 0, "created_utc": 1612263803, "company": "samsung"}, {"body": "hey why after the new patch update my camera is failed,my fingerprint is not working and my flashlight wont turn on, and the LED didnt turn on and also they dont recognize portrait or rotate mode please help, im using samsung note 9", "score": 0, "created_utc": 1612263597, "company": "samsung"}, {"body": "The last update is nightmare ... very bad design and colors ... extremely confusing... is it 25% or 75% ... very ugly ...how to get the old one ?", "score": 0, "created_utc": 1612263592, "company": "samsung"}, {"body": "you need to fix this bug, this is ridiculous setting up a new #S215G #S21Ultra5G let's you add a fingerprint login w/o a passwd. Later, NO password is accepted . The only way to solve AFAI can see is a tricky factor reset, start over from zero, and add passwd.", "score": 0, "created_utc": 1612263116, "company": "samsung"}, {"body": "ain't nobody looking at the phone loudly_crying_face", "score": 0, "created_utc": 1612262958, "company": "samsung"}, {"body": "Wow that's crazy. If you want to enhance your business please see below.", "score": 0, "created_utc": 1612262906, "company": "samsung"}, {"body": "RELEASE THE PHOTOCARDS IN ALL COUNTRIES", "score": 0, "created_utc": 1612262755, "company": "samsung"}, {"body": "your s20 button FELL off (no damage or drops) after a month and you're trying to charge me $172? You gotta be high.", "score": 0, "created_utc": 1612262732, "company": "samsung"}, {"body": "Hey yo bro....play these advertisements in sri lankan tv chnnls toooo...im sooo sick of waiting", "score": 0, "created_utc": 1612262664, "company": "samsung"}, {"body": "Please tell us who's the photographer for these photos !!!!!!", "score": 0, "created_utc": 1612262641, "company": "samsung"}, {"body": "I'M GONNA PASS AWAY", "score": 0, "created_utc": 1612262464, "company": "samsung"}, {"body": "RM and J-Hope did not come to play. Gorgeous! smiling_face_with_heart-eyes purple_heart purple_heart purple_heart", "score": 2, "created_utc": 1612262402, "company": "samsung"}, {"body": "Hi Again! I'm still haven't gotten a resolution to my spen replacement. It's been over a month and Samsung continues to fail me. flushed_face exploding_head pouting_face angry_face thinking_face face_with_raised_eyebrow face_with_monocle", "score": 0, "created_utc": 1612261669, "company": "samsung"}, {"body": "to bring back phone SD card readers...Google is getting rid of unlimited photo storage and I gotta to backup my pics somewhere!", "score": 0, "created_utc": 1612261184, "company": "samsung"}, {"body": "Hello I hope if you can made in future the circle one pleading_face purple_heart", "score": 0, "created_utc": 1612260732, "company": "samsung"}, {"body": "Planing to come back for the first time since the Great Note 4... Tempted to wait for note 21 though..", "score": 0, "created_utc": 1612260425, "company": "samsung"}, {"body": "apparently, your staff feels it's funny to attach notes on packages that are returned to customers. How unprofessional", "score": 0, "created_utc": 1612260099, "company": "samsung"}, {"body": "i want this phone and the person care the phone pleas two_hearts two_hearts two_hearts", "score": 0, "created_utc": 1612259942, "company": "samsung"}, {"body": "Jiminnn", "score": 0, "created_utc": 1612259645, "company": "samsung"}, {"body": "Watch this video it's so funny", "score": 0, "created_utc": 1612259640, "company": "samsung"}, {"body": "Why hasn't my note 20 gotten the new update? This is why iphone is gonna be my next phone person_facepalming", "score": 1, "created_utc": 1612259452, "company": "samsung"}, {"body": "PARK JIMIN kissing_face_with_closed_eyes two_hearts sparkles", "score": 0, "created_utc": 1612259420, "company": "samsung"}, {"body": "I'm deeply attached to my iPhone but there isn't anything I wouldn't do to be RM rn.", "score": 0, "created_utc": 1612259391, "company": "samsung"}, {"body": "Send me the hard drive pls and thanks", "score": 0, "created_utc": 1612259311, "company": "samsung"}, {"body": "dudes easy, it's just a phone.", "score": 0, "created_utc": 1612259276, "company": "samsung"}, {"body": "Lmao &amp; after this twitter for iphone", "score": 0, "created_utc": 1612259124, "company": "samsung"}, {"body": "jimin looks unreal", "score": 0, "created_utc": 1612258552, "company": "samsung"}, {"body": "Ohhh Jimin red_heart fire", "score": 1, "created_utc": 1612258496, "company": "samsung"}, {"body": "Do ya except us too see th e fkcin phones with these types of models wtf.. flushed_face flushed_face nail_polish nail_polish eye mouth eye purple_heart purple_heart purple_heart skull", "score": 0, "created_utc": 1612258342, "company": "samsung"}, {"body": "Never realised how lucky I am until I recieved one of these. So when should I claim it ?", "score": 1, "created_utc": 1612258328, "company": "samsung"}, {"body": "No jungkook center, no money. Though i badly need to buy new phone right now.", "score": 0, "created_utc": 1612258301, "company": "samsung"}, {"body": "does jimin come with the phone", "score": 0, "created_utc": 1612258277, "company": "samsung"}, {"body": "Lol stop hiding jungkook. You did this to him i dont even care to buy samsung even though i planned to buy new phone. Boo", "score": 0, "created_utc": 1612257985, "company": "samsung"}, {"body": "Damn this looks good", "score": 0, "created_utc": 1612257874, "company": "samsung"}, {"body": "OMGGSHSH THANKYOUU loudly_crying_face loudly_crying_face", "score": 0, "created_utc": 1612257848, "company": "samsung"}, {"body": "I freaking changed my mind bout Samsungs just cause of BTS purple_heart", "score": 0, "created_utc": 1612257561, "company": "samsung"}, {"body": "Brand Ambassador Kim Taehyung....Perfect placement of the phone. Phone being held by beautiful fingures, resting against God Like Visuals with Intense stares. Zooming in to that zone flushed_face flushed_face #GalaxyxBTS #KimTaehyung #BTSV #", "score": 1, "created_utc": 1612257326, "company": "samsung"}, {"body": "Hey, I just noticed a few horizontal lines on the display of my galaxy note 5. I think they are hardware issues but pls can u help me? Hope you can see the horizontal lines.", "score": 0, "created_utc": 1612257247, "company": "samsung"}, {"body": "Those avocados look fresh yeah", "score": 0, "created_utc": 1612257128, "company": "samsung"}, {"body": "How is this an add", "score": 0, "created_utc": 1612256860, "company": "samsung"}, {"body": "give me more taehyung like this i will buy all", "score": 0, "created_utc": 1612256788, "company": "samsung"}, {"body": "look at my man so hot and handsome", "score": 3, "created_utc": 1612256766, "company": "samsung"}, {"body": "Why tf did you guys removed the Instagram Camera Mode on OneUi 3? I'm pissed.", "score": 0, "created_utc": 1612256465, "company": "samsung"}, {"body": "Question Why did the Samsung doesn't have have screen reader like the iPhone this is why I don't have a galaxy to me it's important because I can't read very good that's why", "score": 0, "created_utc": 1612256318, "company": "samsung"}, {"body": "7 handsome, ethereal men woman_kneeling", "score": 6, "created_utc": 1612256171, "company": "samsung"}, {"body": "love Kim", "score": 0, "created_utc": 1612255715, "company": "samsung"}, {"body": "HELP", "score": 0, "created_utc": 1612255572, "company": "samsung"}, {"body": "could you please get back to me, im still waiting on my purchase to be sent, its has been stuck on pending for the past 5 days, and no one i speak to can help, they say, we will send an email, which is getting me no where. Hope you guys can help or get back to me", "score": 0, "created_utc": 1612255559, "company": "samsung"}, {"body": "thank you, i love you", "score": 0, "created_utc": 1612255344, "company": "samsung"}, {"body": "Hello could you send me this phone for my birthday? it's February 24 &lt;3", "score": 0, "created_utc": 1612255316, "company": "samsung"}, {"body": "Why are sope not holding a phone?", "score": 0, "created_utc": 1612255118, "company": "samsung"}, {"body": "GOOD LORD", "score": 0, "created_utc": 1612254918, "company": "samsung"}, {"body": "Extravagantly handsome V. We entered the V- zone. No way out. Entangled by V's visuals smiling_face_with_smiling_eyes love-you_gesture purple_heart tiger_face purple_heart", "score": 1, "created_utc": 1612254871, "company": "samsung"}, {"body": "What the hell are you feeding this boys ?", "score": 1, "created_utc": 1612254772, "company": "samsung"}, {"body": "Jimin smiling_face_with_heart-eyes smiling_face_with_heart-eyes smiling_face_with_heart-eyes #JIMIN #Jiminie #PARKJIMIN #GalaxyS21", "score": 2, "created_utc": 1612254690, "company": "samsung"}, {"body": "Why need to zoom on every picture to see him? face_with_raised_eyebrow", "score": 3, "created_utc": 1612254612, "company": "samsung"}, {"body": "Free Jimin", "score": 0, "created_utc": 1612254531, "company": "samsung"}, {"body": "i don't even see the phones help", "score": 0, "created_utc": 1612254480, "company": "samsung"}, {"body": "Wowww Park Jimin is freaking handsome heree", "score": 0, "created_utc": 1612254355, "company": "samsung"}, {"body": "Oh man", "score": 0, "created_utc": 1612254223, "company": "samsung"}, {"body": "Wow, Jimin is strikingly handsome smiling_face_with_smiling_eyes #JIMINxSAMSUNG #JiminKingOfBandRanking #JIMIN", "score": 22, "created_utc": 1612254142, "company": "samsung"}, {"body": "I need more JIMIN's images. JIMIN is so beautiful...", "score": 0, "created_utc": 1612253822, "company": "samsung"}, {"body": "Models should be lucky since BTS is into music smiling_face_with_heart-eyes purple_heart", "score": 0, "created_utc": 1612253775, "company": "samsung"}, {"body": "After this, I abandon my huawei and I'm back to Samsung waving_hand_light_skin_tone", "score": 0, "created_utc": 1612253455, "company": "samsung"}, {"body": "Good morning to me relieved_face wow", "score": 0, "created_utc": 1612253337, "company": "samsung"}, {"body": "so true", "score": 0, "created_utc": 1612253232, "company": "samsung"}, {"body": "HELLO", "score": 0, "created_utc": 1612252937, "company": "samsung"}, {"body": "he is so handsome red_heart", "score": 0, "created_utc": 1612252875, "company": "samsung"}, {"body": "I look forward to what you have prepared!", "score": 0, "created_utc": 1612252752, "company": "samsung"}, {"body": "red_heart beating_heart red_heart beating_heart red_heart beating_heart red_heart beating_heart red_heart beating_heart red_heart beating_heart red_heart purple_heart purple_heart purple_heart purple_heart purple_heart purple_heart purple_heart We purple you", "score": 0, "created_utc": 1612252640, "company": "samsung"}, {"body": "Jimin is unreal speak-no-evil_monkey purple_heart purple_heart purple_heart purple_heart", "score": 0, "created_utc": 1612252352, "company": "samsung"}, {"body": "Jimin two_hearts two_hearts two_hearts two_hearts two_hearts two_hearts", "score": 0, "created_utc": 1612252340, "company": "samsung"}, {"body": "nobody looking at the phones raised_hand_medium-light_skin_tone slightly_smiling_face", "score": 0, "created_utc": 1612252252, "company": "samsung"}, {"body": "Black smiling_face_with_sunglasses black_heart black_heart black_heart love-you_gesture", "score": 0, "created_utc": 1612252251, "company": "samsung"}, {"body": "TREMENDAS FOTOS QUE GRITAN BTS WORLD DOMINATION smiling_face_with_sunglasses purple_heart", "score": 2, "created_utc": 1612251995, "company": "samsung"}, {"body": "WHAT", "score": 0, "created_utc": 1612251937, "company": "samsung"}, {"body": "Can y'all pls have the photo cards available in Canada Thanks", "score": 0, "created_utc": 1612251926, "company": "samsung"}, {"body": "Sexiest International Man Jeon Jungkook", "score": 2, "created_utc": 1612251764, "company": "samsung"}, {"body": "Wow wow", "score": 0, "created_utc": 1612251708, "company": "samsung"}, {"body": "Super", "score": 0, "created_utc": 1612251402, "company": "samsung"}, {"body": "Seriously it's like waiting for their tickets to go on sale all over again - ha that's what it was like last year and then pandemic happened. Come on guys, please make it good news this year if it's what I think it is! smiling_face_with_heart-eyes flushed_face face_with_tears_of_joy", "score": 1, "created_utc": 1612250938, "company": "samsung"}, {"body": "OH SO YALL JUST TRYNA MURDER HALF OF THE HUMAN RACE NOW? OKAY. I SEE HOW ITS IS", "score": 0, "created_utc": 1612250931, "company": "samsung"}, {"body": "Holy,,,", "score": 0, "created_utc": 1612250815, "company": "samsung"}, {"body": "Pls lemme breathe loudly_crying_face loudly_crying_face loudly_crying_face", "score": 0, "created_utc": 1612250646, "company": "samsung"}, {"body": "It's useless, I have been contacting Samsung past 4 months, their response, products and services are defective and refurbished like their Samsung products, its trap to clear defective refurbished products. service ref no 4315916463.", "score": 0, "created_utc": 1612250542, "company": "samsung"}, {"body": "An ART", "score": 28, "created_utc": 1612250524, "company": "samsung"}, {"body": "They're driving me crazy purple_heart", "score": 75, "created_utc": 1612250502, "company": "samsung"}, {"body": "when you want the model, but it is not the phone", "score": 1, "created_utc": 1612250276, "company": "samsung"}, {"body": "Their visuals are not joke purple_heart smiling_face_with_heart-eyes", "score": 0, "created_utc": 1612250050, "company": "samsung"}, {"body": "bangtan looking like THAT and y'all think we looking at the phones loudly_crying_face", "score": 0, "created_utc": 1612249974, "company": "samsung"}, {"body": "Yesh", "score": 0, "created_utc": 1612249624, "company": "samsung"}, {"body": "Can I have a phone for free? I'm poor and still use a S5 Neo that keep turning on and off worried_face", "score": 0, "created_utc": 1612249554, "company": "samsung"}, {"body": "Is it a zumbi scifi movie of people killing using smartphones to catch their victims?", "score": 0, "created_utc": 1612249544, "company": "samsung"}, {"body": "I only have so much storage space, Samsung!!!", "score": 0, "created_utc": 1612249393, "company": "samsung"}, {"body": "Follow on media link publications", "score": 0, "created_utc": 1612249163, "company": "samsung"}, {"body": "kim taehyung you looking so handsome and your phone also face_with_tears_of_joy", "score": 1, "created_utc": 1612249129, "company": "samsung"}, {"body": "Actually... we... don't... care... the... phone... (but litte care)", "score": 0, "created_utc": 1612249122, "company": "samsung"}, {"body": "I love V so much, he make products even cooler smiling_face_with_heart-eyes", "score": 0, "created_utc": 1612248976, "company": "samsung"}, {"body": "love it", "score": 0, "created_utc": 1612248973, "company": "samsung"}, {"body": "I want to try s21. I like the low-priced Samsung phone the most.", "score": 1, "created_utc": 1612248961, "company": "samsung"}, {"body": "Would be better if i don't have to zoom in to see hobi smiling_face_with_tear", "score": 4, "created_utc": 1612248947, "company": "samsung"}, {"body": "Park Jimin Bts frontman", "score": 3, "created_utc": 1612248913, "company": "samsung"}, {"body": "Samsung do they come free with the phone?!", "score": 0, "created_utc": 1612248883, "company": "samsung"}, {"body": "So handsome #MainDancer #LeadVocal # #JIMIN # #BTSJIMIN # #", "score": 0, "created_utc": 1612248863, "company": "samsung"}, {"body": "Aaaaaaa JIMIN C #MainDancer #LeadVocal # #JIMIN # #BTSJIMIN # #", "score": 0, "created_utc": 1612248853, "company": "samsung"}, {"body": "oh my god", "score": 0, "created_utc": 1612248709, "company": "samsung"}, {"body": "DPING IT RIFHT EVERY SINGLE TIMR", "score": 0, "created_utc": 1612248620, "company": "samsung"}, {"body": "The genius model Kim Taehyung fire He totally understand to modeling purple_heart # # #BTSV #KimTaehyung #taehyung", "score": 5, "created_utc": 1612248583, "company": "samsung"}, {"body": "Help us. Military has detained our elected democratic government,party leaders and political activists in television channels and phone services are cut out nationwide. Help us,world leading democracy. #Save_Myanmar Myanmar_(Burma) #Aung_San_Suu_Kyi_government", "score": 0, "created_utc": 1612248505, "company": "samsung"}, {"body": "So.....what are we supposed to look at?? eyes", "score": 0, "created_utc": 1612248497, "company": "samsung"}, {"body": "God, send help please, I'm about to de.", "score": 0, "created_utc": 1612248418, "company": "samsung"}, {"body": "The world need to know what's happening in #Myanmar #Save_Myanmar Myanmar_(Burma) #Save_Burma Myanmar_(Burma) #Reject_the_Military #We_need_democracy #Help_us_and_support_our_Leader, #Aung_San_Suu_Kyi_government.", "score": 0, "created_utc": 1612248384, "company": "samsung"}, {"body": "Jimin is so handsome", "score": 0, "created_utc": 1612248370, "company": "samsung"}, {"body": "I want that phone! loudly_crying_face loudly_crying_face loudly_crying_face loudly_crying_face Why I am poor /", "score": 1, "created_utc": 1612248122, "company": "samsung"}, {"body": "SHIIIIIIT THEYRE FINE FINE", "score": 0, "created_utc": 1612248085, "company": "samsung"}, {"body": "Burmese(Myanmar) democray has failed under the military's ilegal charge.They have detained all our democrayed leaders. Please help Myanmar and support democracy. #JusticeForMyanmar #AungSanSuuKyi_government #SaveMyanmar #civil_disobedience #RejectTheMilitary #HelpMyanmar", "score": 0, "created_utc": 1612248071, "company": "samsung"}, {"body": "We as a citizen of Myanmar not agree with the current move and would like to request the world leaders.UN and the world medias help our country,our leaders,our people,from this bitter acts.We want democracy and want our country to develop as our nabouring countries. #SaveMyanmar", "score": 0, "created_utc": 1612248019, "company": "samsung"}, {"body": "This is my legends", "score": 0, "created_utc": 1612248005, "company": "samsung"}, {"body": "OMGGGGGGGG PERFECT BTS IS THE BEST", "score": 0, "created_utc": 1612247994, "company": "samsung"}, {"body": "Wat phones i see none all I see are sexy models", "score": 0, "created_utc": 1612247945, "company": "samsung"}, {"body": "yo! yoongi doesnt have a phone ?!?", "score": 0, "created_utc": 1612247648, "company": "samsung"}, {"body": "Samsung store being obvious with pushing BigHit's favorite", "score": 0, "created_utc": 1612247581, "company": "samsung"}, {"body": "WTSFFS", "score": 0, "created_utc": 1612247569, "company": "samsung"}, {"body": "Park Jimin Sir!! Please step on me pleading_face", "score": 0, "created_utc": 1612247523, "company": "samsung"}, {"body": "STAHP I HAVE NO MONEY!!!!!", "score": 0, "created_utc": 1612247378, "company": "samsung"}, {"body": "Samsung we heartily sorry for not notice your phone, bcz our boys look so stunning as usual. But thq for giving this ad.", "score": 0, "created_utc": 1612247355, "company": "samsung"}, {"body": "Waiting...waiting... face_with_steam_from_nose", "score": 0, "created_utc": 1612247157, "company": "samsung"}, {"body": "are you going to release another BTS phone? Let us know as early as now so I can condition my mind. I JUST AVAILED THE S21 ULTRA pleading_face grinning_face_with_sweat am I preparing for a broken heart?", "score": 0, "created_utc": 1612247123, "company": "samsung"}, {"body": "Do give away naa loudly_crying_face loudly_crying_face hugging_face hugging_face hugging_face loudly_crying_face loudly_crying_face", "score": 2, "created_utc": 1612247075, "company": "samsung"}, {"body": "I can't even see j-hope is this a joke???", "score": 1, "created_utc": 1612247055, "company": "samsung"}, {"body": "Why is hoseok so invisible wtaf is this", "score": 0, "created_utc": 1612247032, "company": "samsung"}, {"body": "I can't see my fave part 83639263827. Thank you Samsung.", "score": 0, "created_utc": 1612247029, "company": "samsung"}, {"body": "Why do y'all think I have some sort of super vision? This is the nth time I've been zooming in and using remini to see j-hope what is this incompetence", "score": 19, "created_utc": 1612246962, "company": "samsung"}, {"body": "This", "score": 0, "created_utc": 1612246799, "company": "samsung"}, {"body": "WWWWHHHEEEEEDSKDJXJJSMZMXBZNZ", "score": 0, "created_utc": 1612246796, "company": "samsung"}, {"body": "HELLO?!?", "score": 0, "created_utc": 1612246794, "company": "samsung"}, {"body": "why are the look so hot? omooo fearful_face face_blowing_a_kiss", "score": 0, "created_utc": 1612246526, "company": "samsung"}, {"body": "Tae's eyes smiling_face_with_heart-eyes", "score": 0, "created_utc": 1612246279, "company": "samsung"}, {"body": "WHAT ARE YOU ALL SO HOT FR", "score": 0, "created_utc": 1612246258, "company": "samsung"}, {"body": "Ufff Kim Taehyung he alone do a better job", "score": 0, "created_utc": 1612246139, "company": "samsung"}, {"body": "This center park jimin is so powerful smiling_face_with_sunglasses fire fire", "score": 5, "created_utc": 1612246119, "company": "samsung"}, {"body": "How about we start the next project on a phone that is manufactured without fragile back or front glass? S8 was front glass tenderness, S9 is back, I'll stay away from the S10 because I'm guessing you decided both sides being tender would be more profitable face_with_rolling_eyes middle_finger", "score": 0, "created_utc": 1612246050, "company": "samsung"}, {"body": "AAAHHHH ME ALTERAN!!!", "score": 0, "created_utc": 1612246016, "company": "samsung"}, {"body": "OMG", "score": 0, "created_utc": 1612245873, "company": "samsung"}, {"body": "V is everything loudly_crying_face smiling_face_with_heart-eyes hundred_points sparkles sparkles sparkles", "score": 4, "created_utc": 1612245788, "company": "samsung"}, {"body": "Y'all seeing jimin's neck flushed_face flushed_face flushed_face", "score": 2, "created_utc": 1612245757, "company": "samsung"}, {"body": "Oh I'm meant to be looking at the phone right right I knew that", "score": 0, "created_utc": 1612245636, "company": "samsung"}, {"body": "what phone?", "score": 0, "created_utc": 1612245475, "company": "samsung"}, {"body": "drooling_face astonished_face astonished_face astonished_face my baby look so good", "score": 0, "created_utc": 1612245431, "company": "samsung"}, {"body": "bestie no one is looking at the phones face_savoring_food", "score": 0, "created_utc": 1612245412, "company": "samsung"}, {"body": "Thank you pleading_face", "score": 0, "created_utc": 1612245407, "company": "samsung"}, {"body": "Jiminshiiiiiiii", "score": 1, "created_utc": 1612245394, "company": "samsung"}, {"body": "Samsung doing God's work over here!!! Keep giving up these pics. purple_heart purple_heart purple_heart purple_heart purple_heart", "score": 1, "created_utc": 1612245155, "company": "samsung"}, {"body": "Why Hobi hyung is too far back? face_with_rolling_eyes", "score": 0, "created_utc": 1612245121, "company": "samsung"}, {"body": "Beautiful phone with beautiful men Kings #BTS Kim Taehyung purple_heart smiling_face_with_heart-eyes", "score": 0, "created_utc": 1612245014, "company": "samsung"}, {"body": "Give me a free phone pleading_face pleading_face pleading_face uwu", "score": 0, "created_utc": 1612244992, "company": "samsung"}, {"body": "WHAT", "score": 0, "created_utc": 1612244948, "company": "samsung"}, {"body": "BTS Kings Worldwide Handsome", "score": 0, "created_utc": 1612244819, "company": "samsung"}, {"body": "Omg kings", "score": 0, "created_utc": 1612244591, "company": "samsung"}, {"body": "Aren't this advertisement in Sri Lanka", "score": 0, "created_utc": 1612244498, "company": "samsung"}, {"body": "Park Jimin smiling_face_with_heart-eyes fire", "score": 0, "created_utc": 1612244476, "company": "samsung"}, {"body": "extremely ungrateful to buy a phone from #Samsung took 75k at the time of buying it and now they are asking for 22k just for a charging slot. and what should I say about service!!! #poorservice #Samsung #customerservice #s10plus", "score": 2, "created_utc": 1612244343, "company": "samsung"}, {"body": "#SUGA isn't even holding a phone... and I still want to buy one. purple_heart", "score": 0, "created_utc": 1612244265, "company": "samsung"}, {"body": "give me free photocards", "score": 1, "created_utc": 1612244242, "company": "samsung"}, {"body": "dude why the hell did you just shove namjoon and hoseok to the back?? like what's the point?? skull", "score": 3, "created_utc": 1612243979, "company": "samsung"}, {"body": "i can't see j-hope this is really unprofessional /", "score": 9, "created_utc": 1612243966, "company": "samsung"}, {"body": "Please be a phone i want it for my birthday pleading_face", "score": 0, "created_utc": 1612243927, "company": "samsung"}, {"body": "Prettiest man alive! fire fire fire fire", "score": 1, "created_utc": 1612243907, "company": "samsung"}, {"body": "The exact #Suga", "score": 3, "created_utc": 1612243881, "company": "samsung"}, {"body": "stunning # # # #JIN #SEOKJIN", "score": 17, "created_utc": 1612243857, "company": "samsung"}, {"body": "Wow Park Jimin clapping_hands_light_skin_tone fire", "score": 0, "created_utc": 1612243783, "company": "samsung"}, {"body": "Best brand ambassador and Model Kim Seokjin - the most handsome guy in the world and official visual # # # #JIN #SEOKJIN", "score": 27, "created_utc": 1612243782, "company": "samsung"}, {"body": "Jimin plus Samsung and in black is a sophisticated perfection", "score": 0, "created_utc": 1612243772, "company": "samsung"}, {"body": "Samsung uploaded this so that we see the mobiles but what I see I only see", "score": 3, "created_utc": 1612243755, "company": "samsung"}, {"body": "hi, my s21+ randomly closes the facebook app whenever i scroll + when i view facebook stories it barely passes a second before it crashes into the home screen. also i can't open the weather app!!! tired_face", "score": 0, "created_utc": 1612243621, "company": "samsung"}, {"body": "I swear I never looked to tho phone sorry my eyes are on those beautiful faces", "score": 0, "created_utc": 1612243618, "company": "samsung"}, {"body": "BTS in black WORLD DOMINATION black_heart black_heart black_heart black_heart", "score": 0, "created_utc": 1612243549, "company": "samsung"}, {"body": "hi, can anyone help please? I keep getting this pop up. Have cleared cookies and cache but every time I wake phone I get one of these, it's an s9. Is there something I can to to stop it?", "score": 2, "created_utc": 1612243538, "company": "samsung"}, {"body": "YOU KIDDING????? gosh the tease", "score": 0, "created_utc": 1612243512, "company": "samsung"}, {"body": "Omg they look gorgeous as always pleading_face purple_heart purple_heart", "score": 0, "created_utc": 1612243084, "company": "samsung"}, {"body": "Just lemme see hoseok a bit more i implore loudly_crying_face loudly_crying_face loudly_crying_face loudly_crying_face", "score": 0, "created_utc": 1612242915, "company": "samsung"}, {"body": "Galaxy buds live bts version pleaseeee", "score": 0, "created_utc": 1612242910, "company": "samsung"}, {"body": "The only one that matters purple_heart #Taehyung #kimtaehyung #taetae #tae #v", "score": 2, "created_utc": 1612242539, "company": "samsung"}, {"body": "Ok jhope suga wer is the phone?", "score": 0, "created_utc": 1612242455, "company": "samsung"}, {"body": "Fallin in love again", "score": 0, "created_utc": 1612242429, "company": "samsung"}, {"body": "say sike rn worried_face fearful_face", "score": 0, "created_utc": 1612242311, "company": "samsung"}, {"body": "Wow Park Jimin", "score": 0, "created_utc": 1612242190, "company": "samsung"}, {"body": "THERE'S NO ONE LIKE THEM smiling_face_with_heart-eyes fire smiling_face_with_heart-eyes fire", "score": 0, "created_utc": 1612242175, "company": "samsung"}, {"body": "3d sensors for front facing camera if not I'm leaving Samsung after 10 years I've had every phone", "score": 0, "created_utc": 1612242135, "company": "samsung"}, {"body": "Samsung thanks for such perfection. Kim Taehyung sports the phone perfectly. #V", "score": 0, "created_utc": 1612241985, "company": "samsung"}, {"body": "Taehyung's aura always hits differently....", "score": 2, "created_utc": 1612241974, "company": "samsung"}, {"body": "Gay I'm not supporting this God wouldn't", "score": 0, "created_utc": 1612241815, "company": "samsung"}, {"body": "Taehyung the perfect brand ambassador showcasing the phone with his amazing visual heart_with_arrow trio two_hearts Jungkook, looking HOT fire as always with that black leather jacket!! black_heart black_heart I can wait as long as you show me more Jimin purple_heart star-struck smiling_face_with_heart-eyes hugging_face face_blowing_a_kiss PARK JIMIN", "score": 2, "created_utc": 1612241811, "company": "samsung"}, {"body": "Wow #JIMIN so gud", "score": 0, "created_utc": 1612241754, "company": "samsung"}, {"body": "Wow great shoes", "score": 0, "created_utc": 1612241667, "company": "samsung"}, {"body": "Kim Taehyung is so beautiful", "score": 0, "created_utc": 1612241662, "company": "samsung"}, {"body": "TEASERS!!", "score": 0, "created_utc": 1612241487, "company": "samsung"}, {"body": "Samsung, with all due respect, ain't nobody looking at the phones but we appreciate the effort", "score": 0, "created_utc": 1612241373, "company": "samsung"}, {"body": "Jimin is the perfect brand ambassador smiling_face_with_heart-eyes", "score": 0, "created_utc": 1612241347, "company": "samsung"}, {"body": "Cutie Sexy Lovely hatching_chick purple_heart #JIMIN # #ParkJimin #JiminKingOfKPOP #JiminWeLoveYou", "score": 0, "created_utc": 1612241289, "company": "samsung"}, {"body": "Omg samsung THANK YOU #GalaxyxBTS", "score": 0, "created_utc": 1612241232, "company": "samsung"}, {"body": "now we're talking.", "score": 0, "created_utc": 1612241100, "company": "samsung"}, {"body": "We want charger and earphone in our mobile cage...please don't follow the IPhone.. Create your new and own style face_blowing_a_kiss face_blowing_a_kiss", "score": 1, "created_utc": 1612240768, "company": "samsung"}, {"body": "Omg my Handsomes pleading_face purple_heart purple_heart", "score": 0, "created_utc": 1612240759, "company": "samsung"}, {"body": "Hobi and yoongi isn't even holding a phone!!! We are soo whipped for them", "score": 1, "created_utc": 1612240685, "company": "samsung"}, {"body": "I wonder whose hand is it? smirking_face thinking_face", "score": 0, "created_utc": 1612240610, "company": "samsung"}, {"body": "Drop the collab version!!", "score": 0, "created_utc": 1612240407, "company": "samsung"}, {"body": "Yessss Park Jimin! fire yellow_heart", "score": 2, "created_utc": 1612240339, "company": "samsung"}, {"body": "Suga and Samsung are great!!!", "score": 1, "created_utc": 1612240294, "company": "samsung"}, {"body": "#V is the best #KimTaehyung purple_heart", "score": 0, "created_utc": 1612240288, "company": "samsung"}, {"body": "Jimin gorgeous", "score": 1, "created_utc": 1612240224, "company": "samsung"}]}